{"https://registrar.umd.edu/veterans-benefits/veterans-benefits-faqs": ["Veteran Certifications Services | Veterans Benefits FAQs Admissions/Transfer Questions Students wishing to inquire about undergraduate admissions should contact the Office of Undergraduate Admissions directly by either calling 301-314-TERP (8377) or sending an email to [ApplyMaryland@umd.edu](mailto:ApplyMaryland@umd.edu). Students wishing to inquire about graduate admission should contact The Graduate School directly by either calling 301-405-3644 or sending an email to [gradschool@umd.edu](mailto:gradschool@umd.edu). While the application process is the same as that of other students, upon admission, veterans wishing to use educational benefits may need to provide additional documentation, such as a Certificate of Eligibility (COE) from the VA to demonstrate their eligibility for benefits. Veterans applying as undergraduates, please also see [Prospective Students - Special Audiences](https://admissions.umd.edu/persona/prospective-students). Yes, all newly admitted undergraduate students are required to attend a New Student Orientation Program. At Orientation, you will meet with an advisor and get registered for your first semesters classes. You will then be able to get your UMD ID card and submit your forms for VA certification. - Graduate students will also have orientation advising with their program department, and will be able to register afterward. - Undergraduate students who are currently on active duty or former service members in the United States Armed Forces are eligible to be awarded six credits of lower level general elective credits. These credits are awarded for the completion of basic physical fitness and basic military science as part of basic military training. You may request your military transcripts through the Joint Services Transcript (JST) system. This transcript includes your military training and experiences. Submit your transcript to the Office of Undergraduate Admissions or to the Office of the University Registrar to receive the undergraduate elective credit. For more on this policy, please refer to [Prior Learning Credit - Basic Military Training](https://dev-registrar-umd.pantheonsite.io/transfer-credit/prior-learning-credit). VA Benefits Questions There are several types of Veteran Education Benefits available to service members, and in some cases to their family members as well: Post-9/11 GI Bill (Chapter 33): The Post-9/11 GI Bill provides up to 36 months of education benefits to eligible veterans and service members, and to their children or spouses in some cases. Benefits can cover full tuition and fees at public institutions, and up to a certain amount at private or foreign institutions. It also provides a monthly housing allowance and a stipend for textbooks and supplies. - Montgomery GI Bill (Chapter 30): This benefit provides up to 36 months of education benefits to eligible veterans and service members. This program requires a monetary contribution from the service member. - Montgomery GI Bill Selected Reserve (Chapter 1606): This program offers education benefits to eligible members of the Selected Reserve, which includes the Army, Navy, Air Force, Marine Corps, Coast Guard Reserves, Army National Guard, and Air National Guard. - Reserve Educational Assistance Program (REAP, Chapter 1607): This is an education benefit for members of the Reserve components called or ordered to active duty in response to a war or national emergency. - Veterans Educational Assistance Program (VEAP, Chapter 32): VEAP is available for veterans who enlisted between 1977 and 1985 and made contributions from their military pay to participate in this education benefit program. - Survivors' and Dependents' Educational Assistance (DEA, Chapter 35): DEA provides education and training opportunities to eligible dependents and survivors of veterans who have died or are permanently and totally disabled as the result of a service-related condition. - Vocational Rehabilitation and Employment (VR&E, Chapter 31): VR&E program assists veterans with service-connected disabilities to prepare for, find, and maintain suitable careers.", "- The Yellow Ribbon Program: This program allows institutions of higher learning in the United States to voluntarily enter into an agreement with VA to fund tuition expenses that exceed the highest public in-state undergraduate tuition rate. The institution can contribute up to 50% of those expenses, and VA will match the same amount. - Tutorial Assistance: Veterans or service members who are receiving VA educational benefits and need help with coursework can get funding for tutoring. - Eligibility requirements and benefit details can change - check the Remember that there may be other, more specific benefits or programs available depending on the veteran's service history, disability status, and other factors. It would be most beneficial to contact the VA directly to inquire about all available benefit options by calling 1-888-442-4551. | MD Law states if you are a Veteran, you can receive the in-state tuition rate with an honorable DD-214 (Page\\Copy 4) and a Maryland address on file in our UMD system. Full-time Active-Duty service members of the Armed Forces stationed in MD can also get the in-state rate. For more information refer to [Military and USM Employees](/node/174/). - Dependents can potentially receive in-state tuition rate if they meet the requirements under the Veterans Access Choice and Accountability Act (VACA). They can also receive the in-state tuition rate if they are dependent upon someone whos full-time Active Duty of the Armed Forces stationed in MD. For questions regarding your specific case, you will need to contact Residency Reclassification at [resclass@umd.edu](mailto:resclass@umd.edu)or 301-314-9596. - The costs covered would depend on which VA education benefit you are using. You will find detailed information on VA Education benefit coverage on the [VA website](https://www.va.gov/education). - Students using the Ch 31 and 33 benefits have specific amounts submitted to the VA, which results in the VA issuing payment directly to the university based on the students eligibility level. The VA does not pay the funds directly to the school for students using Ch. 30, 35, 1606, or 1607 benefits; instead, the VA sends a monthly amount to the student. - The Post 9/11 GI Bill covers tuition and fees, a monthly housing allowance, and a stipend for books and supplies for eligible veterans and/or their dependents pursuing a college degree or vocational training. For students covered at the 100% rate for the Post 9/11 GI Bill, the VA will cover the full amount of (in-state only) tuition and mandatory fees, including the orientation fee and fees attached to certain registered classes, for example, lab fees. Charges that are not required for being a registered student, such as parking permits and parent orientation fees will not be paid for by the VA. Room and Board charges are also not certified to the VA. The monthly housing allowance stipend (MHA) is sent directly, via direct deposit, to whatever bank account has been set up with the VA. Students may use that stipend to pay the Room and Board charges if living on-campus. If students will be living in a residence hall, it is suggested that they set up the [Terp Payment Plan](https://billpay.umd.edu/TPP) through the Student Financial Services and Cashiering, or pay the fees upfront and be reimbursed via the MHA monthly stipend. In addition, if you paid the enrollment deposit, you will get those funds back as part of the tuition and fees payment issued to the university by the VA.", "Tuition Assistance (TA) is a program that provides [active duty service members](/node/221) with funds to pay for tuition costs. The GI Bill is a separate program that provides education benefits to veterans. If a service member uses TA to pay for tuition, they may still be eligible to use their GI Bill benefits for other education-related expenses, e.g. books and housing costs. To access your GI Bill housing allowance while attending UMD, you need to submit a request for certification of enrollment to our school's Veterans Certification Services office. Once the certification is received and processed, the VA will send your housing allowance directly to you. It is important to note that the amount of your housing allowance will depend on the location of the college/university you attend and the number of credit hours you are taking. If you are unsure about the exact amount you are eligible for, the VA can assist you with that information. Students using benefits may also be required to confirm their enrollment directly with the VA to ensure timely release of their monthly allowance. The [University of Maryland participates in the Yellow Ribbon Program](https://financialaid.umd.edu/resources-policies-veterans/yellow-ribbon-program), which provides additional funding to cover tuition and fees not already covered by the GI Bill. Eligible veterans may receive additional financial support through this program. Yes, you may be eligible for additional financial aid, such as grants, scholarships, or student loans, in addition to your Veteran Education Benefits. It's recommended to complete the Free Application for Federal Student Aid (FAFSA) to determine your eligibility for other forms of financial assistance. The GI Bill benefits you receive are considered a resource when determining your eligibility for need-based financial aid. However, the GI Bill does not count as income, and it does not affect your eligibility for non-need-based aid, such as merit-based scholarships. The GI Bill provides benefits for education and training programs that lead to a degree or certificate from an accredited institution. Non-degree certificate programs at the University of Maryland may be eligible for GI Bill benefits if they are approved by the VA and meet certain criteria. To access your GI Bill housing allowance while attending UMD, you need to [submit a request for certification of enrollment to our school's Veterans Certification Services office](/node/167). Once the certification is received and processed, the VA will send your housing allowance directly to you. It is important to note that the amount of your housing allowance will depend on the location of the college/university you attend and the number of credit hours you are taking. If you are unsure about the exact amount you are eligible for, the VA can assist you with that information. Students using benefits may also be required to confirm their enrollment directly with the VA to ensure timely release of their monthly allowance. If you have received VA education benefits and have an overpayment or debt, it is important to address it promptly to avoid potential consequences. An overpayment occurs when the VA has paid more in education benefits than you were eligible to receive. A debt, on the other hand, refers to an amount owed to the VA for an overpayment or other reasons. If you have an overpayment or debt with VA education benefits, the VA will notify you of the amount owed and provide information on how to repay it. You will have the option to pay the entire amount upfront or establish a payment plan based on your financial situation. The VA will work with you to determine a payment schedule that is affordable and reasonable. There are a number of [resources](/node/117) available to help you with your Veteran Education Benefits. These resources include:", "The VA's website: The [VA website](https://www.va.gov/education/)has a wealth of information about Veteran Education Benefits, including eligibility requirements, application instructions, and a list of approved schools. - The VA's toll-free number: The VA has a toll-free number that you can call for help with Veteran Education Benefits. The number is 1-800-827-1000. - The VA's regional offices: The VA has regional offices located throughout the country. You can contact your local regional office for help with Veteran Education Benefits. - The VA will pay your housing allowance at the end of each month based on your certified enrollment. You should receive payments by the end of the following month. The amount is based on the Basic Allowance for Housing (MHA) rate for an E-5 with dependents in the zip code of the school you are attending. You can use the [Defense Department (DOD) lookup tool](https://www.travel.dod.mil/Allowances/Basic-Allowance-for-Housing/MHA-Rate-Lookup/) to find out how much money you may be eligible to receive for housing. Youll need the zip code for the University of Maryland (20742) to look up this information. Undergraduate students need to enroll in at least 12 credits per semester to be considered full-time and to be eligible for full Monthly Housing Allowance (MHA) from VA education benefits. While the university's policy stipulates a course load of 14 to 16 credits per semester for degree completion within four years, the VA generally considers 12 credits per semester to be full-time for undergraduate students. Graduate students must be officially registered for a combination of courses equivalent to at least 48 units per semester to be considered full-time. This translates to a range of 9-12 graduate credits per semester, depending on the specific courses taken. Meeting these requirements is necessary for graduate students to be eligible for full MHA from VA education benefits. While the University of Maryland cannot tell the students or parents what choice to make financially, there are some resources that can help guide them in making a decision. Here is some guidance that might be helpful to newly eligible Chapter 35 students who may also be eligible for Chapter 33 dependent benefits, as well as the Conroy Award scholarship granted by the state of Maryland: Start by gathering all of the information you can about each benefit. This includes the eligibility requirements, the amount of money that is available, and the restrictions that apply. - Consider the individual needs and goals of the student. What are they interested in studying? What is their financial situation? What are their career goals? - Consider the length and cost of the program. Chapter 33 dependent benefits generally provide a higher monthly stipend and can last longer, so they may be best for longer or more expensive programs. - Chapter 35 benefits have a 10-year expiration date, so parents should weigh using these sooner for a child currently in school vs. saving them for a child who may attend later. - Scholarship awards such as The Conroy scholarship funds may be limited and awarded on a first-come, first-served basis. Students should apply early to secure these funds if eligible. The University of Maryland Office of Student Financial Aid can provide information on eligibility requirements, award amounts, and application procedures for each option to help students and parents compare the options. - Parents should sit down with each child to discuss their goals, the costs involved, and come to an agreement on the best combination of benefits and funding for that individual student. - Don't be afraid to ask for help. There are a number of resources available to help you make this decision, including the VA, the school's veteran services office, and financial aid counselors. -", "Ultimately, the decision of which benefit or combination of benefits and scholarship to use is up to the parents. However, by gathering all of the information, considering their child's individual needs and goals, and working with their child's school, they can make an informed decision that is best for their family. For Veterans using Post 9/11 benefits, their benefits will extend to cover the entire semester even if they run out in the middle of the semester, but only if you have not previously exhausted your benefit. - For dependents, the VA will pay a prorated amount for the tuition and fees and MHA based on the amount of entitlement you have remaining (effective as of the exhaustion date). - Classes that are successfully completed may not be certified again for VA purposes if they are repeated. However, if a student fails a class, or if a program requires a higher grade than the one achieved in a particular class for successful completion, that class may be repeated and certified to VA again. As the VA will only pay towards courses that are required for a degree program, it is important to understand your programs requirements. Meet with your advisor regularly. You are also able to check your Degree Audit at any time via [Testudo](http://testudo.umd.edu). The audit may not be available for some graduate programs, but you can always confirm with your program department. For students participating in Study Abroad through University of Maryland sponsored Study Abroad programs with University of Maryland courses and instructors, The VA will pay the normal University of Maryland tuition and fee charges and the courses still need to be applicable to your degree program. - The VA will not pay for any of the costs associated with Studying Abroad, such as travel costs or lodging/hotel charges. Monthly Housing Allowance stipends would be based on the zip code of your home institution sponsoring the Study Abroad program. The only exception would be for students enrolled in a program that requires study abroad for all students enrolled in that degree program. - Students participating in a Study Abroad program directly through an overseas institution would need to be certified by that institution directly, and will need to have permission in advance from their University of Maryland academic department in order to transfer credits over from the overseas institution. - Certification Process Questions Paperwork can be submitted immediately after you are registered for classes for the upcoming term. We highly recommend [submitting the paperwork to the Veterans Certification Services](/node/167) office on the same day you register for classes regardless of whether or not your registration is 100% completed at that time. We will track any changes in enrollment after we receive a certification request from a student. The Certification Request form needs to be submitted every semester a student wishes to receive benefits. To certify your enrollment, you need to [provide a signed Enrollment Certification Request form to the UMD Veterans Certification Services](/node/167) office after you have registered for an upcoming semester. Students must request certification for each semester in which they plan to use the benefit, as a claim cannot be submitted to the VA without the student first requesting it. UMD will then verify your enrollment with the VA, ensuring that your benefits are appropriately disbursed based on eligibility. The processing time for veteran education benefits can vary, but the VA states that claims are typically processed within 10-15 business days of receiving a certification from a student's college/university.", "The University of Maryland School Certifying Officials (SCOs) will process all certification requests in order of receipt. Student enrollment information is confirmed with the VA, which will then activate the benefit for the term dates certified. The VA cannot begin to disburse funds for any term until approximately 15 days before the start date of the term. Once certified, it can take the VA up to two weeks to process the enrollment and activate the benefit for the term. Students will receive automated emails from the VAs certification system anytime their enrollment information is certified by the University of Maryland. Students using benefits that have been transferred to their name must sign and submit the request form themselves. Parents may certainly assist the student with any questions they may have about the transferred benefit. If youre a Ch. 30, 35, 1606, or 1607 student, then the VA does not pay the funds directly to the school, so you will want to make sure your student bill is settled before the due date (out of pocket, [Terp Payment Plan](https://billpay.umd.edu/TPP),[Financial Aid Process](https://financialaid.umd.edu/financial-aid-process)). - If youre a Ch. 33 student, then you do not need to make a personal payment for the tuition and mandatory fees (or the undergraduate mandatory health insurance) if you are 100% eligible for benefits and charged at the in-state tuition rate. The VA will cover the full amount of in-state tuition and mandatory fees for those covered at the 100% rate. However, if youre not 100% eligible or charged at the out-of-state rate, then you will want to cover the remaining difference that the VA will not pay by the given due date, or by setting up a [Terp Payment Plan](https://billpay.umd.edu/TPP). - If youre a Ch. 31 student, your bill will be invoiced to your VR&E Counselor (in-state or out-of-state tuition). - There is no appointment necessary. The office is open Monday through Friday, 8 a.m. to 5 p.m. in room 1113 of the Clarence M. Mitchell, Jr. Building. You may also contact our office by phone at 301-314-8239 or 301-314-8255 or by email at [vabenefits@umd.edu](mailto:vabenefits@umd.edu). UMD Policies & Services Questions We offer a [range of support services](/node/117) tailored to the needs of veteran students, including academic advising, career counseling, mental health support, and networking opportunities within the veteran community. Undergraduate students can receive elective credits for the completion of basic training. You can request your military transcripts through the Joint Services Transcript (JST) system. This transcript includes your military training and experiences. Submit your transcript to the Office of Undergraduate Admissions or to the Office of the University Registrar to receive the undergraduate elective credit. For more on this policy, please refer to [Prior Learning Credit - Basic Military Training](/node/109/). While there is no specific deadline to submit your certification request, there are registration dates and billing deadlines for the University of Maryland that youll want to keep in mind. Active duty and veteran students receive priority registration, so you will want to make sure to take advantage of that. By requesting certification immediately after registering for an upcoming term, students using benefits place themselves in the best position to avoid any issues.", "If your VA education benefits do not cover all of your educational costs, you may be eligible for [additional financial aid such as federal student loans, grants, scholarships, or work-study programs](https://financialaid.umd.edu/financial-aid-process). You can also explore the [Terp Payment Plan](https://billpay.umd.edu/TPP) offered by Student Financial Services and Cashiering. As long as you are classified at the 100% coverage rate by the VA, The GI Bill will cover the full amount of in-state tuition and mandatory fees. Students are responsible for making timely payment for any balances that will not be covered by a pending VA education benefit payment directly to the University of Maryland. The VA will only issue payment directly to the university for tuition and mandatory/required fee charges (campus mandatory fee, course/lab fees, university health insurance). This means that any other charges (Room, Board, Parking, etc.) must be paid by the student. Students who are covered by pending VA education benefit payments who have requested certification for an upcoming semester are protected from late penalties and/or financial blocks on balances being covered by the VA while the university awaits payment. GI Bill is a registered trademark of the U.S. Department of Veterans Affairs (VA). More information about education benefits offered by VA is available at the [official U.S. government website](http://www.benefits.va.gov/gibill)."]}