{"https://registrar.umd.edu/faculty-staff/systems-access-training/advise-web-aow": ["Need more help? | Advise on the Web (AoW) Advise on the Web allows academic advisors to view academic information for students. The following information is available in AoW: Individual student information (real-time): View information for individual students (unofficial transcripts, course, and academic information). - Information for students in batch: Query the AoW database (includes canned reports/queries); send mass email; print transcripts in batch. - Go to the [UM Account Request Form.](https://edoc.umd.edu/kew/EDocLite?edlName=umd.edoc.reg.AccountAccessRequest&userAction=initiate)Enter your UMD credentials if prompted. - Confirm that the User Information section at the top is correct. - Complete the FERPA tutorial if you have not done so already. - Under the Access Request section, check the box next to Advise on the Web. Make sure to select the type of access needed; Failure to select an option will delay your access request: Read Only: Ability to view individual student information only - Search: Provides search capability - Batch: Ability to print batch transcripts - Mass Mailing: Ability to send mass emails - - Complete and submit the form. - An Advise on the Web account is required to access AoW. If you need an account, please refer to the \"Request Access\" section.| Go to ARES at [ares.umd.edu](https://ares.umd.edu/). - Select Advisor Services from the listing on the left side of the page. - Select ADVISE on the Web from the Advisor Links box on the left side of the page. - See the [AoW SEARCH Manual ](/sites/default/files/2023-06/aow-search-manual.pdf) for information on how to use AoW's query tool to search for groups of students. AoW is an advising tool that is used for specific, unit-related advising purposes. As such, the Office of the University Registrar does not provide formalized training on AoW; rather, advisors are typically trained by someone from their advising unit. However, if you would like to request general training from the Office of the University Registrar, please contact [advisefeedback@umd.edu](mailto:advisefeedback@umd.edu)."]}