{"https://registrar.umd.edu/veterans-benefits/using-va-benefits": ["Veteran Certifications Services | Using VA Benefits On this page: New Students Interested in attending the University of Maryland? Make sure you apply for admission by the deadline. To learn more visit: For all newly admitted students, on behalf of Veteran Certifications Services, the University of Marylands School Certifying Officials, we welcome you to the University of Maryland! Please follow these steps to understand how to use your VA Education Benefit to support your educational goals at UMD. Complete the [U.S. Department of Veterans Affairs (VA) online application](https://www.va.gov/education/how-to-apply/)for education benefits.If you've never used VA benefits, you must first apply using the link above. - Check the [VA](https://benefits.va.gov/gibill/)for average processing times - - Complete the [FAFSA](https://studentaid.gov/h/apply-for-aid/fafsa). The University of Maryland strongly encourages all eligible students, regardless of financial circumstance, to complete the Free Application for Federal Student Aid (FAFSA) which can be done before being admitted or enrolling at the university. VA benefits may be used in conjunction with other types of aid, contact the[Office of Student Financial Aid](https://financialaid.umd.edu/)for assistance. - Attend an orientation program. Undergraduate students should register for a [New Student Orientation](https://orientation.umd.edu/), graduate students should contact their program for information about orientation. Students will register for classes during their orientation. - Review your residency status. This information is available on your admission letter or the Testudo Registration (Drop/Add) application. You may be eligible for in-state residency at the University of Maryland. Please review [Military and USM Employees](/node/174/)for more information. - Request to be certified to the VA. As soon as you have registered for classes, submit a signed [UMD VA Enrollment Certification Request](/sites/default/files/2023-03/va-enrollment-certification-request.pdf)to Veteran Certification Services. Once you receive your Certificate of Eligibility (COE), submit the document to Veteran Certification Services. These documents do not have to be submitted at the same time.Please submit these documents via email to [vabenefits@umd.edu](mailto:vabenefits@umd.edu)or upload through[Secure File Upload](https://secureshare.umd.edu/filedrop/vabenefits@umd.edu). - - Please submit these documents via email to - Wait for your benefits to pay out. You will receive a confirmation email from VA when you have been certified by the university. To ensure timely processing, submit your UMD VA Enrollment Certification Request form to our office as soon as you register for a term. For Post 9/11 GI Bill Students, the VA requires a two-step certification process. The first certification includes information to activate any monthly funding disbursements from the VA (e.g., housing and book stipend). The second certification includes tuition and mandatory fee totals which cannot be finalized until the end of the Schedule Adjustment Period. VA tuition will be released to the university approximately two weeks after the student is certified. - For students using Chapter 31 or Chapter 33 Post 9/11 GI Bill benefits who have provided a written request to be certified for a term, late fees and financial penalties will not be assessed for the portion of the account that is covered by VA. See [GI Bill Delayed Payment Policy](https://academiccatalog.umd.edu/undergraduate/registration-academic-requirements-regulations/registration/#veterans-benefits)for more information. - - Get engaged on campus. To learn more about activities and opportunities on campus, including scholarships and other financial aid options for veterans visit [On-Campus Resources](/node/117/). - Current Students Welcome back, students! Please follow these steps to use your VA Education Benefits to support your educational goals at UMD.", "If you are a current student looking to utilize your benefits as a guest student at another institution, please see | Prepare for registration. Follow these [steps to get ready to register](/node/212/). Remember as a veteran student you get[Priority Registration](https://academiccatalog.umd.edu/undergraduate/registration-academic-requirements-regulations/registration/#veterans-benefits)for fall and spring semesters. Make sure you take advantage of this benefit to stay on track for your graduation goals! - Register for classes as soon as you are eligible to do so. - Request to be certified to the VA. As soon as you have registered for classes, submit a signed [UMD VA Enrollment Certification Request](/sites/default/files/2023-03/va-enrollment-certification-request.pdf)to Veteran Certification Services. Once you receive your Certificate of Eligibility (COE), submit the document to Veteran Certification Services. These documents do not have to be submitted at the same time.Please submit these documents via email to [vabenefits@umd.edu](mailto:vabenefits@umd.edu)or upload through[Secure File Upload](https://secureshare.umd.edu/filedrop/vabenefits@umd.edu). - - Please submit these documents via email to - Wait for your benefits to pay out. You will receive a confirmation email from VA when you have been certified by the university. To ensure timely processing, submit your UMD VA Enrollment Certification Request form to our office as soon as you register for a term.For Post 9/11 GI Bill Students, the VA requires a two-step certification process. The first certification includes information to activate any monthly funding disbursements from the VA (e.g., housing and book stipend). The second certification includes tuition and mandatory fee totals which cannot be finalized until the end of the Schedule Adjustment Period.VA tuition will be released to the university approximately two weeks after the student is certified. - - For students using Chapter 31 or Chapter 33 Post 9/11 GI Bill benefits who have provided a written request to be certified for a term, late fees and financial penalties will not be assessed for the portion of the account that is covered by VA. See [GI Bill Delayed Payment Policy](https://academiccatalog.umd.edu/undergraduate/registration-academic-requirements-regulations/registration/#veterans-benefits)for more information. - - For Post 9/11 GI Bill Students, the VA requires a two-step certification process. The first certification includes information to activate any monthly funding disbursements from the VA (e.g., housing and book stipend). The second certification includes tuition and mandatory fee totals which cannot be finalized until the end of the Schedule Adjustment Period. - Get engaged on campus! To learn more about activities and opportunities on campus, including scholarships and other financial aid options for veterans visit [On-Campus Resources](/node/117/). - UMD Students Visiting Another Institution If you are a UMD student wishing to take a course at another institution and have that course and its credits transfer back to the University of Maryland, while utilizing VA Education Benefits as a guest student, follow these steps: Request [Permission to Enroll (PTE)](/node/110)from the College of your major. - Submit a copy of your approved PTE form and a request for a parent letter to Veteran Certification Services at [vabenefits@umd.edu](mailto:vabenefits@umd.edu)or upload through[Secure File Upload](https://secureshare.umd.edu/filedrop/vabenefits@umd.edu). Please specify whether you would like the parent letter to be sent to you or to the institution directly. If the letter should be sent to the institution, please include contact information for the School Certifying Official. - Guest Students If you are enrolled in a degree-seeking program at another institution, and wish to use VA Education Benefits while temporarily enrolled at UMD, follow these steps:", "Obtain a parent letter from your primary (home) institutions School Certifying Official. The letter must contain: students name, - degree program at the home institution, - exact course(s) being taken at UMD, and - statement from the home institution that the credits being taken at UMD will apply to your degree at your home institution. - - [Register for courses](/node/131/).Complete the [UMD VA Enrollment Certification Request](/sites/default/files/2023-03/va-enrollment-certification-request.pdf). - Submit the parent letter, UMD VA Enrollment Certification Request and your Certificate of Eligibility (COE) to our office. Please submit these documents via email to [vabenefits@umd.edu](mailto:vabenefits@umd.edu)or upload through[Secure File Upload](https://secureshare.umd.edu/filedrop/vabenefits@umd.edu). - - Please submit these documents via email to - [Request a copy of your transcript](/node/99/)to be sent to your home institution at the end of the semester.Once the parent letter and the UMD VA Enrollment Certification Request is received by Veteran Certification Services, a UMD School Certifying Official will certify the guest students enrollment to the VA. GI Bill is a registered trademark of the U.S. Department of Veterans Affairs (VA). More information about education benefits offered by VA is available at the official U.S. government Web site at [benefits.va.gov/gibill](http://benefits.va.gov/gibill)."]}