{"https://registrar.umd.edu/veterans-benefits/active-military-duty": ["Veteran Certifications Services | Active Military Duty Paying for Your Education Active Military Duty may use VA Education Benefits and/or Tuition Assistance to pay for tuition and fees. For information on the VA enrollment certification process at UMD, see [Using VA Benefits](/node/167). - To use Tuition Assistance, have the course/s approved through the appropriate military tuition assistance program (e.g., GoArmyEd for Army service members). Once the necessary military command signatures and dollar amount for Tuition Assistance have been obtained, take the TA Approval Letter/Statement directly to [Student Financial Services and Cashiering - Third Party Billing](https://billpay.umd.edu/tuition-billing/third-partysponsored-billing). - Residency Classification For information regarding [residency reclassification](/node/97) and [military exemptions](/node/174), please go to Residency Reclassification Services. Military Call-up It is the intent of the University of Maryland, College Park, to facilitate the withdrawal or change in registration and the reenrollment of students who are called to active duty in the U.S. armed forces. The university policy governing military call-ups ([ policy V-7.00](https://www.usmd.edu/regents/bylaws/SectionV/V700.html)) allows for a variety of unique solutions not covered by standard academic policies (such as receiving Incompletes in some classes while retro-withdrawing from others leading to a partial refund; or receiving a total refund of tuition and fees) which minimize the effects of time and financial investment put into a semester in-progress once called to active military service. Steps for Students Called to Active Military Service Students (or their representative) will need a copy of the military orders. - Students should meet with their college's advising office. Based on the specific course(s) in which the student is enrolled and the point in the semester when the call-up occurs, students may be advised to discuss Incomplete Contracts with individual instructors, or to process a withdrawal with the Office of the University Registrar, Room 1113 C. Mitchell Building. - The Office of the University Registrar will make determinations as to appropriate [withdrawal procedures and refunds](/node/140)and explain the process for reenrollment after completing active duty. They will also assist with quick referrals related to financial aid issues, cancellation of any campus housing contracts, and allowable refunds. - Withdrawal for active military service will have no effect on any subsequent request to withdraw from the university. Students may reenroll upon completion of their tour of duty."]}