{"https://registrar.umd.edu/transfer-credit/transfer-credit-faqs": ["Transfer Credit Services | Transfer Credit FAQs On this page: Transfer Course Basics Generally, college-level courses completed at regionally-accredited institutions will transfer, provided the course is similar in level, scope and content to courses offered at UMD and a grade of C- or higher is earned. Grades of D- or higher are accepted for courses completed at Maryland public institutions. Regional accrediting bodies include the Middle States Association of Colleges and Schools; New England Association of Schools and Colleges; North Central Association of Colleges and Schools; Northwest Association of Schools and Colleges; Southern Association of Colleges and Schools; and Western Association of Schools and Colleges. To transfer coursework to the UMD record, an official transcript must be sent directly from the previous institution. Electronic transcripts can be sent to [registrar-help@umd.edu](mailto:registrar-help@umd.edu). Printed transcripts may be mailed to: University of Maryland Office of the University Registrar 1113 Clarence M. Mitchell, Jr. Building College Park, MD 20742 Current UMD students who are considering taking a course at another institution must obtain permission from their academic advising college prior to enrolling in the class. Failure to obtain permission may result in the course not being accepted by UMD or applied to degree requirements. Visit [Permission to Enroll](/node/110) for additional information regarding this process. UMD does not restrict the number of transfer courses that are accepted. However, the number of credits that are applicable toward degree requirements is limited based on the source of the transfer credits. For students matriculating to UMD in Fall 2022 (or after): A maximum of 70 credits from 2-year institutions can be applied to degree requirements at UMD. - A maximum of 90 credits can be applied to degree requirements from a combination of 2-year institutions, 4-year institutions and prior learning credits. - Students are required to complete at least their final 30 credits at UMD to earn a degree. UMD awards the standard .67 semester credits per quarter credit hour of study. A 3 credit course from a quarter school will be awarded 2 credits at UMD. UMD will convert units to semester credits based on the number of units required to earn a degree at the transfer institution. Grades from transfer courses are considered in making decisions for admission to the university, entry into a Limited Enrollment Program (LEP), and for satisfying degree requirements. However, grades from transfer courses are not used in the calculation of the cumulative GPA at UMD. The transfer courses UMD accepted and applied toward degree requirements will appear on the UMD official transcript, but the grades received in these courses will not. Grades for all transfer courses will appear on the unofficial UMD transcript via [Testudo](https://app.testudo.umd.edu/main/uotrans). For courses completed at out-of-state or private colleges/universities, UMD will award credit when it can be determined that the Pass grade earned represents at least a C- grade. For courses completed at Maryland public institutions, UMD will award credit if the Pass grade represents a D- or higher. Pass grades typically do not satisfy major requirements.| The number of semester credits earned at the transfer institution are the number of credits received at UMD (e.g. a student who takes a 5 semester credit calculus course that equates to MATH140 at UMD, will receive 5 semester credits for that course). Units or Quarter credits earned at the transfer institution will be converted upon transfer (e.g. a 4 quarter credit course at any institution will be worth 2.67 semester hours at UMD after the .67 conversion is applied). L1 means the course is a lower-level general elective. At UMD, lower-level refers to freshman and sophomore courses (numbered 100-299).", "L2 means the course is an upper-level general elective. At UMD, upper-level refers to junior and senior courses (numbered 300-499). Students should work with their major and/or advising college to determine how these courses may apply toward satisfying degree requirements at UMD. Generally, courses are transferred to UMD at the equivalent level in which the course was taken at the transfer institution. A lower-level course can equate to an upper-level course at UMD, but the course is still considered lower-level and has a footnote of 24 (freshman/sophomore credit). Not all institutions use the same course numbering system as UMD to identify lower-level and upper-level courses. Additional research may be needed to make an appropriate determination of course level.| Refer to [International Transfer Credit](/node/108) for detailed information regarding the process for evaluating international transfer credits. UMD awards six credits of lower level general elective credits to active duty and former service members in the United States Armed Forces. The credits are awarded for the completion of basic physical fitness and military science as part of basic military training for the United States Armed Forces. UMD only awards transfer credit for courses that fall within the level, scope and content offered at UMD. Since many courses on military transcripts are occupational in nature they are not accepted by UMD. The only credits that will be awarded based on the military transcript are for basic military training as outlined on [Prior Learning Credit](/node/109). UMD does not award transfer credit based on ACE or Dantes recommendations. UMD does not award transfer credit for non-traditional or experiential learning such as internships, externships, practicum and co-op work, nor does UMD transfer credits awarded at other institutions for such work. Students who have been admitted to UMD should contact an academic advisor in their declared major for assistance. Prospective students should connect with a [pre-transfer advisor](https://pretransferadvising.umd.edu/). Other helpful resources are the advising college's and [Four Year Plans](http://www.4yearplans.umd.edu/) for [Academic Majors](https://admissions.umd.edu/programs). Transfer Credit Services is not able to provide academic advising services.| All current UMD students are required to obtain permission from their advising college to take courses at another institution. Failure to obtain permission prior to enrolling in courses at another college or university may result in the course not being accepted for transfer by UMD and/or applied to degree requirements. For additional information, visit [Permission to Enroll](/node/110). Transfer Course Evaluation Questions The transfer credit evaluation process can be a time consuming process, and records can continue to be updated throughout a student's first semester at UMD. Advisors will assist students with determining how transfer courses are applied to degree requirements. They may recommend a student request some of their courses be evaluated for transfer. To request a course be evaluated for transfer, follow the instructions listed at [Transfer Credit Evaluation Process](/node/108). Students should continue to check their | Contact Records and Registration Services at [registrar-help@umd.edu](mailto:registrar-help@umd.edu) to have them investigate the matter. You can click on the code for a key to be displayed that explains footnotes and general education codes. If you still have questions about the meaning of the note, please contact your advisor. While every effort will be made to provide you with the most complete evaluation possible by the time you arrive for orientation and registration, it is common for there to be some courses that are still pending evaluation or in need of a syllabus. Your advisor will still be able to help you register for the proper courses.", "Transfer courses may not be awarded credit at UMD for several reasons. These courses are typically pre-collegiate, remedial, vocational, graduate, professional (e.g. law, medicine, dentistry, nursing), technical or religious in nature and do not fall within the level, scope, content and expected learning outcomes of courses offered at UMD. Other types of courses that typically are not awarded transfer credits are internships, independent study and research. Students should consult the [Transfer Course Evaluation Process](/node/108) and [Prior Learning Credit](/node/109) for more information on the requirements for their specific type of transfer credit. Credit can only be posted to the UMD record from official transcripts sent directly from the institution at which the credit was completed or official score reports sent directly from the testing board, even if they are posted on a transcript from another institution.| All appeals regarding transfer course evaluations should be directed in writing to the [academic department](https://docs.google.com/document/d/1f2UvOX-gpuye0kB0nW14xPU99BOZsbBuYODxu-U-bVc/edit) that oversees the subject matter of the course. In many cases a syllabus has already been reviewed to determine the course evaluation. It may be necessary to meet with the evaluator and/or provide additional documentation such as assignments, papers and examinations for the evaluator to reconsider their initial evaluation of the course. Once a decision is reached, the evaluator must [email Transfer Credit Services](mailto:transfercredit@umd.edu) with the details so the student's record and the database can be updated accordingly. The following will assist with streamlining the appeal process: Put your name and UID on the materials you are sending in for review. - Make sure the name of the institution and the course ID at that institution are clearly listed on the materials you are providing. - Be sure to retain a copy of everything you submit for evaluation before you turn it in. - Who to Contact for Additional Assistance For additional questions, consult an advisor in your advising college. To get your most recent transfer coursework on your record, you must submit an official transcript to: University of Maryland Office of the Registrar 1113 Clarence M. Mitchell, Jr. Building College Park, MD 20742"]}