{"https://registrar.umd.edu/transfer-credit/prior-learning-credit": ["Transfer Credit Services | Prior Learning Credit The University of Maryland provides students with several opportunities to receive undergraduate credit for knowledge and achievements gained through prior learning (PLC), which includes: Advanced Placement (AP), International Baccalaureate (IB), Advanced Level/Advanced Subsidiary Level (A-Level/AS-Level), College-Level Examination Program (CLEP), and Basic Military Training (BMT). PLC awarded by UMD is recorded at the top of the students transcript and will be included in the total number of credits earned. Students may earn no more than 60 credits from PLC. No more than 30 of these credits can be from the College-Level Examination Program (CLEP). - Students should inform their advisor that they have received or anticipate receiving credit for AP, IB, or A-Level/AS-Level exams. This information may impact placement into courses required for their degree. - To see how credit is awarded by UMD for a specific exam, students should review the UMD equivalency chart that corresponds with the year their exam was taken. See sections below for chart listings. - Students will not receive credit for both PLC and completing an equivalent course. No credit will be awarded for AP, IB, or A-Level/AS-Level exams that are repeated or taken after a student has matriculated to UMD.| UMD encourages applicants to seek AP credit where relevant. Credit may be awarded for exams offered by the College Board and is based on the year the exam was taken. All departments reserve the right to reevaluate the content of exams and to change the minimum required score, course equivalencies, and assignment of credits. Students must have their scores sent directly to UMD from the College Board; the institution code for UMD is 5814. [Order AP Scores](https://apscore.collegeboard.org/scores)To see how credits are awarded by UMD for AP exams, view the chart below that corresponds with the year the exam was taken: View [AP Chart 2023](/sites/default/files/2023-06/ap-gen-ed-may-2023.pdf)to see how credit is awarded for exams taken in May 2023 - View [AP Chart 2021-2022](/sites/default/files/2023-03/ap-gen-ed.pdf)to see how credit is awarded for exams taken in May 2021-May 2022 - View [AP Chart 2018-2020](/sites/default/files/2023-03/ap-gen-ed-2018-2020.pdf)to see how credit is awarded for exams taken between May 2018 and May 2020 - For information about exams taken prior to 2018, [email Transfer Credit Services](mailto:transfercredit@umd.edu). - UMD awards credit to students for a broad array of IB exams. Credit is not awarded for all exams offered by IB and is based on departmental approval. All departments reserve the right to reevaluate the content of exams, and to change the minimum required score, course equivalencies, and the assignment of credit. Students should have their scores sent directly to UMD from the International Baccalaureate Results Service. UMDs code is 001417. [Order IB Scores](http://www.ibo.org/en/programmes/diploma-programme/assessment-and-exams/requesting-transcripts/)To see how credits are awarded by UMD for IB exams, view the chart below that corresponds with the date the exam was taken: View this [IB Chart 2023](/sites/default/files/2024-01/ib-gen-ed-may-2023.pdf)for exams taken in November 2022 and May 2023 - View this [IB Chart](/sites/default/files/2023-03/ib-gen-ed.pdf)for exams taken through May 2022 - UMD awards credit for A-Level/AS-Level exams taken through Cambridge International Exams (CIE) or other approved boards. Credit is not awarded for all exams offered and is based on departmental approval. All departments reserve the right to reevaluate the content of exams and to change the minimum required score, course equivalencies, and assignment of credit. Students are not permitted to earn credit for both A-Level and AS-Level exams within the same subject areas.| Official scores must be sent by CIE or the approved exam board to UMD.", "To see how credits are awarded by UMD for A-Level/AS-Level exams, view the chart below that corresponds with the year the exam was taken: [A/AS-Level Chart (exams from Spring 2023 - Present)](/sites/default/files/2024-02/aas-level-chart-spring-2023.pdf)[A/AS-Level Chart (exams from Fall 2020 - Fall 2023)](/sites/default/files/2024-02/aas-level-chart-fall-2020-fall-2023-updated.pdf)[A/AS-Level Chart (exams from Fall 2012 - Summer 2020)](/sites/default/files/2024-02/aas-level-chart-fall-2012-summer-2020-updated.pdf)For information about exams taken prior to 2012, [email Transfer Credit Services](mailto:transfercredit@umd.edu). - CLEP recognizes college-level competence achieved outside of the college classroom. [CLEP exams](https://clep.collegeboard.org/) are administered by the College Board. The type of credit awarded for CLEP General and Subject Examinations is based on departmental approval, certain restrictions may apply. All departments reserve the right to reevaluate the content of exams, and to change the minimum required score, course equivalencies, and assignment of credit. Students currently enrolled at UMD must complete a [Permission to Enroll](https://registrar.umd.edu/transfer-credit/permission-enroll) form prior to signing up to take CLEP exams. Students who would like to have their CLEP scores reviewed for credit must request their official score reports to be sent to UMD. The Score Recipient Code is 5814. [Order CLEP Scores](https://clep.collegeboard.org/scores)To see how credits are awarded by UMD for CLEP exams, view the chart below that corresponds with the year the exam was taken: View [CLEP Chart 2023-2024](/sites/default/files/2024-02/clep-gen-ed-2023.pdf)to see how credit is awarded for exams taken in 2023-2024. - View [CLEP Chart](/sites/default/files/2023-03/clep-gen-ed.pdf)to see how credit is awarded for exams taken in 2022 and earlier. - Students who are currently on active duty or former service members in the United States Armed Forces are eligible to be awarded six credits of lower-level general elective credits. The credits are awarded for the completion of basic physical fitness and basic military science as part of basic military training for the United States Armed Forces. To qualify, students must have been enrolled as an undergraduate student in the Fall 2013 semester or beyond, along with one of the following: Currently serving as an active duty member in the United States Armed Forces - Currently serving as a member of a reserve or National Guard branch of the United States Armed Forces - Has been Honorably Discharged from service in the United States Armed Forces - Has been Honorably Discharged from a reserve or National Guard branch of the United States Armed Forces - Students interested in receiving the six credits of lower-level general elective credits for their service to the United States Armed Forces must provide appropriate documentation based on their current status: Active duty members of the United States Army, Coast Guard, Marine Corps or Navy, including reserve and National Guard need to provide an official copy of their [Joint Services Transcript (JST)](https://jst.doded.mil). - Active duty members of the United States Air Force, including reserve and National Guard need to provide an official copy of their [Community College of the Air Force transcript](https://www.airuniversity.af.edu/Barnes/CCAF/Display/Article/803247/community-college-of-the-air-force-transcripts/). - Separated members of the United States Armed Forces need to provide a copy of their [DD-214 Form](http://www.archives.gov/veterans/military-service-records)stating they were Honorably Discharged. - In some cases, additional documentation may be requested to verify a student's current status. The student will receive an email if additional information is needed once the documentation you provided has been reviewed.| Please send the appropriate required documentation to the following: Records and Registration Services University of Maryland 7999 Regents Drive College Park, MD 20742 Credits will be posted to qualified student records as follows: Title| Grade| Credit| Elective| Basic Military Science 1| P| 1| L1 (Lower-level general elective)|", "Basic Military Science 2| P| 1| L1 (Lower-level general elective)| Basic Physical Fitness 1| P| 2| L1 (Lower-level general elective)| Basic Physical Fitness 2| P| 2| L1 (Lower-level general elective)| Since many courses on military transcripts are occupational in nature, they are generally not accepted by UMD. UMD only awards transfer credit for courses that fall within the level, scope, content and expected learning outcomes of courses offered at UMD. Usually, the basic military training credits outlined above are the only credits that will be awarded based on military transcripts.| Please direct any questions you have regarding the Basic Military Training policy or receipt of the credits to [registrar-help@umd.edu](mailto:registrar-help@umd.edu). Credit-by-Exam at UMD is comparable to a comprehensive final examination in a course. Although the mathematics department receives the most applications for Credit-by-Exam, many departments will provide opportunities for certain courses. Initial inquiry on the availability of an examination for a specific course should be directed to the academic department offering that course. Eligibility for Credit-by-Exam In order to be considered for Credit-by-Exam, a student must meet the following eligibility criteria: A minimum of 12 (twelve) credit hours completed at the University of Maryland*; - A minimum grade point average of 2.0*; - Completion of all prerequisite courses or the approval of the department chairperson (or, in non-departmentalized units, the dean) and the Senior Vice President and Provost. - *Requirements 1 and 2 may be waived for students in their first semester at UMD by the department chairperson and the dean. Credit-by-Exam may not be taken for courses in which the student has remained registered at UMD, beyond the Schedule Adjustment Period - even with a transcript notation of W.Credit-by-exam will not be accepted for any part of the final 30 (thirty) semester hours without permission of the Senior Vice President and Provost. With such permission, 6 (six) of the final 30 (thirty) credit hours may be by credit-by-exam. | Taking a Credit-by-Exam If an examination for a course is available, the department will provide information regarding the time and location of the exam, the type of examination, and material which might be helpful in preparing for the examination. - After making arrangements with the department, students must [apply through the Division of Letters and Sciences](https://ltsc.umd.edu/forms), 1117 Hornbake Library, 301-314-8418. Applications for examinations shall be approved on an individual course basis. - Credit-by-Exam Grading A student may cancel application for credit-by-exam at any time prior to the completion of the examination with no entry on the permanent record. - The examination instructor shall make the grade available to the student prior to the formal submission of the grade. - A grade of C- or better must be obtained to establish credit-by-exam. - If a student elects not to have the grade posted, a grade of W will be recorded. No course may be attempted more than once using credit-by-exam. - Grades earned using credit-by-exam will be posted on the transcript as resident credit in the semester the examination was taken and used in computing semester and cumulative grade point averages. Such grades shall be accompanied by the notation By examination as applicable. - The instructor must certify on the report of examination that copies of the examination questions and the student's answers shall be retained in accordance with the University of Marylands Records and Retention and Disposal Schedule. -", "There are some instances of prior learning/competency-based education for which the University of Maryland generally does not award credit. These include, but are not limited to: American Council on Education (ACE), Defense Activity for Non-Traditional Education Support (DANTES), Program on Non-Collegiate Sponsored Instruction (PONSI), Sophia Learning, StraighterLine, Coursera, Outlier, departmental credit-by-exam from institutions other than Maryland public institutions of higher education, and life experiences. Students may contact the Office of the University Registrar to appeal the acceptance of prior learning experiences. For prior learning credit to be awarded during an appeal, the student must provide evidence that the prior learning experience falls within the level, scope, content and expected learning outcomes of courses offered at the University of Maryland. The determination of the Office of the University Registrar will be final. View the University of Maryland [ policy III-1.41(A)](https://policies.umd.edu/academic-affairs/university-of-maryland-policy-and-procedures-concerning-credit-for-prior-learning) and the University System of Maryland [ policy III-1.41](https://www.usmd.edu/regents/bylaws/SectionIII/III141.pdf) for additional information. Questions regarding PLC should be directed to [Transfer Credit Services](mailto:transfercredit@umd.edu)."]}