{"https://registrar.umd.edu/transfer-credit/transfer-course-database": ["Transfer Credit Services | Transfer Course Database All courses evaluated by UMD for transfer are searchable in the Transfer Course Database. - Courses that cannot be found in the database have not been evaluated for transfer. Review the [Transfer Course Evaluation Process](/node/108)to learn how to submit one or more courses for evaluation. - When reviewing courses for transfer in this system, pay close attention to the start and end term (if present) for each course evaluation. Evaluations with past end terms are no longer effective.| How to read the Transfer Course Database: From left to right, you see these columns: Course ID (Transfer From) column is the course ID from the transfer/sending institution. Be sure to search for a course at the sending institution based on their current course ID system. - Course Title (Transfer From) column is the course title from the transfer/sending institution. - Course ID (UMD Equiv) column is the equivalent course at UMD as approved by the appropriate academic department that oversees the subject matter content. Accepted - Transfer courses that are acceptable for transfer by UMD will list \"Accepted\" next to the course. - Not Accepted - Transfer courses that are not acceptable for transfer by UMD will list \"Not Accepted\" next to the course and zero credits will be awarded by UMD. - Pending Credit - Transfer courses that have not yet been evaluated for acceptability will list \"Pending Credit\" next to the course. - L1 or L2 - indicates if a course is accepted for transfer as a general elective. If the course is accepted for transfer, but does not have a direct equivalency and is not approved for Gen Ed or CORE, it will display as either L1 (lower-level elective) or L2 (upper-level elective). - - Gen Ed (UMD Equiv) column represents the UMD general education requirements beginning Fall 2012. If the transfer course fulfills a specific general education requirement, the Gen Ed column will contain a [designation code](/node/177/#gen-ed). Place your cursor over the Gen Ed designation to see what Gen Ed requirement(s) the transfer course fulfills. For more information on general education, visit the[Undergraduate Studies website](http://www.gened.umd.edu/). - Core (UMD Equiv) column represents the UMD general education requirements prior to the implementation of Gen Ed in Fall 2012. - Footnotes (UMD Equiv) column are important notations regarding how a transfer course will be accepted by UMD and could be applied to degree requirements. Place your cursor over the footnote designation to see what the footnote means. For additional information, see [footnotes](/node/177#footnotes). - Start & End Term (UMD Equiv) columns identify the time frame that a course evaluation is in effect. Not all courses have start and/or end terms. Courses may have multiple entries, with different start/end terms and equivalents, reflecting changes to the content of the course at the sending school, or changes in curriculum at UMD. If a course is taken prior to the start term, or after the end term, it will need to be re-evaluated following the [Transfer Course Evaluation Process](/node/108). -"]}