{"https://registrar.umd.edu/transfer-credit": ["Transfer Credit Services | Transfer Credit Transfer Credit Services (TCS) provides accurate and timely information about undergraduate transfer policies and procedures to transfer advisors and students. Additionally, TCS oversees and supports the undergraduate transfer evaluation process, which includes: determining the acceptability of courses, awarding credit by the University of Maryland, and maintaining the database of transfer course evaluations. Database All courses evaluated by UMD for transfer are searchable in the Transfer Course Database. [Learn more](/transfer-credit/transfer-course-database)Evaluation Process Students must follow certain steps to have courses taken at another institution evaluated for transfer to UMD. [Learn more](/transfer-credit/transfer-course-evaluation-process)Permission to Enroll Students who wish to take courses at another institution while enrolled at UMD, must complete a Permission to Enroll request. [Learn more](/transfer-credit/permission-enroll)Prior Learning Credit Students have several opportunities to receive undergraduate credit for knowledge and achievements gained through prior learning. [Learn more](/transfer-credit/prior-learning-credit)Reverse Transfer Students may be eligible to transfer courses completed at UMD back to their previously attended Maryland public community college to earn an associate's degree. [Learn more](/transfer-credit/reverse-transfer)Useful Transfer Student Resources Office of Undergraduate Admissions The Office of Undergraduate Admissions assists applicants with questions on the admissions process, such as verifying UMD's receipt of application materials (including transcripts). [Visit Undergraduate Admissions](https://admissions.umd.edu/apply/submitting-documents)Pre-Transfer Advising Program The Pre-Transfer Advising Program assists prospective students with determining their readiness to transfer and estimating time to degree completion at UMD. [Connect with Pre-Transfer Advising](https://www.pretransferadvising.umd.edu/)Records & Registration Services Records & Registration Services assists newly admitted and current students with verifying if their transcript has been received or requesting their domestic transfer courses to be posted to their UMD record. [Email Records & Registration Services](mailto:registrar-help@umd.edu)"]}