{"https://registrar.umd.edu/about-us": ["About Us Who We Are The Office of the University Registrar supports teaching and learning at the University of Maryland by maintaining the integrity of academic policies and the student information system. We are the perpetual stewards of our students records from application to degree conferral. We are part of the area of Enrollment Management which is staffed by student-centered and data-supported professionals committed to designing, implementing, and providing the necessary services from pre-enrollment to graduation. Visit our [Contact Us page](/node/57) to find a listing of the service units and staff members that comprise the Office of the University Registrar team. What We Do The operations conducted in the Office of the University Registrar are compiled into five large categories: the maintenance of students permanent academic records; the support of enrollment and registration processes and systems; the coordination of course and classroom scheduling; the administration and application of academic policies; and information management, data analysis and reporting. Academic Records Maintenance: We are entrusted with the secure and confidential maintenance of students' permanent academic records. We are here to assist with transcript requests, enrollment certifications and degree verifications, transfer credit, university ID cards, residency reclassification, veterans and athlete certifications, degree audits, diplomas, and more. - Enrollment & Registration Services: We oversee processes and systems that support course registration, schedule adjustment, registration for special populations, cancellation of registration, and withdrawal from the university. - Course & Classroom Scheduling: We publish the Schedule of Classes for each semester/term and coordinate the scheduling of courses, classrooms, and final exams. - Policy & Regulation Compliance: We uphold university policies and academic regulations, ensuring fairness and equity in academic processes. If you have questions about academic policies, we're here to help. - Information Management, Data Analysis & Reporting: We provide university employees with secure access to reports containing data under the stewardship of the Office of the University Registrar, including information related to course and classroom scheduling, students records, and enrollment. - Whether you are a current or prospective student, alumni, or a faculty or staff member, the Office of the University Registrar is committed to providing the highest level of service to our constituents in all aspects of our operations."]}