{"https://registrar.umd.edu/residency-reclassification/forms": ["Residency Reclassification Services | Residency Forms Spring 2024/Summer I 2024 Petitions for Residency Reclassification Please be advised that the Spring 2024 petition submission cycle has closed. Petitions will be accepted for Summer I 2024 between April 8, 2024 - May 28, 2024. Students are required to be registered for the semester/term and to submit their petitions by mail or in-person to the office. Electronic submissions will not be accepted. On this page: Petition & Related Forms [Petition for Change in Classification for Tuition Purposes](/sites/default/files/2023-03/residency-petition-effective-winter-2021.pdf) Students wishing to apply for a change to an out-of-state residency designation will need to complete this petition form by the[established petition deadlines](/node/86459).[Maryland Certified Tax Return Request Form (Form 129)](https://www.marylandtaxes.gov/forms/current_forms/129.pdf) All petitioners will be required to submit Comptroller copies of Maryland Income Tax returns.To obtain a Comptroller copy of your state returns, complete Maryland Form 129. Please have all certified returns sent to your home address. You may also visit a [Comptroller branch location](https://www.marylandtaxes.gov/locations.php)to obtain your returns in-person. - This process can take as long as 15 business days. Please take this into consideration as you prepare your petition and supporting documents for submission by the [established petition deadlines](/node/86459). - To obtain a Comptroller copy of your state returns, complete Maryland Form 129. Please have all certified returns sent to your home address. You may also visit a - University System of Maryland Nonresident Tuition Differential Exemption for Eligible Maryland High School Graduates (Maryland Dream Act) [USM Non-resident Tuition Differential Exemption for Eligible Maryland High School Graduates](/sites/default/files/2023-03/dream-act-app-2020.pdf) To request a change in residency based on the Non-Resident Tuition Exemption for Eligible Maryland High School Graduates, complete this from and the required supporting documents listed within the body of the form.[Non-resident Tuition Exemption Checklist](/sites/default/files/2023-11/non-resident-exemption-form-checklist-202310.pdf) Refer to this checklist for information about required documents.Military Personnel [Residency Reclassification Checklist for Military Members/Spouse/Dependents](/sites/default/files/2023-11/military-checklist-202310.pdf) Refer to this checklist for information regarding documentation required for receiving an in-state tuition exemption as military personnel or a spouse/dependent of such.USM Employee [Residency Reclassification Checklist for Regular Employees of USM or their Spouse or Financially Dependent Child](/sites/default/files/2023-11/usm-employees-checklist-202310.pdf) Refer to this checklist for information regarding documentation required for receiving in-state residency status as a regular USM employee or spouse/dependent of such."]}