{"https://registrar.umd.edu/residency-reclassification/deadlines": ["Petition Deadlines Spring 2024/Summer I 2024 Petitions for Residency Reclassification Please be advised that the Spring 2024 petition submission cycle has closed. Petitions will be accepted for Summer I 2024 between April 8, 2024 - May 28, 2024. Students are required to be registered for the semester/term and to submit their petitions by mail or in-person to the office. Electronic submissions will not be accepted. The following deadlines apply to students filing a [petition for change in residency classification](/node/168#petition). Completed petitions must include all supporting documents and be submitted by the first day of classes for the semester/term for which the petition is filed. Submissions received after this deadline will not be accepted. - Only one petition may be filed per semester/term. - Petitions accepted from June 6, 2023 to August 28, 2023 - Deadline to submit the completed petition and all supporting documents is August 28, 2023 at 4:30 p.m. - The applicable 12 month period is September 2022 to August 2023; all supporting documents must be from this time period - You must include all required information and documentation for the applicable period - Petitions accepted from November 8, 2023 to January 2, 2024 - Deadline to submit completed petition and all supporting documents is January 2, 2024 at 4:30 p.m. - The applicable 12 month period is January 2023 to December 2023; all supporting documents must be from this time period - You must include all required information and documentation for the applicable period - Petitions accepted from December 4, 2023 to January 24, 2024 - Deadline to submit the completed petition and all supporting documents is January 24, 2024 at 4:30 p.m. - The applicable 12 month period is February 2023 to January 2024; all supporting documents must be from this time period - You must include all required information and documentation for the applicable period - Petitions accepted from April 8, 2024 to May 28, 2024 - Deadline to submit the completed petition and all supporting documents is May 28, 2024 at 4:30 p.m. - The applicable 12 month period is June 2023 to May 2024; all supporting documents must be from this time period - You must include all required information and documentation for the applicable period - Petitions accepted from May 28, 2024 to July 8, 2024 - Deadline to submit completed petition and all supporting documents is July 8, 2024 at 4:30 p.m. - The applicable 12 month period is July 2023 to June 2024; all supporting documents must be from this time period - You must include all required information and documentation for the applicable period - Petitions accepted from June 4, 2024 to August 26, 2024 - Deadline to submit the completed petition and all supporting documents is August 26, 2024 at 4:30 p.m. - The applicable 12 month period is September 2023 to August 2024; all supporting documents must be from this time period - You must include all required information and documentation for the applicable period -"]}