{"https://registrar.umd.edu/graduation-diplomas/notary-apostille-credential-certification": ["Notary & Apostille Credential Certification Certifying UMD Documents for Use Overseas Foreign countries may require documents to be certified in order to be accepted in the foreign jurisdiction. Apostilles and authentications certify the authenticity of the signature on a document, the capacity in which the person signing the document acted, and the identity of any stamp or seal affixed to the document. An Apostille or authentication should only be requested if it is required by the organization receiving the document.| The educational documents usually requested for certification overseas are the diploma, official transcript, and/or enrollment/graduation verification letter. Please check with the the country in which you will be working or studying to find out if they will require an [Apostille ](https://www.hcch.net/en/instruments/conventions/status-table/?cid=41)or authentication. Apostille The United States is part of the 1961 Hague Convention. Signatory countries of the Convention have agreed to recognize public documents issued by other signatory countries if those documents are authenticated by the attachment of an internationally recognized form of authentication known as an Apostille. Authentication Countries that are not signatories to the Hague Convention may require that the documents undergo an additional step for obtaining an authentication. The authentication validates the document for use in the foreign country. Obtaining an Apostille or Authentication for UMD Documents The steps below detail the process for obtaining an Apostille or authentication. Please note that the Office of the University Registrar can facilitate Step 1 only. Subsequent steps require action with other agencies, as indicated, and are provided solely as a guide to help you through this process. Since different countries require different forms of certification, it is ultimately your responsibility to determine what additional action, beyond Step 1, is required for the specific country with which you are dealing. Present the notarized document to the County Clerk's Office in the county where the notary public is qualified. The County Clerk will certify the signature of the notary public. The County Clerk Office has a per document fee. The County Clerk's Office for Prince George's county is located at the following address: [CLERK OF THE CIRCUIT COURT](http://www.princegeorgescourts.org/178/Clerk-of-the-Circuit-Court)ATTN: NOTARY 14735 MAIN STREET UPPER MARLBORO, MARYLAND 20772 Present the document to the Maryland Secretary of State to affix the Apostille. The Secretary of State has a per document fee. The Maryland Secretary of State is located at the following address: [MARYLAND SECRETARY OF STATE](http://www.sos.state.md.us/)1ST FLOOR ANNAPOLIS MD 21401 If the foreign country is a signatory to the Hague Convention or will accept the Apostille, the document is now certified for use. If the country does not accept the Apostille, or requires authentication beyond the Apostille, proceed to Step 4. (You may refer to [The Hague Apostille Convention](https://www.hcch.net/en/instruments/conventions/status-table/?cid=41) to determine if the country in question will accept the Apostille.) If the foreign country requires the document to be authenticated beyond the Apostille, present the document to the U.S. Department of State, Office of Authentications. The Office of Authentications will issue a certificate under the Seal of the U.S. Department of State authenticating the document. The Department of State has a per document fee. The Office of Authentications is located at the following address: [OFFICE OF AUTHENTICATIONS](http://www.state.gov/m/a/auth/)CA/PPT/S/TO/AUT 44132 MERCURE CIR. PO BOX 1206 STERLING, VA 20166-1206"]}