{"https://registrar.umd.edu/residency-reclassification/faqs": ["Residency Reclassification Services | Residency FAQs On this page: Eligibility for In-state Status Your residency classification is first established at the time of admission to UMD and is based on information you provide as part of the application process. If you do not provide this information or if the information is incomplete, you will be assigned out-of-state status. Once admitted to UMD, you will retain this classification unless and until you file a successful [Petition for Change in Residency](/node/168#petition). Newly admitted students who mistakenly provided inaccurate residency information in their application and simply need to make a correction should reference the \"Newly Admitted Students\" section on the [Residency Reclassification Procedures](/node/168) page for instructions. No. International students, defined as citizens of another country wishing to enter the United States for the purpose of attending a university, may legally do so only with a visa. International students almost uniformly hold either an \"F\" or a \"J\" visa. These visas do not permit them to remain in this country permanently, and do not afford them in-state status; they must leave when their enrollment ends, and they sign a statement to that effect. International students are not to be confused with the broader class of students who simply are not citizens of the United States. UMD enrolls many resident (or immigrant) aliens. Many have lived in the United States for a considerable period of time. They, like citizens, have the legal ability to live permanently without interruption in Maryland. They may be eligible for in-state status. UMD also enrolls many non-resident (or non-immigrant) aliens. Non-resident aliens living in the United States must hold visas. Depending on the type of visa, a student from a foreign country may be eligible for in-state status. To discuss whether or not your visa status potentially qualifies for in-state status, please visit Residency Reclassification Services. These are three of the requirements in the Board of Regents definition of an in-state student. The classification policy does not weigh the requirements differently. Satisfying each requirement is equally important; neglecting any one is potentially disqualifying. Yes. If you are financially dependent on a person who is not a resident of Maryland, then the classification policy presumes you are residing in Maryland primarily for the purpose of attending an educational institution. You may present evidence to rebut this presumption, but if you are not successful, you will be assigned out-of-state status. There is no formula for rebutting this presumption. Rather, you must demonstrate that you intend to make Maryland your permanent home and reside in Maryland indefinitely. The [ University System of Maryland Policy for Classification for Admission and Tuition Purposes'](https://policies.umd.edu/fiscal-and-business-affairs/university-system-of-maryland-policy-for-student-classification-for-admission-and-tuition-purposes) section entitled \"Rebuttal Evidence\" provides examples of objectively verifiable conduct upon which the university bases the decision on in-state status. It is important to note that satisfying the minimum civic requirements does not rebut the presumption that you are residing in Maryland primarily for education reasons; rather, you must provide clear, convincing and objective evidence that your primary reason for living in Maryland is for something other than for educational purposes (e.g. full-time employment or family).", "As part of the compensation package for graduate assistants, UMD pays some or all of your tuition through \"tuition remission.\" Graduate assistants receiving remission are billed tuition and fees at the in-state rate. This is just an administrative accounting transaction. It has no relevance or effect on your classification status. Your proper status was indicated on your admission letter. You will always retain that classification unless you successfully [petition to have it changed](/node/168) through the established procedures of Residency Reclassification Services. If you were classified as out-of-state, when you no longer receive tuition remission, you will be billed at that rate. No. Paying all applicable Maryland taxes is just one of the requirements necessary for in-state classification. Taken by itself, paying Maryland taxes will not qualify you for in-state status. Conversely, not paying all required taxes will result in an out-of-state classification. Yes. Generally, there is no advantage for those who relocate to Maryland as a result of a change in employment location. The [exception](/node/174) in the classification policy is for active military duty members, their spouses and their financially dependent children. Yes. Leaving Maryland for the summer or during semester breaks may jeopardize your reclassification. Every case will be judged individually; however, if you regularly return to a former residence in another state it reasonably suggests you are now residing in Maryland primarily to attend UMD. Not necessarily. Because you were residing in another state at the time of application, the out-of-state presumption in the classification policy is triggered. Your status will depend on your ability to assemble sufficient facts about yourself to rebut the conclusion that you are now residing in Maryland primarily for the purpose of attending UMD. Such things as family circumstances, personal relationships, and employment separate from the campus may also have played a role. These will be considered by UMD when assessing your primary reason for residing in the state. Yes. A classification decision is based on the facts as they exist at the time you seek reclassification. However, with the passage of time, your personal, professional, and/or economic circumstances may have changed. An examination of the facts in your petition for reclassification may now demonstrate you are residing in Maryland for a more complex set of reasons. For example, you may now hold a job in the community; have bought a house here; have a Maryland spouse; or have children in Maryland public schools. You should outline your reasons for living in Maryland as part of your petition for reclassification. No. You cannot be classified in-state at Maryland by default. The formula for attaining favored tuition status is different in every state. Although classification policies across the country commonly employ the term \"resident,\" they usually define it differently. In fact, such policies seldom rely on traditional notions of simple \"residency,\" meaning little more than physical presence or domicile. They present a more rigorous set of objective tests, varying in emphasis depending on the purpose and philosophy of each governing board. No. Simply living in Maryland for 12 consecutive months or having mail delivered to you in the state does not entitle you to in-state status. A continuous physical presence in Maryland is certainly important, but it is only one of several requirements established by the Board of Regents. Equally important, for example, are the circumstances that brought you to Maryland and the extent to which you have taken other actions which, in the judgment of the Regents, are minimally needed to demonstrate a reasonable probability you intend to remain in Maryland following graduation and benefit the community. Generally, only this narrowly defined group is granted in-state status.", "Please review the [ University System of Maryland Policy for Student Classification for Admission and Tuition Purposes](https://policies.umd.edu/fiscal-and-business-affairs/university-system-of-maryland-policy-for-student-classification-for-admission-and-tuition-purposes) for all residency reclassification requirements. The Deferred Action of Childhood Arrivals is a type of Deferred Action. First semester students must submit either a copy of their Employment Authorization card (front and back) or a copy of their I-797. In addition, the student must complete the residency information form when they apply to UMD. Students must also meet all criteria for in-state status as defined by the [ University System of Maryland Policy for Student Classification for Admission and Tuition Purposes](https://policies.umd.edu/fiscal-and-business-affairs/university-system-of-maryland-policy-for-student-classification-for-admission-and-tuition-purposes). DACA students who have completed at least one semester at College Park must complete a [Petition for Change in Residency](/node/168#petition) and submit all required documentation. Newly admitted students seeking a review of their initial residency determination may contact Residency Reclassification Services at 301-314-9596 or [resclass@umd.edu](mailto:resclass@umd.edu). Petition for Change in Residency Classification No. At every level of the petition process, including appeals, your documentation is carefully considered. Appeals are meant for you to bring additional information that supports your case and your inability to meet the policy requirements for the requisite twelve month period. By appealing, you do not earn automatic approval for in-state status. Appeals are warranted if, and only if, a student provides sufficient documentation (as determined by appeal designates) of a rare, unforeseen and/or compelling circumstance that precludes them from meeting any or all of the policy criteria. Yes. There are two levels of appeal following the decision of the Residency Classification Evaluator. The first level is to the Residency Review Committee and the second and final level is to the Presidential Designee. Please see [Residency Reclassification Procedures](/node/168#appeals) for more information. The [residency petition deadline](/node/86459) is the first day of classes in the semester for which in-state status is sought. By that time, a complete petition for change, with all required supporting documents, must be delivered to Residency Reclassification Services. Incomplete petitions will not be accepted or considered. No. While your residency petition is being considered, you are responsible for paying your entire out-of-state bill on time. If your residency petition is granted, you will be credited with the tuition differential. No. It is your responsibility to know your classification and take timely action to challenge it if you believe it incorrect. A petition for change is granted only prospectively. You may contact Residency Reclassification Services at [resclass@umd.edu](mailto:resclass@umd.edu) or 301-314-9596. You may also visit the office in Room 1130, Clarence M. Mitchell, Jr. Building. Exception or Exemption No. The Board of Regents does not permit exceptions on account of personal financial hardship. The Board of Regents has, however, authorized an assignment of in-state status to some groups of persons regardless of the criteria. Relevant to the university, these are: Full-time or part-time (50% time or more) regular employees of the university - The spouse or dependent child of an employee, as defined above - Certain full-time active duty members of the United States armed forces and their spouses and dependent children - Current active members of the Maryland National Guard - Certain honorably discharged members of the Armed Forces of the United States - Graduate assistants during the term of their appointment - You must read [ University System of Maryland Policy for Student Classification for Admission and Tuition Purposes](https://policies.umd.edu/fiscal-and-business-affairs/university-system-of-maryland-policy-for-student-classification-for-admission-and-tuition-purposes) to learn the requirements of each exception.", "The Board of Regents has also authorized the President of the university to determine \"the student is indeed in-state and the application of the criteria creates an unjust result\" and to waive any of the criteria. Waivers are rarely granted by the President. Financial hardship is not an authorized basis for a Presidential waiver. To request a change in residency based on the Nonresident Exemption for Eligible Maryland High School Graduates, complete the [University System of Maryland Nonresident Tuition Exemption Request For Eligible Maryland High School Graduates ](/sites/default/files/2023-03/dream-act-app-2020.pdf) and provide the required supporting documentation listed on the form. You can submit this form along with the supporting documents in-person or by mail by the first day of classes for the semester you are submitting the request. See [Maryland Dream Act](/node/173) for more information."]}