{"https://registrar.umd.edu/residency-reclassification": ["Residency Reclassification Services | Residency Reclassification Spring 2024/Summer I 2024 Petitions for Residency Reclassification Please be advised that the Spring 2024 petition submission cycle has closed. Petitions will be accepted for Summer I 2024 between April 8, 2024 - May 28, 2024. Students are required to be registered for the semester/term and to submit their petitions by mail or in-person to the office. Electronic submissions will not be accepted. Residency Reclassification Services handles students requests to be reclassified as in-state residents for tuition purposes. Students who are initially classified as out-of-state residents by the Office of Undergraduate Admissions or Graduate Admissions, and subsequently believe they meet the requirements for in-state tuition and fees may apply for in-state residency. The Office of Undergraduate Admissions, Graduate Admissions, and the Office of the University Registrar adhere to policies established by the Board of Regents regarding residency classification of students for tuition purposes. [ University System of Maryland Policy for Student Classification for Admission and Tuition Purposes](https://policies.umd.edu/fiscal-and-business-affairs/university-system-of-maryland-policy-for-student-classification-for-admission-and-tuition-purposes) will be applied to all student tuition classification decisions. Students should notify Residency Reclassification Services at the University of Maryland, College Park, in writing, within fifteen (15) days of any change in circumstances which may alter in-state status. Failure to do so may result in retroactive charges for each semester/term affected. Reclassification Procedures Students may seek a review or change to their out-of-state residency designation following certain procedures. [Learn more](/residency-reclassification/procedures)Petition Deadlines Students who file a petition for change in residency classification must do so by UMD's established deadlines. [Learn more](/residency-reclassification/deadlines)Non-Resident Tuition Exemptions Students who have been classified as non-resident and meet certain exemption criteria may be eligible to be billed at the in-state tuition rate. [Learn more](/residency-reclassification/non-resident-tuition-exemptions)"]}