{"https://registrar.umd.edu/grades-records/transcripts": ["Constituent Relations Services | Transcripts The University of Maryland has partnered with National Student Clearinghouse (NSC) for convenient transcript ordering and delivery. Transcript Ordering Instructions Consult the intended recipient about the preferred transcript format. Electronic PDF transcripts are not accepted by all recipients and the university will not reissue transcript orders or provide a refund for orders once they are processed. - If applicable, have your application service ID/account number ready (e.g., AMCAS, LSAC, Common App). Forms are no longer necessary when sending a transcript using your application service account number. - If applicable, prepare agency-required forms that must be included with your transcript. Documents or forms that cannot be authenticated by the Office of the University Registrar will be removed from your transcript request. Examples of documents that will not be accepted as attachments include: unofficial or official transcripts, diplomas, letters or correspondence, copies of identity documents (e.g. passports, driver's license). - Have your credit or debit card ready. The University of Maryland charges $8.00 for each official transcript. Note: National Student Clearinghouse charges additional processing and shipping and handling fees based on your selections. - You will need your 9-digit University ID (UID) number to request a transcript. How do I obtain my UID? Using your directory ID and password, login to[Testudo](https://app.testudo.umd.edu/main/profile)to obtain your UID. You can find your UID beneath your name on the Profile page. - How do I obtain my directory ID and password? Visit[Former Student Identity Verification](https://identity.umd.edu/id/formerstudent)to obtain your directory ID and password (on this page you may select UID or select last 5 digits of SSN from the dropdown box). For additional instructions, review this[IT Support Article](https://umd.service-now.com/itsupport?id=kb_article_view&table=kb_knowledge&sys_kb_id=ef71759597f52d10e36e11900153afa5). - - How do I obtain my UID? - You will be notified during the transcript ordering process if a hold exists on your record. Your transcript order cannot be processed until the hold is removed. Once the hold is resolved, your transcript will be released. Your credit card will not be charged until your order is completed. Judicial Hold: Contact the Office of Student Conduct at 301-314-8204 or [studentconduct@umd.edu](mailto:studentconduct@umd.edu)to resolve the hold on your student record. - Administrative Hold: Contact the Office of the University Registrar at 301-314-8240 or [registrar-help@umd.edu](mailto:registrar-help@umd.edu)to resolve the hold on your student record. - No Record Found: Please refer to the FAQs below for a list of reasons why your transcript is unable to be processed. If you believe you received this message in error, contact the Office of the University Registrar at 301-314-8240 or [registrar-help@umd.edu](mailto:registrar-help@umd.edu)to resolve this issue. - Archived Record Hold: No action necessary. Please allow an additional 3-5 business days for your record to be processed. - Electronic PDF transcripts are generally processed the same business day. Once the electronic PDF transcript is sent, the recipient will receive two email notifications  one with a secure 30-day link and another with a password to access the transcript. No refund will be provided if the recipient fails to retrieve the electronic PDF transcript within 30 days. - Paper transcripts are processed within 1-2 business days after receipt of your order and are subject to domestic and international shipping. Certified mail and express shipping options are available for selection during the transcript ordering process. -", "GPAs and Degrees for Current Students and Recent Graduates: Prior to placing your order, review your [unofficial transcript](https://app.testudo.umd.edu/main/uotrans)to confirm that your GPA and/or degree have posted to your record. No refund will be provided if your order is fulfilled before GPAs and/or degrees appear on your transcript. GPA and degree posting dates can be found on the[transcript ordering site](https://tsorder.studentclearinghouse.org/school/ficecode/00210300). - Processing Delays may occur for the following reasons: Holds: Holds on your record will delay transcript processing. Consult the Holds on Your Record section above for details. - Attachments: You have the ability to upload documents that must accompany your official transcript. Your attachment will be reviewed and is subject to approval. This may cause a slight delay in processing. - - You should not submit a transcript request through the National Student Clearinghouse if you are part of a group listed below. Institute of Applied Agriculture (IAA): Students requesting an official transcript of coursework completed through IAA must submit a transcript request via the [Institute of Applied Agriculture Transcript Request](https://app.testudo.umd.edu/main/transcriptRequestView)option on Testudo. - Veterinary Medicine: Students must submit a transcript request to [Virginia Tech, Office of the University Registrar](https://www.registrar.vt.edu/academic-records/Transcript-Requests.html). - Inter-Institutional, DC Consortium, BigTen Course Share, or Crosstown ROTC: Students must contact their home institution to obtain an official transcript. - Last date of attendance at UMD was prior to 1982: Students must contact the Office of the University Registrar at 301-314-8240 or [registrar-help@umd.edu](mailto:registrar-help@umd.edu)to obtain your transcript. - Transcript FAQs No, all transcript orders must be placed online through National Student Clearinghouse. Electronic PDF transcripts are generally processed the same business day. For paper transcripts, National Student Clearinghouse offers several domestic and international shipping options for expedited service. You cannot submit a transcript request through National Student Clearinghouse. Please see the Applied Agriculture, Veterinary Medicine, Visiting, and Former Students section above for details. If you attached a document that the Office of the University Registrar cannot authenticate or is not appropriate to be included with an official transcript, we will remove the uploaded document and proceed with processing your transcript order."]}