{"https://registrar.umd.edu/grades-records/enrollment-certifications-degree-verifications": ["Constituent Relations Services | Enrollment Certifications & Degree Verifications Enrollment Certifications provide confirmation of enrollment status and dates of attendance. Degree Verifications provide dates of attendance and degree(s) conferred. The Office of the University Registrar will not complete agency supplied verification forms. The enrollment certificate can be attached with the original agency supplied form.| Certifications and verifications are available at no cost to current and former students. Third parties may obtain certifications and verifications from the National Student Clearinghouse for a nominal fee. See below for details. Current & Former Students Current and Former Students can obtain certifications and verifications in one of four ways: [Testudo](https://app.testudo.umd.edu/main/enrollmentCertificationStatus)Note to former students: Accessing these services requires you to login with a UMD Directory ID and password. To see if you have a Directory ID or to create one, go to the [Former Student Identity Verification](https://identity.umd.edu/id/formerstudent)page. For more information, see how to[Obtain a New Directory ID for Former Students](https://umd.service-now.com/itsupport?id=kb_article_view&table=kb_knowledge&sys_kb_id=ef71759597f52d10e36e11900153afa5). - Note to former students: Accessing these services requires you to login with a UMD Directory ID and password. To see if you have a Directory ID or to create one, go to the - [National Student Clearinghouse (NSC) Myhub](https://auth.myhub.org/stauth/samlfed/sso002103idp)Convenient 24/7 access and immediate download of enrollment certifications and good student discount. - Students with a Directory ID and passphrase who were enrolled after Fall 2000 can reference [instructions on Myhub](/node/67717). - Visit the Office of the University Registrar Front Counter, located on the First Floor of the [Clarence M. Mitchell, Jr. Building](https://maps.umd.edu/map/index.html?&feature=building&name=052&basemap=detailed).Please bring your university or government issued ID. - - Send your signed [Enrollment Certification/Degree Verification Request ](/sites/default/files/2023-03/enrollment-verification-request.pdf)to the Office of the University Registrar by:Email: [registrar-help@umd.edu](mailto:registrar-help@umd.edu) - Fax: 301-314-9568 - Mail: University of Maryland Office of the University Registrar First Floor, Clarence M. Mitchell, Jr. Building College Park, MD 20742 - - Email: - Third Parties Third parties (employers, insurance agencies, background screening firms, etc.) must contact NSC directly for enrollment and degree verification services at [https://nscverifications.org/](https://nscverifications.org/). The University of Maryland, College Park school code is 002103."]}