{"https://registrar.umd.edu/faculty-staff/data-requests-report-library": ["Data Requests & Report Library The Office of the University Registrar is the record custodian of all currently and formerly enrolled students. Requests for information about students must be approved by the Office of the University Registrar. How is information protected? The University of Maryland complies with the Family Educational Rights and Privacy Act (FERPA). FERPA is a federal law that protects the privacy of student \"education records.\" FERPA provides that educational institutions may disclose education records, or personally identifiable information from such records, only if an eligible student has provided prior written consent, except in several specified circumstances. FERPA allows for the disclosure of those records, without consent, to school officials with legitimate educational interests. For more information about FERPA and the disclosure of student education records visit the [Undergraduate Catalog](https://academiccatalog.umd.edu/). - Who has access to data? According to [policy VI-23.00(A)](https://policies.umd.edu/policy/6f53b942-66cf-4b2d-8e0b-52d69d9c0dda/), a \"Data User\" is \"Any UM employee or student who has lawful and appropriate access to a specific subset of data. All users must adhere to federal, State and UM laws, regulations and policies regarding access.\" - What information can be shared? Certain information has been designated \"Directory Information\" and may be disclosed without prior consent unless a student files written notice. Directory information includes, but is not limited to: name, address, telephone, email, date of birth, major field of study, participation in officially recognized activities and sports, weight and height of members of athletic teams, dates of attendance, degrees and awards received, and most recent previous educational institution attended. Prior consent will not be required for disclosure of educational records to school officials of the University of Maryland who have been determined to have legitimate educational interests. - Information for approved staff is available in the following ways: The Office of the University Registrar's Report Library provides university employees with secure access to reports containing data under the stewardship of the Office of the University Registrar. Reports include information related to course and classroom scheduling and student records and enrollment. The University's data warehouse serves as the source of data for the Report Library. Data in the warehouse is refreshed nightly from the Student Information System (SIS). The data steward for the Office of the University Registrar grants access to these reports based on the requestor's job responsibilities and role at the university. Request Access: To request access to the Registrar Reports in the Report Library, complete the [PHR Service Office Reports and Registrar Reports Request](https://umd.service-now.com/itsupport?id=sc_cat_item&sys_id=b4f54437db58901450cdeba81396190e)form (select the \"Registrar Reports\" option). - Questions: Questions about the Office of the University Registrar's Report Library can be directed to [registrar-report-library@umd.edu](mailto:registrar-report-library@umd.edu). - Ad hoc query access to the UMD Data Warehouse provides users with the ability to write their own queries from scratch, customized to their needs. However, this access also requires that the user is familiar with relational database querying and is able to write queries in SQL or using a query building tool such as SAS Enterprise Guide. As such, this kind of access requires that the user has: A basic understanding of how to query relational databases - A good understanding of relevant university processes and cycles (student advising cycles, course drop/add deadlines, etc.) - Access to a data query tool (the SAS Enterprise Guide query tool is provisioned as part of this process) - The data steward for the Office of the University Registrar grants query access to the data warehouse based on the requestor's job responsibilities and role at the university.", "Request Access: To request ad hoc query access to the Scheduling & Curriculum or Student data sets in the data warehouse, complete the [Ad Hoc Query Access Request](https://umd.service-now.com/itsupport?id=sc_cat_item&sys_id=3da97c26db5084103fb0d92b5e961976)form. - The Office of the University Registrar releases student data to authorized UMD officials only for legitimate educational purposes per [ policy III-6.30(A)](https://policies.umd.edu/academic-affairs/university-of-maryland-policy-and-procedures-on-the-disclosure-of-student-education-records). Not all requests can be approved under established policies; if a request cannot be approved, an explanation will be provided. Requests for aggregate information for official use in publications or presentations must be made to the office of [Institutional Research, Planning, and Assessment](https://www.irpa.umd.edu/) (IRPA). All requests for data must be submitted using the data request form:"]}