{"https://registrar.umd.edu/registration/register-classes": ["Undergraduate Contact: Records and Registration Services Graduate Contact: Graduate Degree Clearance Services | Register for Classes All students must register to be able to attend classes at the University of Maryland. Registration requests can be processed online, by email, or in-person. Students are responsible for understanding UMDs registration policies and guidelines which can be found in the [ Academic Catalog](http://academiccatalog.umd.edu) and outlined in the sections below. Steps to Register Students should review steps to register for courses carefully to ensure a successful registration process [Learn more](/registration/register-classes/steps-register)Add & Drop Classes Students may process changes to their schedule by adding and dropping classes after initial registration [Learn more](/registration/register-classes/add-drop-classes)Blocks, Special Permissions & Exceptions to Policy Students may encounter a registration block that prevents them from registering for classes [Learn more](/registration/register-classes/blocks-special-permissions-exceptions-policy)Enrollment Status The Office of the University Registrar is responsible for compliance with standards for full-time and half-time enrollment [Learn more](/registration/register-classes/enrollment-status)Final Exams University guidelines state that there will be a final examination and/or assessment in every undergraduate course [Learn more](/registration/register-classes/final-exams)Grading Method Grading method determines how a course will be reflected on the students permanent academic record and counted toward degree progress [Learn more](/registration/register-classes/grading-method)Non-Standard Courses Non-standard courses do not meet for the standard semester or term dates [Learn more](/registration/register-classes/non-standard-courses)Seat Management Plan The seat management plan is only used in the fall and spring semesters to reserve a portion of seats in general education and a few selected other courses [Learn more](/registration/register-classes/seat-management-plan)Waitlist & Hold File If a course is full when a student registers, the waitlist/hold file option may be available [Learn more](/registration/register-classes/waitlist-hold-file)Additional Resources for Registration Registration Guide The Registration Guide is a downloadable document that provides information on a range of academic, enrichment, and support services available at the university. [View the Registration Guide](/registration-guide)Extended Studies For registration information about Summer session, Winter session, Freshmen Connection, and Professional Programs, visit Extended Studies. [Visit Extended Studies](https://exst.umd.edu/)"]}