{"https://registrar.umd.edu/registration": ["Undergraduate Contact: Records and Registration Services Graduate Contact: Graduate Degree Clearance Services | Enrollment & Registration Registration Agreement When you register, the university reserves specific class space for you and commits resources to provide the instruction you have selected. On your part, you assume responsibility for paying tuition and fees or for notifying the university if you decide not to attend. The availability of the courses listed in [Testudo](http://testudo.umd.edu) and the [Schedule of Classes](https://app.testudo.umd.edu/soc/) is subject to change. A section may be cancelled due to low enrollment or departmental staffing considerations. When a class is cancelled, the department or the Office of the University Registrar will notify registered students and help them make alternate arrangements, if necessary. Registered students are encouraged to verify their class meeting time and location on [Testudo](http://testudo.umd.edu) on the first day of classes for the most up-to-date information. All students who register incur a financial obligation to the university. Please note that while the university reserves the right to limit or cancel enrollment for students who owe a debt to the university, your registration may not be automatically cancelled for non-payment of tuition and fees. It is the student's responsibility to avoid charges by cancelling their registration prior to the first day of classes each semester. By cancelling your registration before the start of classes, you will avoid any charges and your class spaces will be released in time to become available to other students. Registration for Special Populations Registration information for DC Consortium, USM Inter-Institutional enrollment, ROTC, Golden ID, Faculty, and Staff [Learn more](/registration/special-populations)Separating from the University Details about leaving the university before or after classes begin [Learn more](/registration/separating-university)"]}