{"https://registrar.umd.edu/": ["Welcome! The Office of the University Registrar supports teaching and learning at the University of Maryland by maintaining the integrity of academic policies and the student information system. We are the perpetual stewards of our students' records from application to degree conferral. Calendars View key semester and 12-week term dates, including deadlines for schedule adjustment and withdrawal. [Dates & Deadlines](/calendars)Parents & Guardians Students may grant limited parent/guardian access to their record. [Access to Records](/grades-records/ferpa-confidentiality/parent-guardian-access)Registration Review registration steps to ensure a successful registration process. [Steps to Register](/registration/register-classes/steps-register)Transcripts Students can order official transcripts or view their unofficial transcript online. [Place an Order](/grades-records/transcripts)Summer I Residency Petitions Residency reclassification petitions for Summer I 2024 will be accepted from April 8 to May 28. Students are required to be registered for a Summer I session and to submit their petitions by mail or in-person to the office. Electronic submissions will not be accepted. The deadline to submit a completed petition and all supporting documents is May 28, 2024 at 4:30 pm. Please be sure to review all requirements for submitting a petition: [Residency Information](/residency-reclassification)Fall 2024 Early Registration Students should view their registration appointment and blocks now. Go to [Testudo](https://app.testudo.umd.edu) and select \"Appointment and Registration Status\" to see the earliest you can register and all blocks that must be cleared prior to registering. [Steps to Register](/registration/register-classes/steps-register)Taking Courses at Another Institution The transfer course database is continually being updated. If you are a current undergraduate student looking to take classes elsewhere, make sure to check the transfer course database and follow your college's [Permission to Enroll process](/node/110). [Transfer Course Database](/transfer-credit/transfer-course-database)"]}