{"https://registrar.umd.edu/graduation-diplomas/degree-requirements/graduate-degree-requirements": ["Graduate Degree Requirements Graduate Degree Clearance Services in the Office of the University Registrar is responsible for assessing the graduation requirements and approving graduate students for master's degrees, doctoral degrees, and graduate certificates. These processes comply with policies and deadlines established by [The Graduate School](https://gradschool.umd.edu/). To be cleared for graduation, students must meet all requirements and deadlines. Degree & Certificate Completion Processes Listed below are the basic outlines for the university's completion processes for master's degrees, doctoral degrees, and graduate certificates. The information is a summary of the essential progress of the latter-stages of most graduate program completion experiences at the university. Graduate programs may have requirements beyond those listed here. Please check with your academic advisor and departmental Graduate Studies Office for specific program requirements. Completion of required coursework - Submission of [Application for Graduation](https://app.testudo.umd.edu/#/main/graduationApp) - Submission of [Approved Program Form](https://gradschool.umd.edu/sites/default/files/2022-11/apf_masters_and_certificates_202205.pdf)Please verify the timeline and submission procedure for this form with your department - - Completion of departmental examination requirements - Completion of thesis/departmental writing requirement: Thesis Student Register for at least 1 credit at semester of graduation - Submission of [Nomination of Thesis or Dissertation](https://gradschool.umd.edu/sites/default/files/2022-11/umd_nomination_of_thesis_or_dissertation_committee_202205.pdf)The nomination of the thesis/dissertation committee should be submitted at least six weeks before the date of the expected defense examination. Some departments require that the thesis/dissertation examining committee be nominated prior to the beginning of the thesis/dissertation. Please check with your department. - Before submitting this form, please verify with your department that all members of the committee are active and can serve on the committee. - - Thesis oral examination defense - Submission of signed Report of Thesis Examination Committee form Please verify the timeline and submission procedure for this form with your department - - Submission of thesis electronically via [ProQuest Learning Services](https://www.etdadmin.com/main/home?siteId=76)A processing and archiving fee will be charged to your student account. - - Evaluation and approval of submitted thesis - Graduation - - Non-Thesis Student Register for at least 1 credit at semester of graduation - Your department will submit your completed [uAchieve](http://uachieve.umd.edu)audit showing program completion - Graduation - - - Thesis Student - The [Master Degree Completion and Graduation Checklist ](https://gradschool.umd.edu/sites/default/files/2022-11/umd_masters_degree_checklist_2021.pdf) can be downloaded to serve as a guide to your degree completion. Also completing a graduate certificate? Master's degree candidates seeking to be awarded a graduate certificate should submit the [Graduate Certificate Completion form](https://umdsurvey.umd.edu/jfe/form/SV_8omfxfE4TXIkXrg). Completion of required coursework - Completion of departmental examinations and requirements - Completion of departmental qualifying examinations - Submission of [Application for Admission to Candidacy](https://gradschool.umd.edu/sites/default/files/2022-11/application_for_candidacy_202205.pdf) - Beginning - Completion of dissertation - Submission of [Application for Graduation](https://app.testudo.umd.edu/#/main/graduationApp) - Submission of [Nomination of Dissertation Committee](https://gradschool.umd.edu/sites/default/files/2022-11/umd_nomination_of_thesis_or_dissertation_committee_202205.pdf)The nomination of the thesis/dissertation committee should be submitted at least six weeks before the date of the expected defense examination. Some departments require that the thesis/dissertation examining committee be nominated prior to the beginning of the thesis/dissertation. Please check with your department. - Before submitting this form, please verify with your department that all members of the committee are active and can serve on the committee. - - Dissertation Oral examination defense - Submission of signed Report of Dissertation Examination form - Submission of dissertation electronically via [ProQuest Learning Services](https://www.etdadmin.com/main/home?siteId=76)A processing and archiving fee will be charged to your student account. - - Evaluation and approval of submitted dissertation - Graduation - The [Doctoral Degree Completion and Graduation Checklist ](https://gradschool.umd.edu/sites/default/files/2022-11/umd_doctoral_degree_checklist_2021.pdf) can be downloaded to serve as a guide to your degree completion.", "Doctor of Audiology graduates should submit the [Certification of Doctor of Audiology Degree form ](https://gradschool.umd.edu/sites/default/files/2022-11/apf_masters_and_certificates_202205.pdf) to the Office of the University Registrar. Completion of required coursework - Submission of [Application for Graduation](https://app.testudo.umd.edu/#/main/graduationApp)If you submitted an application for graduation for your master's degree and are also completing a graduate certificate, please also submit the [Graduate Certificate Completion form](https://umdsurvey.umd.edu/jfe/form/SV_8omfxfE4TXIkXrg). - - If you submitted an application for graduation for your master's degree and are also completing a graduate certificate, please also submit the - Verification of coursework completion - Graduation - Additional Petitions, Waivers, and Request Contact Information Graduate Degree Clearance Services [C. Mitchell Bldg, Rm 1113](https://maps.umd.edu/map/index.html?&feature=building&name=052&basemap=detailed) [registrar-graduate@umd.edu](mailto:registrar-graduate@umd.edu) Dianne Barrett 301-314-8226 [registrar-graduate@umd.edu](mailto:registrar-graduate@umd.edu)"]}