{"https://registrar.umd.edu/graduation-diplomas/diplomas/certified-electronic-diplomas": ["Certified Electronic Diplomas Starting with the Spring 2022 graduating class, the University of Maryland is offering certified electronic diplomas and certificates (CeDiploma/CeCertificate) to its graduates. The CeDiploma/CeCertificate is an official, secure, portable, and verifiable electronic PDF version of the graduate's diploma/certificate that was issued by the university. For security reasons, the electronic version of your diploma/certificate cannot be printed. How to Access Your Credential The email you receive confirming the mailing status of your printed diploma will contain a link to download your credential when it is available from our trusted partner, CeCredentialTrust. If you are in need of a new download link, please use the [CeCredential Trust](https://secure.cecredentialtrust.com/account/resendinvitationlink/) site. The Benefits of Going Digital The benefits of your CeDiploma/CeCertificate inlcude: Ability for future employers, State Government Licensing Agencies, and other entities to directly validate your CeDiploma/CeCertificate with UMD. - Unlimited sharing with family, friends, and on social media. - Instant proof of your education using [Validation Services](/node/166). - Ability to save the PDF on as many devices as you choose. - Ability to enhance your resume by adding the [CeDiD](https://secure.cecredentialtrust.com/solutions/validationservices/)(a unique 12-digit Certified Electronic Document Identifier) and validation URL directly to it. - More About CeCredentials [Features](https://secure.cecredentialtrust.com/cecredential/overview/): Learn more about the security features of a CeDiploma or CeCertificate[Validate](/node/166): Validate a CeDiploma or CeCertificate[FAQ](https://secure.cecredentialtrust.com/cecredential/faq/): View commonly asked questions about the CeDiploma or CeCertificateFor additional information about digital credentials, their features, trademarks and patents, please visit [cecredentialtrust.com](https://secure.cecredentialtrust.com/account/home/)."]}