{"https://registrar.umd.edu/book/export/html/168": ["Procedures for Residency Reclassification Procedures for Residency Reclassification createdSpring 2024/Summer I 2024 Petitions for Residency Reclassification Please be advised that the Spring 2024 petition submission cycle has closed. Petitions will be accepted for Summer I 2024 between April 8, 2024 - May 28, 2024. Students are required to be registered for the semester/term and to submit their petitions by mail or in-person to the office. Electronic submissions will not be accepted. Residency classifications are made in accordance with Board of Regents requirements for reclassification, as specified in [ University System of Maryland Policy for Student Classification for Admission and Tuition Purposes](https://policies.umd.edu/fiscal-and-business-affairs/university-system-of-maryland-policy-for-student-classification-for-admission-and-tuition-purposes); students are classified with an out-of-state residency classification when they do not meet one or more of those requirements. An initial determination of resident status for admission, tuition and charge differential purposes will be made upon review of a student's application for admission. That determination will apply for each semester/term unless a student's resident status is updated through one of the following procedures: Newly admitted students (including newly readmitted students) who provided inaccurate residency information in their application for admission (or reenrollment) to UMD resulting in an out-of-state residency designation, may contact Residency Reclassification Services at [resclass@umd.edu](mailto:resclass@umd.edu) for an explanation regarding their out-of-state classification. Students will then be advised why they were classified as out-of-state, and additional information may be requested as needed. Students should not submit information for reclassification unless requested. Students must contact Residency Reclassification Services and submit their requested information by the last day of classes for the semester/term for which they are admitted/readmitted in order to seek reclassification. In certain cases, students may be requested to submit a residency petition if they fail to meet the Board of Regents requirements for reclassification as specified in [ University System of Maryland Policy for Student Classification for Admission and Tuition Purposes](https://policies.umd.edu/fiscal-and-business-affairs/university-system-of-maryland-policy-for-student-classification-for-admission-and-tuition-purposes) by the first day of the semester/term reclassification is sought or the specified deadline communicated by Residency Reclassification Services. Students who fail to contact Residency Reclassification Services or submit the requested documentation information by the last day of classes for the semester/term for which they are admitted/readmitted will remain as out-of-state and will be required to submit a residency petition for a subsequent semester/term (for which they are registered) by the first day of the semester/term reclassification is sought or the specified deadline communicated by Residency Reclassification Services. If advised to submit a residency petition, please review the instructions below on the petition reclassification process. Current students who are classified with an out-of-state residency classification and are seeking a change to their residency classification must submit a residency petition by the first day of the semester/term reclassification is sought or the specified deadline communicated by Residency Reclassification Services. Petition for Change in Residency Classification Students seeking a change to their out-of-state residency classification can file a [Petition for Change in Classification for Tuition Purposes](/sites/default/files/2023-03/residency-petition-effective-winter-2021.pdf). Only one petition may be filed per semester/term. - Requests for retroactive changes in residency classifications will not be accepted. Students must submit their petitions according to [UMD's established deadlines](/node/86459). Petitions will not be accepted if a student is not registered for that term. - Petitions will only be accepted and evaluated if accompanied by all supporting documents. Late and incomplete petitions will not be accepted. The required supporting documents are listed within the body of the petition. Students should also refer to the end of the document for a checklist of required supporting documents. - Assignment of in-state or out-of-state classification for the purposes of admission and assessing tuition will be made upon an assessment of all facts known or presented to the University of Maryland. Petitioners shall have the burden of proof that they satisfy all requirements. -", "In the event that incomplete, false, or misleading information is presented, the University of Maryland will revoke in-state classification and may take disciplinary action against the student according to its [Code of Student Conduct](https://policies.umd.edu/student-affairs/university-of-maryland-code-of-student-conduct). If in-state classification is granted due to false or misleading information, UMD reserves the right to retroactively assess all out-of-state charges for each semester/term affected. - While petitions are under review, students are required to make full tuition payment at the out-of-state rate. The Evaluator's decision will be sent by email to the student's email address on file with the university. - Appeal to a Denial Decision for a Petition for Change in Residency Classification Petitions initially reviewed by a Residency Reclassification Evaluator and denied based on the Board of Regents Policy for Student Residency Classification, may proceed as follows: A student who has been denied in-state reclassification following the submission of a [Petition for Change in Classification for Tuition Purposes](/node/168#petition) may submit a written appeal to the Residency Review Committee (RRC). The link to the Appeal Form will be included in your initial decision denial letter sent by the Residency Classification Evaluator. The completed form must be submitted no later than ten (10) working days from the date of the written adverse decision to your [Petition for Change in Classification for Tuition Purposes](/node/168#petition). Appeals received after ten (10) working days of the written adverse decision will not be accepted without prior approval from Residency Reclassification Services. To receive approval to submit a late appeal after the required ten (10) working days deadline, students must contact Residency Reclassification Services at [resclass@umd.edu](mailto:resclass@umd.edu) before the deadline and provide a written explanation. If the request to submit a late Appeal is granted, the completed form and all supporting documentation can then be submitted for review to the RRC by the deadline communicated by Residency Reclassification Services. The Appeal form should present any and all information related to the appeal for review by the RRC. Because the student will not be present for the appeal review, the written appeal and any additional documentation should be submitted all at once. Unless otherwise specifically requested by the RRC, information and arguments not presented by the student shall not be considered after the appeal is submitted. It is the student's responsibility to provide complete and timely responses to requests for information by the RRC. Failure to do so may result in a denial of the appeal. The RRC appeal decision will be sent by email. Requests for Waivers to the President or Designee A student, who has been denied reclassification following a timely appeal and final decision by the Residency Review Committee (RRC), may apply to the President for a waiver of the requirement(s) of the Residency Policy upon which the denial was based. Waivers are discretionary and reserved for those rare and unusual circumstances where in the judgment of the President (or designee) the student does not meet the criteria for in-state tuition billing status but an application of the requirement(s) would create an unjust result.", "The request to the President shall be in writing and set forth all facts and reasons the student believes supports the request; provided, however, matters not previously presented to the Residency Classification Evaluator and the RRC will not be considered. Requests for a Presidential Waiver may only be made in cases where the decision of the Residency Evaluator and Residency Review Committee are adverse to the student. The request for the Presidential Waiver must be received within ten (10) business days from the date of the decision of the RRC. A request for the Presidential Waiver can be emailed to Residency Reclassification Services at [resclass@umd.edu](mailto:resclass@umd.edu). The decision of the President's Designee will be sent by email and is considered final. If denied, the student must submit a new petition and all supporting documents for a future semester/term in which they are registered. Deferred Action for Childhood Arrivals (DACA) DACA students must complete the residency information form when they apply to UMD. Once admitted, students should submit either a copy of their Employment Authorization card (front and back) or a copy of their I-797. Students who hold DACA status for 12 consecutive months prior to the semester/term of their admission may be eligible to be classified as an in-state resident."]}