{"https://registrar.umd.edu/registration/special-populations/usm-inter-institutional": ["University of Maryland Office of the University Registrar USM Inter-Institutional Inter-Institutional enrollment is a program that allows eligible undergraduate and graduate students at University System of Maryland (USM) institutions to take selected courses at other USM campuses while paying tuition at their home institutions. This program gives students the opportunity to augment their degree programs at the University of Maryland, College Park (home institution). Students register for the courses at both their home and host institutions, but are billed only by their home institutions. USM institutions include: [Bowie State University](http://www.bowiestate.edu/)[Coppin State College](http://www.coppin.edu/)[Frostburg State University](http://www.frostburg.edu/)[Salisbury State University](http://www.salisbury.edu/)[Towson University](http://www.towson.edu/)[University of Baltimore](http://www.ubalt.edu/index.cfm)[University of Maryland, Baltimore](http://www.umaryland.edu/)[University of Maryland, Baltimore County](http://www.umbc.edu/)[University of Maryland, College Park](http://www.umd.edu/)[University of Maryland Eastern Shore](http://www.umes.edu/)[University of Maryland Global Campus](https://www.umgc.edu/)**University of Maryland, College Park undergraduate students are not eligible to register at the University of Maryland Global Campus through the inter-institutional concurrent registration program. Eligibility and Restrictions Registration for courses through the Inter-Institutional Enrollment program is on a space available basis. - Visiting students are expected to meet prerequisites or other criteria set by the host institutions. - Tuition and fees are paid at the home institution. - Students are responsible for paying the additional fees associated with certain courses (studio fees, lab fees, books, study materials, etc.). - Students are responsible for special permits, parking, and other fees at the host institution. - Students must comply with the host institutions registration periods and deadlines. - Continuing education courses cannot be taken through the inter-institutional registration program. - Undergraduate Students Students must have sophomore standing. - Students must be in good academic standing. - Students must be enrolled full-time in a degree program at the University of Maryland, College Park for the semester in which the course(s) are taken. Full-time status is defined as the combination of credits registered for at University of Maryland, College Park and the registered credits at the host institution. - Students must have the approval of their advising college for the course to count as resident credit. - Graduate Students Students must be enrolled in a degree-seeking program. - Students must have the approval of their Graduate Program Director for the course to count as resident credit. - Complete policy information on concurrent inter-institutional registration is available for [Graduate Students](https://www.usmd.edu/regents/bylaws/SectionIII/III241.pdf) and for [Undergraduate Students](https://www.usmd.edu/regents/bylaws/SectionIII/III240.pdf). Registration Procedures University of Maryland, College Park students visiting other University of Maryland System universities Students must read and abide by all policies and restrictions of the inter-institutional registration program. - Contact the department offering the course at the institution you plan to take the course to determine if special permission is needed. If so, you will need to obtain written permission. This can be in an email or on department letterhead. - Download the [Application for Inter-Institutional Enrollment](/sites/default/files/2023-03/iir-form.pdf) - Complete the form and obtain the required approvals and signatures. In the \"Registration Information\" section, the course information requested refers to the class you wish to take at the host institution. Please consult the Schedule of Classes of the host institution for this information. Undergraduate students must obtain approval from the Dean/Assistant Dean of Advising College. Graduate students must obtain approval from the Graduate Program Director. -", "Return the completed application to the University of Maryland Inter-Institutional Registration Coordinator located at [7999 Regents Drive, 1113 C.M. Mitchell Jr. Building](https://maps.umd.edu/map/index.html?&feature=building&name=052&basemap=detailed)for verification and final approval. A copy will be returned to you for your records. - The University of Maryland Inter-Institutional Registration Coordinator will process the registration at the University of Maryland, College Park and register you in placeholder courses at University of Maryland, College Park to reflect the number of credits you wish to take at the host institution. This is for billing and enrollment purposes only and does not guarantee course availability at the other institution. The Coordinator will return two copies of the form to you. You must take one copy to the Inter-Institutional Registration Coordinator at the host institution and keep a copy for your records. Registration will be according to the host institution's policies and deadlines. - If the course is cancelled, you want to change or drop the course, or you are unable to get approval to enroll, contact the University of Maryland Inter-Institutional Registration Coordinator immediately. You must not drop the course through Registration (Drop/Add) in Testudo. The University of Maryland Inter-Institutional Registration Coordinator will notify the host institution and make the appropriate changes. Failure to notify the University of Maryland Inter-Institutional Registration Coordinator could result in failing grades assigned to your record. - At the end of the semester, grades for inter-institutional course(s) are sent to the University of Maryland Office of the University Registrar by the visited institutions in the form of an official transcript. The Office of the University Registrar at the University of Maryland, College Park will post the grade(s) your record. These grades are entered on the students record and converted to the University of Maryland, College Park grading system. Inter-institutional course grades are used in the calculation of the cumulative grade point average. - Students from other University of Maryland System universities visiting University of Maryland, College Park Contact the Inter-Institutional Registration Coordinator at your home institution to complete required paperwork and obtain information on registration procedures. - Information on course permission or approval requirements is indicated on the individual course listings in the Schedule of Classes. Students must contact the instructor and department for permission. - Visiting students are registered on the first day of classes and will be notified by email confirming the registration. - If the course is cancelled, or if you want to change or drop the course, you must contact the Inter-Institutional Registration Coordinator of your home institution and the Inter-Institutional Registration Coordinator at the University of Maryland immediately. Failure to contact your the Inter-Institutional Registration Coordinators at both institutions could result in a failing grade assigned to your record. -"]}