{"https://registrar.umd.edu/registration/special-populations/golden-id": ["Golden ID The Golden ID program ([ policy VIII-2.30](https://www.usmd.edu/regents/bylaws/SectionVIII/VIII230.html)) allows eligible senior citizens to take advantage of the variety of courses offered at the University of Maryland. To be eligible for participation, individuals must be: 60 years of age or older - a legal resident of the State of Maryland - retired (not engaged in gainful employment for more than 20 hours a week) - How to Apply Applications must be submitted through the appropriate admission office. Undergraduate Programs If you are interested in a degree-seeking or non-degree seeking undergraduate program, you must apply through the Office of Undergraduate Admissions. Visit the [Office of Undergraduate Admissions](https://www.admissions.umd.edu/apply) for more information about the application process. The Office of Undergraduate Admissions can be contacted by: Phone: 301-314-8377 - Email: [applymaryland@umd.edu](mailto:applymaryland@umd.edu) - Graduate Programs If you are interested in a degree-seeking or non-degree seeking graduate program, you must apply through The Graduate School. Visit the [The Graduate School](https://gradschool.umd.edu/admissions/non-degree-admissions) for more information about the application process. The Graduate School can be contacted by: Phone: 301-405-3644 - Email: [gradschool@umd.edu](mailto:gradschool@umd.edu) - Tuition and Fees Golden ID students are responsible for paying the following fees: Application fee (graduate or undergraduate, as appropriate) - [Golden ID fee](https://billpay.umd.edu/undergraduate-tuition-and-fees)for each semester registeredGolden ID students who are enrolled at the university and are registered in a state-supported program will have their tuition automatically waived per [policy VIII-2.30](https://www.usmd.edu/regents/bylaws/SectionVIII/VIII230.html). How to Register Golden ID students can register via [Testudo](https://app.testudo.umd.edu/main/dropAdd)on a space available basis for a maximum of three courses. - Registration for fall and spring semesters starts on the third day of classes. - Students must meet all course prerequisite and co-requisite requirements. - For additional information or if you have questions, please email [registrar-help@umd.edu](mailto:registrar-help@umd.edu) with the subject line, Golden ID. Other Program Details The Golden ID offers eligible persons access to certain academic services, including the use of the libraries, as well as certain other non-academic services. Services are only available to those who have registered for one or more courses in the current term. - Golden ID students also have the opportunity to become involved with the Golden ID Student Association which provides cultural and social events, course recommendations, and peer advising. Please check your email near the start of each fall and spring semester for additional information. - Golden ID students are not eligible for Consortium courses or Continuing & Executive Education Programs. -"]}