{"https://registrar.umd.edu/registration/special-populations/dc-consortium": ["University of Maryland Office of the University Registrar | DC Consortium Eligible graduate and undergraduate students can benefit from this cooperative arrangement that is designed to permit the sharing of academic resources by member institutions. Students can enroll for courses that are not available at their home institutions to augment their program of study. Students enrolled for classes at participating consortium institutions through the consortium program can have the courses count as resident credits at their home institutions. Students pay their home institution for the courses they register for through the consortium program. Students are responsible for paying the host institution for additional fees associated with certain courses (e.g. studio fees, lab fees, books, and study materials). See [the Consortium website](https://consortium.org/programs-and-initiatives/academic-collaborations/cross-registration/) for more information, links to consortium schools, and the [Consortium Registration Form ](https://consortium.org/wp-content/uploads/2021/08/Fillable-Cross-Reg-Form.pdf). The Consortium of Universities of the Washington Metropolitan Area includes: [American University](http://www.american.edu/)[The Catholic University of America](http://www.cua.edu/)[Gallaudet University](http://www.gallaudet.edu/)[George Mason University](http://www.gmu.edu/)[The George Washington University](http://www.gwu.edu/)[Georgetown University](http://www.georgetown.edu/)[Howard University](http://www.howard.edu/)[Marymount University](http://www.marymount.edu/)[National Defense University](http://www.ndu.edu/)[National Intelligence University](http://ni-u.edu/wp/)[Trinity Washington University](http://www.trinitydc.edu/)[Uniformed Services University of the Health Sciences](https://www.usuhs.edu/)[The University of the District of Columbia](http://www.udc.edu/)[University of Maryland, College Park](http://www.umd.edu/)DC Consortium Registration Eligibility and Restrictions General Restrictions and Policies Golden ID students are not eligible to register for courses through the consortium program. - Faculty and staff tuition remission programs (including assistantships, fellowships, etc.) will cover the cost of courses registered through the consortium program. - The partial tuition waiver program for spouses and dependents of the University of Maryland will cover the costs for courses registered through the consortium program. - Students enrolled in the University of Maryland College Park courses with special fees (MBA, etc.) may be subject to additional tuition and fees rates when participating in Consortium courses. - Pass-Fail and Audit grading method options are not permitted for courses taken through the Consortium program. - University of Maryland course change deadlines apply to students visiting other Consortium institutions. - University of Maryland graduate students visiting other DC Consortium universities must observe the following guidelines: Students must be currently enrolled in a degree-seeking program. - Students must have the approval of their department chair or director. - Students cannot take more than 25% of course credits from other consortium universities. - Practical, internships, workshops, and similar experiential learning courses cannot be taken at other consortium universities. - Students can only register for courses through the consortium program if they are not offered at the University of Maryland. - University of Maryland undergraduate students visiting other DC Consortium universities must observe the following guidelines: Students must currently be enrolled in a degree-seeking program. - Students must be in junior standing (at least 60 credits). - Students can only register for courses through the consortium program if they are not offered at the University of Maryland. - Students must obtain approval from the Dean of their College if the consortium courses are taken during the last 30 credits. - Permission must be obtained from: Student's major department - The comparable University of Maryland department if the course is outside the major department - Assistant Dean or Dean of students College. - -", "Other DC Consortium university students visiting University of Maryland Students from other Consortium universities may register only for courses listed in the [Schedule of Classes](https://app.testudo.umd.edu/soc/)on a space available basis. Students will be registered on the first day of classes. - Participation is limited to credit-bearing courses. - Eligible students must meet all course pre-requisites and have properly completed the consortium registration through the Consortium Coordinator at their home institution. - Students are responsible to obtain the appropriate approval from the instructor and department through which the course is offered. - Visiting students are not eligible to register for: courses offered at off-campus locations (e.g. DC, Shady Grove) - instructional TV (ITV) courses - professional education courses - continuing education courses - BUSO and BMSO Smith School of Business Graduate Online Courses - - Registration Procedures University of Maryland students Read all policies and restrictions of the Consortium program. Students are responsible to abide by the policies and restrictions of the program. - Contact the department(s) offering the course(s) at the institution you plan to take the course(s) to determine if the course(s) is open to consortium students. If the course requires department permission, you will need to obtain written permission. This can be in an email or on department letterhead. - Pick up the Consortium Registration Form and the Consortium Registration Permission Form from the University of Maryland College Park Consortium Coordinator in [1113 C.M. Mitchell Jr. Building](https://maps.umd.edu/map/index.html?&feature=building&name=052&basemap=detailed). - Complete the forms and obtain the required approvals and signatures. Undergraduate students must obtain approval from the major department, the dean/assistant dean of the college, and comparable department (if course is outside of major). - Undergraduate students participating in ROTC programs must obtain approval from dean/assistant dean of the college. - Graduate students must obtain approval from the director of the graduate program in which they are enrolled - - Return the completed form to the University of Maryland Consortium Coordinator along with any written permission from the department of the institution you plan to visit. The University of Maryland Consortium Coordinator will process the registration at the University of Maryland and will send a copy of the form to the institution you plan to visit. A stamped copy of the registration form will be returned to you to be used as an identification card at the visited institution and to show to the instructor of the course as a confirmation of enrollment. - If the course is cancelled, or if you want to change or drop the course, contact the University of Maryland Consortium Coordinator immediately. You must NOT drop the course through Registration (Drop/Add) in Testudo. Students must follow the University of Maryland [registration deadlines](/node/80908). The University of Maryland Consortium Coordinator will notify the visited institution and make the appropriate changes. Failure to notify the University of Maryland Consortium Coordinator could result in failing grades assigned to your record. - At the end of the semester, grades for Consortium courses are sent to the University of Maryland Office of the Registrar by the visited institution. These grades are entered into the students record and converted into the University of Maryland College Park grading system. Consortium course grades are included in the calculation of the cumulative grade point average. - Other DC Consortium university students visiting University of Maryland Contact the Consortium Coordinator at your home institution to complete required paperwork. - For courses that require permission or approval (this information is indicated on the individual course listings in the Schedule of Classes), students must contact the instructor and department for permission. -", "The Consortium Coordinator at your home institution will work with the University of Maryland Consortium Coordinator to complete your course registration. Visiting students are registered on the first day of classes and will receive confirmation of their registration by email. Be sure to write your email address clearly so that you can be contacted. - If the course is cancelled, or if you want to change or drop the course, you must contact the Consortium Coordinator of your home institution immediately. The Consortium Coordinator of your home institution will notify the University of Maryland Consortium Coordinator and make the appropriate changes. Failure to contact your home institution Consortium Coordinator could result in a failing grade assigned to your record. -"]}