{"https://registrar.umd.edu/calendars/standard-registration-dates-deadlines": ["Standard Registration Dates & Deadlines Event| Date| Schedule of Classes available| Sep 15, 2023 (Fri)| Registration appointment and blocks availableStudents can view the day and time that they can first register and see any registration blocks they may have. This is not an appointment with an academic advisor or Office of the University Registrar but is the earliest time that a student can log into | Oct 6, 2023 (Fri)| Priority registration and graduate student registration beginsStudents in these populations can begin registering for Spring 2024. | Oct 26, 2023 (Thu)| Early registrationCurrently enrolled students can register for Spring 2024 on their scheduled day and time. | Oct 30, 2023 (Mon) - Dec 7, 2023 (Thu) | General registrationReturning students may make changes to their schedule by | Dec 8, 2023 (Fri) - Jan 23, 2024 (Tue) | Last day to cancel registrationLast day to drop all courses ( | Jan 23, 2024 (Tue)| First day of classesLate registration begins on the first day of classes. All students initiating registration for the semester on or after this date will be assessed a $20 late registration fee. | Jan 24, 2024 (Wed)| Schedule adjustment periodStudents can | Jan 24, 2024 (Wed) - Feb 6, 2024 (Tue) | Mandatory waitlist check-in periodStudents are required to check-in every business day to remain on the | Jan 24, 2024 (Wed) - Feb 7, 2024 (Wed) | Last day to drop a course with 100% refundFor students who want to drop individual courses, but remain registered (if you are dropping all courses, refer to withdraw from all courses deadlines). Refer to | Jan 30, 2024 (Tue)| Last day to apply for May 2024 graduation| Feb 6, 2024 (Tue)| Last day to drop a course with 80% refundFor students who want to drop individual courses, but remain registered (if you are dropping all courses, refer to withdraw from all courses deadlines). Refer to | Feb 6, 2024 (Tue)| Last day to Students may request a withdrawal from all classes at any time between the first and the last day of classes of the semester. | [withdraw from all courses](/registration/separating-university/withdraw)with 60% refundStudents may request a withdrawal from all classes at any time between the first and the last day of classes of the semester. [withdraw from all courses](/registration/separating-university/withdraw)with 40% refundStudents may request a withdrawal from all classes at any time between the first and the last day of classes of the semester. [withdraw from all courses](/registration/separating-university/withdraw)with 20% refundStudents may request a withdrawal from all classes at any time between the first and the last day of classes of the semester. Instructors are required to submit [mid-term grades](https://registrar.umd.edu/grades-records/grades/mid-term-grades)for certain undergraduate students by Mar 25, 2024. Mid-term grades are available to view in Testudo until final grades become available.Mar 24, 2024 (Sun) Last day for graduate students to drop a course, change course credit level and change grading method See [How to View Grades and GPA's](/grades-records/grades/how-to-view-grades-gpas)[withdraw from all courses](/registration/separating-university/withdraw)with 0% refundStudents may request a withdrawal from all classes at any time between the first and the last day of classes of the semester. May 17, 2024 (Fri) Official degree award date for the Spring 2024 semester [Commencement](https://commencement.umd.edu/)- Main ceremony[Commencement](https://commencement.umd.edu/)- College and department ceremoniesMay 22, 2024 (Wed) Degrees earned in the Spring 2024 semester appear on student records"]}