{"https://registrar.umd.edu/registration/separating-university/appeal": ["Undergraduate Contact: Records and Registration Services Graduate Contact: Graduate Degree Clearance Services | Appeal to Withdraw After Deadline Students are expected to withdraw from the semester according to the[ ](https://registrar.umd.edu/current/registration/withdraw.html)[policy and procedures outlined by the university](/node/140/). It is the students responsibility to know and adhere to all academic policies. In exceptional cases, a retroactive withdrawal may be granted based on documented requests in which extenuating circumstances significantly impaired the student's ability to complete the semester and officially withdraw by the established semester deadlines. Such circumstances include, but are not limited to, medical or psychological causes. The Office of the University Registrar will only review requests for a complete semester withdrawal impacting all courses. If the request concerns a single course, students should contact their [advising college](https://studentsuccess.umd.edu/academic-advising). Exceptions for retroactive withdrawals are granted only in the event of rare and extraordinary circumstances that were beyond a students control. The university does not make exceptions for poor judgement, poor performance, or forgetfulness. If your circumstances involve factors beyond your control, please follow the steps below to submit an Appeal for Special Exception. Steps to Submit an Appeal for Special Exception Fill out the [Appeal for Special Exception Form](/sites/default/files/2024-01/appeal-for-special-exception-form.pdf)and submit your completed and signed form to[registrar-appeals@umd.edu](mailto:registrar-appeals@umd.edu). - Review the [Appeals Checklist](/sites/default/files/2023-03/appeals-checklist.pdf)and begin gathering the supporting documentation you will need to submit. - Check your email to confirm receipt of your form from [registrar-appeals@umd.edu](mailto:registrar-appeals@umd.edu). This email will provide you with a link to your personal Box folder and instructions on how to use Box. The email will also contain information about the types of supporting documentation you will be required to submit. - Log into Box with your UMD login information. If you are not a current UMD student, you can register with Box for free. Your access will give you the ability to upload files related to your appeal and view materials to be submitted to the Appeals Committee; however, you will not have the ability to delete or edit once you complete the upload. - Complete the Appeals Checklist and check off the documentation you are submitting. Then, upload the checklist and your documentation to the Box folder. - After all of your required documents are uploaded, email [registrar-appeals@umd.edu](mailto:registrar-appeals@umd.edu)to indicate your submission is complete. - Review of your appeal will not begin until all required materials have been submitted. - A decision about your appeal will be emailed to the address you provided on your Appeal for Special Exception Form. - Your Appeal for Special Exception requires intensive review and may take three to four weeks for you to receive notification of a decision. The Office of the University Registrar is subject to University System of Maryland and State of Maryland Legislative audits, for which each appeal must be justified and have clear and substantiated documentation for each case."]}