{"https://registrar.umd.edu/registration/register-classes/enrollment-status": ["Undergraduate Contact: Records and Registration Services Graduate Contact: Graduate Degree Clearance Services | Enrollment Status The Office of the University Registrar is responsible for compliance with standards for full-time and half-time enrollment. Your financial aid, degree completion, and other university services depend on your enrollment status. Audited courses are not included in the calculation of credits for full-time status. On this page: Undergraduate Students Fall or Spring Semester Enrolled Credits| Enrollment Status| 12+| Full-time| 9 - 11| Three-quarter time/More than half-time| 6 - 10| Half-time| 1 - 5| Less than half-time| Undergraduate Agreements for Enrollment Status UMEI Program: Students enrolled in UMEI 001-004 are considered full-time students. Students enrolled in UMEI 005 (semi-intensive) must register for an additional 6-8 credits, appropriate to their program, to meet the full-time requirement. - ENCO/COOP: Students enrolled in Engineering Coop (ENCO099) and Cooperative Education (UNIV099) programs are considered full-time students. - [ADS Reduced Course Load Accommodations](https://counseling.umd.edu/ads/currentads): Eligible students can work with Accessibility & Disability Service (ADS) to request a reduction in course load to meet full-time status. If a student with a scholarship or grant falls below the required 12 credit hours, the scholarship or grant may be canceled. Students receiving financial aid are strongly encouraged to contact a financial aid counselor prior to dropping below full time status. Additional information may be obtained from the | Graduate Students The Graduate School uses a unit system in making calculations to determine full-time or part-time student status. Please note that graduate units are different from credit hours. The number of graduate units per credit hour is calculated in the following manner: Courses| Units per Credit Hour| 000-399| 2| 400-499| 4| 500-599| 5| 600-897| 6| 799 (Masters Research)| 12| 898 (Pre-candidacy Doctoral Research)| 18| HESP829| 18| 899 (Doctoral Dissertation Research)| 18| Fall or Spring Semester Enrolled Units| Enrollment Status| 48+| Full-time| 25 - 47| Three-quarter time/More than half-time| 24| Half-time| 1 - 23| Less than half-time| Graduate assistants holding regular appointments have full-time status if they are registered for at least 24 units in addition to the assistantship; holders of half-time assistantships are considered full-time if registered for 36 units. Courses taken with the grading method of Audit do not generate graduate units and will not be used in calculating full-time or part-time status. Fall, Winter, Spring, or Summer 12-week Term Enrolled Units| Enrollment Status| 36+| Full-time| 19 - 35| Three-quarter time/More than half-time| 18| Half-time| 1 - 17| Less than half-time| Graduate assistants holding regular appointments have full-time status if they are registered for at least 18 units in addition to the assistantship; holders of half-time assistantships are considered full-time if registered for 27 units. Courses taken with the grading method of Audit do not generate graduate units and will not be used in calculating full-time or part-time status. International Students International students on F-1 and J-1 student visas must maintain full-time status throughout each semester according to federal regulations governing F-1 and J-1 students. Please contact an advisor in International Student and Scholar Services at 301-314-7740 if you have any questions concerning full-time status. Undergraduate international students must be enrolled in at least 12 credit hours each fall and spring semester to be considered a full-time student. - Graduate international students must be enrolled in at least 48 units each fall and spring semester to be considered a full-time student (Note: 20-hour assistantships are equivalent to 24 units; 10-hour assistantships are equivalent to 12 units) - Courses taken for \"audit\" or \"incomplete\" do not generate credits/units and cannot be used in calculating full-time status. - Only one online course/distance education can count towards full-time enrollment. -", "If you will be part-time in a semester due to illness, academic difficulties, or because you are in your final semester, you must receive permission for part-time enrollment from International Student and Scholar Services before the end of the drop/add period for that semester. To request permission, log in to [iTerp](https://iterp.umd.edu/istart/controllers/start/StartEngine.cfm)and go to F-1 Student Services to complete the Part-Time Authorization e-form. Your academic advisor will need to confirm your part-time status. -"]}