{"https://registrar.umd.edu/registration/register-classes/seat-management-plan": ["Undergraduate Contact: Records and Registration Services Graduate Contact: Graduate Degree Clearance Services | Seat Management Plan The seat management plan is designed to reserve a portion of seats in general education and a few selected other courses for students with fewer than 60 credits and incoming new students. The seat management plan is only used in the fall and spring semesters. These courses are identified in the [Schedule of Classes](https://app.testudo.umd.edu/soc/) with a red asterisk next to the section. Courses on the seat management plan will have the open seats and restrictions updated throughout the early registration period and new student orientation. Students who are adding and dropping courses should review the [Schedule of Classes](https://app.testudo.umd.edu/soc/) to be aware of the current restriction on a course, which is available in the gray box at the end of the section listing. When using [Registration (Drop/Add)](https://app.testudo.umd.edu/main/dropAdd), students are notified before they drop a course if that course is on the seat management plan along with the current restriction on that course. Students who are changing sections, should review the FAQ below before processing any changes. Seat Management Plan FAQs You will have to drop the course and re-add the course with a different section number. When you select to drop the course, you will be shown a message about the current restriction on the course and required to confirm Are you sure you want to drop? As you make a decision, consider the following: If there is no restriction and seats are available, you will be able to re-add the course. - If you meet the restriction and seats are available, you will be able to re-add the course. - If you meet the restriction and seats are not available, you will be able to go on the hold file. - If you do not meet the restriction and seats are available, you will not be able to re-add the course and instead will have to select to go on the hold file. - Once you make your decision: Select NO if you want to keep the current section - Select YES if you want to drop the current section - You should review the [Schedule of Classes](https://app.testudo.umd.edu/soc/) first to see if there is a restriction and seats available. If there is no restriction and seats are available, you will be able to add the course. - If you meet the restriction and seats are available, you will be able to add the course. - If you meet the restriction and seats are not available, you will be able to go on the hold file. - If you do not meet the restriction and seats are available, you will not be able to add the course and instead will have to select to go on the hold file. - Only a small number of general education courses are restricted. Go to the [Schedule of Classes](https://app.testudo.umd.edu/soc/) and select the \"General Education Courses\" tab. Choose the category and term you would like to review and then \"Show All Sections\" to scan for courses that do not have a red asterisk. Your Academic Advising College has the authority to examine your situation and make an exception if appropriate. Contact your Academic Advising College for further information.", "If you do not meet the restrictions for the course, or all available seats are filled, you may place yourself on a hold file for the course. Waitlists are not initially offered for seat managed courses. On the first day of classes, seat management restrictions will end, and those students on the hold file will be eligible for any remaining seats in this course. Those students on the hold file for whom there are not open seats will be placed on a newly created waitlist. Students on the hold file must check-in on the first day of classes, and then daily, to remain on the waitlist. For more information, please see [Waitlist & Hold file](/node/145/)."]}