{"https://registrar.umd.edu/registration/register-classes/grading-method": ["Undergraduate Contact: Records and Registration Services Graduate Contact: Graduate Degree Clearance Services | Grading Method Grading method determines how a course will be reflected on the students permanent academic record and counted toward degree progress. Instructors do not have access to view a students grading method for a course and are expected to grade students without consideration for grading method. For each course, the academic department offering the course sets the default grading method to \"Regular\" or \"Satisfactory-Fail\" and determines which grading method options are available for each term. During registration, students may change the grading method for a course to an available option based on student eligibility and [registration deadlines](/node/80908) for the term. Students should be mindful of how grading method selections can impact their enrollment status (i.e. full-time or part-time) for a particular term. Options Regular: Students earn a letter grade (A - F) which will appear on the academic record and be included in a students GPA calculation. This option applies to undergraduate and graduate students. - Pass-Fail: This option may be selected if available to [eligible undergraduate students](https://academiccatalog.umd.edu/undergraduate/registration-academic-requirements-regulations/academic-records-regulations/#pass-fail-grading). Pass-Fail marks will appear on the academic record as follows:P is equivalent to a grade of C- or better and will not be included in a students GPA calculation - A letter grade of D+, D, D- or F will be included in a students GPA calculation - - Satisfactory-Fail: At the graduate level, Satisfactory-Fail is used for certain types of graduate study at the discretion of the graduate program. This grading method may also be an option for some undergraduate courses. Satisfactory-Fail marks will appear on the academic record as follows: S will not be included in the student's GPA calculation - F will be included in the student's GPA calculation - - Audit: This option may be selected if available. This grading method does not imply attendance or any other effort in the course. Audited courses are not included in the calculation of credits for enrollment status (full-time or part-time). Courses completed with this grading method will result in an AU on the student's academic record. Courses with a mark of AU will not be included in a students GPA calculation. This option applies to undergraduate and graduate students. - Other Resources: [ Policy III-6.20(A)](https://policies.umd.edu/academic-affairs/university-of-maryland-grading-symbols-and-notations-used-on-academic-transcripts). Grading Method FAQs The department offering the course determines which options are available for each term. The options available are published in the [Schedule of Classes](https://app.testudo.umd.edu/soc/). Undergraduate students should see [Pass-Fail Grading](/node/215/) for additional information. Graduate students are not eligible for Pass-Fail grading method."]}