{"https://registrar.umd.edu/registration/register-classes/final-exams": ["Course & Classroom Scheduling Services Final Exams Standard & Common Final Exam Schedules University guidelines state that there will be a final examination and/or assessment in every undergraduate course. Most courses follow a standard or common final exam schedule. Standard final exams are based on when the course is scheduled to meet. Common final exams are course specific, and the final exam for all sections of a course are given at the same day and time. Example for Standard Final ExamsCourses meet MWF/MW/M/W/F from 8 - 8:45 a.m.  final exam is Saturday, May 13, 10:30 a.m. - 12:30 p.m. - - Example for Common Final ExamsAll sections of BMGT220  final exam is Saturday, May 13, 4 - 6 p.m. - - Review final exam guidelines in the [ Academic Catalog](https://academiccatalog.umd.edu/undergraduate/registration-academic-requirements-regulations/academic-records-regulations/#absences-assessment-attendance-syllabus). Final Exams for Classes at 6 p.m. and Later Exams for classes beginning at 6 p.m. and later are given on the same day and at the same time that the class normally meets during the semester. For example, a class that meets Tuesday at 6 p.m. will have its exam on Tuesday of the exam week at 6 p.m.; a class that meets Thursday at 6 p.m. will have its exam on Thursday of the exam week at 6 p.m. Final examinations for classes that meet more than once a week will be held on the exam day corresponding to the first day of the week that the class meets; for example, a class that meets T/Th at 6 p.m. will have its exam on Tuesday of the exam week at 6 p.m. Exams will generally be given in regularly scheduled classrooms. The department will notify faculty of any exceptions. 3+ Examinations on a Single Day Students may seek to reschedule final examinations so that they have no more than three examinations on any given day. It is the responsibility of the student to initiate the rescheduling or be responsible for taking the examination as originally scheduled. When rescheduling is desired, students should first contact their instructors. Students who encounter difficulty rescheduling examinations with their instructors are advised to contact the dean's office of their academic program for help. Faculty members are expected to accommodate students with legitimate rescheduling requests."]}