{"https://registrar.umd.edu/registration/register-classes/blocks-special-permissions-exceptions-policy": ["Undergraduate Contact: Records and Registration Services Graduate Contact: Graduate Degree Clearance Services | Blocks, Special Permissions, & Exceptions to Policy Students may encounter a registration block that prevents them from registering for classes. Some blocks may be viewed prior to registration, while other blocks are only displayed when adding classes during registration. These blocks, special permissions, and exceptions to policy are listed below with details about what each block means and who to contact to resolve the block. Many of these blocks, special permissions, and exceptions to policies can be cleared with permission of the appropriate department (processed in the form of an electronic stamp) which allows students to register using Testudo Registration (Drop/Add). On this page: Registration Blocks Registration blocks can be viewed prior to registration on Testudo. Using the Appointment and Registration Status app, you can view all registration blocks at one time. All registration blocks must be cleared before you can register for classes. Block Type| What does it mean?| Who should you contact?| Academic dismissal - needs advising| You are on academic dismissal and require special permission for all registration requests.| | [Academic advising college](https://studentsuccess.umd.edu/academic-advising)[registrar-help@umd.edu](mailto:registrar-help@umd.edu)301-314-8240 [registrar-help@umd.edu](mailto:registrar-help@umd.edu)301-314-8240 [Academic advising college](https://studentsuccess.umd.edu/academic-advising)[Student Financial Services & Cashiering](https://billpay.umd.edu/)[billtalk@umd.edu](mailto:billtalk@umd.edu)301-314-9000 [studentconduct@umd.edu](mailto:studentconduct@umd.edu)301-314-8204 [Academic advising college](https://studentsuccess.umd.edu/academic-advising)OR If you would like to remain in Letters and Sciences, submit an [Exception to Academic Policy](https://ltsc.umd.edu/exceptionpolicy)request.[Academic advising college](https://studentsuccess.umd.edu/academic-advising)to see if you may be eligible for an exception which will allow you to register using TestudoOR Register in person with the Office of the University Registrar. Your registration must include a course that meets this requirement. [Academic advising college](https://studentsuccess.umd.edu/academic-advising)to see if you may be eligible for an exception which will allow you to register using TestudoOR Register in person with the Office of the University Registrar. Your registration must include a course that meets this requirement. [Office of Student Orientation and Transition](https://orientation.umd.edu/)[immunization policy](https://policies.umd.edu/student-affairs/university-of-maryland-college-park-immunization-policy).[University Health Center](https://health.umd.edu/medical-behavioral-health/immunizations)Some students may also see the following registration blocks when accessing Testudo Registration (Drop/Add). Block Type| What does it mean?| Who should you contact?| Student has made too many registration transactions.| Students have a limited number of drop/add transactions that can be processed, and you have exceeded the maximum number that can be processed on Testudo.| Office of the University Registrar301-314-8240 | Student last attended in...| As an undergraduate student, you have taken a break in enrollment (not registered during the previous fall or spring semester).| | [gradschool@umd.edu](mailto:gradschool@umd.edu)301-405-3644 Special Permissions & Exceptions to Policy Blocks Special Permissions blocks are applied to courses that require permission from the academic department offering the course to register. In such cases, students will need to contact the academic department directly to register for the course. Exceptions to Policy blocks are student-specific and require students to submit an Exception to Policy request to their advising college to register for the course. When applicable, these blocks will display when accessing Testudo Registration (Drop/Add). Block Type| What does it mean?| What should you do?| By Permission Only - appear in Schedule of Classes as: (Perm Req)|", "You need permission from the department to register for the course. This permission is required for all students.| Contact the department offering the course.| Changes after schedule adjustment period| You are attempting to add, drop, or make a change to grading method or credit level after the academic deadline.| To request an exception to make a change to the course, submit an exception to policy request following your |"]}