{"https://registrar.umd.edu/grades-records/student-information/university-id-cards": ["Constituent Relations Services | University ID Cards On this page: Purpose The University of Maryland photo identification (ID) card provides a general form of identification issued solely for the purpose of accessing programs and services administered by the University of Maryland, College Park, and its legal agents. Authority to issue ID cards is delegated solely to the Office of the University Registrar. Eligibility Students: To receive a student ID card, students must be registered for classes for the current or upcoming semester. Faculty/Staff: To receive a Faculty/Staff ID card, the employee must have an approved employment appointment in the PHR system. Faculty and staff members may receive their Faculty/Staff ID card on their official start date or afterwards, but not prior to the start date listed in their payroll appointment. Faculty/Staff wishing to confirm eligibility may call the Office of the University Registrar at 301-314-8240. At the discretion of the university, ID cards may be issued to other individuals who are \"affiliated\" with the university provided such affiliates are sponsored by a regular university department or office and entered in the PHR system as so. Please note: The university reserves the right to confiscate any ID used in an inappropriate manner. Validity The validity of the photo ID card is based on current information contained in the student's enrollment record or, in the case of employees, the person's personnel record. The magnetic strip on the ID contains a link to the appropriate record for validation purposes. Appearance The appearance of the ID card may change from time to time, but includes, at a minimum: name, relationship to the university (e.g. student, faculty/staff, affiliate), university identification number and issue date. Photo ID cards are issued to regular students, faculty/staff and affiliates. Students participating in special programs are eligible for non-photo ID cards. These non-photo IDs must be used in conjunction with a photo ID such as a driver's license or passport. Access to Programs and Services Students and employees have access to university programs and services as defined by university policies and procedures. Students may use their ID cards to: Obtain transcripts, verifications, schedule printouts, and graduation tickets - Access campus buildings such as residence halls and some classroom buildings - Access library and information services and as a photo copy card - Use your Dining Services meal plan points at campus dining halls and area eateries - Serve as your Terrapin Express debit card for on-campus eateries and retailers - Obtain athletic tickets (using the barcode on the reverse of your card) - Access campus recreational facilities - Gain admission to campus sponsored events - Ride the university's shuttle bus - Receive discounts at some area vendors - Access to programs and services by \"affiliate\" card holders must be negotiated on a case-by-case basis by the sponsoring department. Duration The photo ID card is issued at the time a student first registers for classes or, in the case of employees, at the initial hiring. The ID card should be carried at all times and is intended to serve an individual throughout their affiliation with the university. Replacement", "There is a $20 charge for a replacement ID card in cases where the card is lost, stolen, has intentional damage (holes punched in the card, snapped in two, etc.), or the cardholder wishes to retake their photo. The replacement fee is waived in cases where the replacement is due to normal wear and tear (i.e. the bar code is no longer visible or the magnetic strip is non-functioning). The replacement fee can only be waived if the most recently issued ID card is given to an Office of the University Registrar staff member upon request of a replacement ID card. A replacement ID card can be obtained from the Office of the University Registrar Front Counter, First Floor, Mitchell Building, Monday - Friday, 8 a.m. - 5 p.m. Deactivating a Lost or Stolen ID Card It is the responsibility of the cardholder to keep their ID card safe and secure and to deactivate a lost or stolen ID card. You should immediately [deactivate your ID card](https://idcard.umd.edu/) to prevent use by unauthorized individuals. The university assumes no responsibility for misuse of your card, or for charges to your accounts due to your ID card being lost or stolen. Once deactivated, you must obtain a new ID card at the Office of the University Registrar Front Counter, First Floor, Mitchell Building. The charge for a new ID card is $20. A deactivated ID card cannot be reactivated. The following service will be suspended until a new ID card is issued: Access to Administrative Buildings and Offices - Access to Residential Facilities (including residence halls, South Campus Commons, and on-campus Greek chapter houses) - Dining Services and Terrapin Express - Facilities Management Services - Time and Attendance System - University Recreation and Wellness -"]}