{"https://registrar.umd.edu/veterans-benefits/veteran-military-student-resources": ["Veteran Certifications Services | Veteran & Military Student Resources On this page: On-Campus Resources As a student veteran at the University of Maryland College Park, there are several services and benefits beyond VA Education Benefits that you may find valuable. Here are some options to consider: [Veteran Student Life:](https://stamp.umd.edu/engagement/veteran_student_life/about_veteran_student_life)Through Veteran Student Life, the university offers a hub for resources that serves veterans and military-connected students, staff, and faculty on campus.[University of Maryland Veterans Center:](https://stamp.umd.edu/VetCenter)The University of Maryland has a dedicated Veterans Center. This space is exclusively available to student veterans. To gain access, please submit the[Veterans Center Access Request form](https://stamp.umd.edu/VetCenter)along with supporting documentation.Academic Support: The university offers various academic support services to help students succeed in their studies. Take advantage of these resources to excel academically: - [Counseling and Mental Health Services:](https://stamp.umd.edu/engagement/veteran_student_life/resources/counseling)Transitioning to college life can be challenging, and it's important to prioritize your mental well-being. The university offers counseling and mental health services for students.[Accessibility & Disability Service:](https://counseling.umd.edu/ads)Students with a service-connected disability or who require accommodations, can obtain assistance through Accessibility and Disability Service. They work with students to provide necessary accommodations, facilitate communication with faculty, and ensure equal access to educational opportunities.[Career Center:](https://careers.umd.edu/)The University Career Center & The President's Promise offers career counseling, resume reviews, job fairs, and other resources to students.[Priority Registration:](https://academiccatalog.umd.edu/undergraduate/registration-academic-requirements-regulations/registration/#veterans-benefits)Eligible service members of the United States Armed Forces are entitled to priority registration at the University of Maryland. Any veteran or active duty student using VA Education Benefits will automatically be identified as eligible for priority registration, however for those not using benefits, qualifying students should submit proof of eligibility (i.e. military ID card, DD-214, or certificate of satisfactory completion of military service) to: Veterans Certification Services at[vabenefits@umd.edu](mailto:vabenefits@umd.edu)or through[Secure Share](https://secureshare.umd.edu/filedrop/vabenefits@umd.edu).[Credits for Prior Learning](/node/109)for Basic Military Training (BMT)[Mandatory Health Insurance and Waiver:](https://health.umd.edu/mandatory-insurance)Students are required to waive required health insurance or enroll in SHIP.Each academic year, undergraduate students meeting specific criteria must either enroll in or waive the Student Health Insurance Plan (SHIP). - The Waiver/Enrollment process for the 2023-2024 academic year will open June 15. - [Third Party Billing:](https://billpay.umd.edu/tuition-billing/third-partysponsored-billing)Third Party/Sponsored Billing is when a private or government agency is paying any portion of your tuition or fees and they are requesting a direct bill from the university. This includes:MD State Tuition Waiver - Tuition Assistance -", "[Financial Aid:](https://financialaid.umd.edu/resources-policies/veterans-military-connected-students)Students can use financial aid in combination with the Post-9/11 GI Bill. It is important to note that scholarships designated exclusively to offset tuition and fees must be deducted from the amount submitted to the VA for payment. This does not include scholarships intended to cover other (non-tuition and fees) costs as well.[Apply for AID Now (FAFSA)](https://studentaid.gov/h/apply-for-aid/fafsa)[Types of Aid](https://financialaid.umd.edu/types-aid)[Scholarship Search:](https://financialaid.umd.edu/resources-policies/scholarship-search)Scholarship Universe allows students to look for all types of scholarships. Some known veteran and military connected awards are listed below:[Student Financial Services Center:](https://billpay.umd.edu/)Students can see their bill to determine what will not be covered by the VA and make payment for it through the Student Financial Services Center.Make monthly payments over the course of the semester through the [Terp Payment Plan](https://billpay.umd.edu/TPP) - Set Up [Direct Deposit](https://billpay.umd.edu/refunds)for refunds - Make monthly payments over the course of the semester through the - [Residency Reclassification Services:](/node/97)Residency Reclassification Services can evaluate a students residency status after admission if information has changed since application. Students should review their residency status and the various residency exceptions that may be available.If you have a question about your residency status or eligibility for [Residency Exemptions](/node/174)please contact[resclass@umd.edu](mailto:resclass@umd.edu). - If you have a question about your residency status or eligibility for - [Yellow Ribbon Program at UMD:](https://financialaid.umd.edu/resources-policies-veterans/yellow-ribbon-program)Post 9/11 GI Bill students who do not qualify for in-state residency or a[residency exemption](/node/174/)may be eligible to take advantage of the Yellow Ribbon Program.Off-Campus Resources In addition to university-specific services, there are various federal and regional resources students can explore: [Department of Veteran Affairs:](https://www.va.gov/education/)VA education benefits help Veterans, service members, and their qualified family members with needs like paying college tuition, finding the right school or training program, and getting career counseling. Learn how to apply for and manage VA education and training benefits.About VA education and training benefits - How to apply for VA education and training benefits - Edith Nourse Rogers Science Technology Engineering Math (STEM) Scholarship - [GI Bill Comparison Tool](https://www.va.gov/education/gi-bill-comparison-tool/)The federal [Vet Center Program](http://www.vetcenter.va.gov/)helps veterans and their families work toward post-war adjustment. - The [Veterans Integration Transition to Academic Leadership (VITAL)](https://www.mentalhealth.va.gov/student-veteran/services.asp)program is offered through the VA. VITAL sites offer a range of mental health and supportive services on or near a campus. The VA provides a website which may be used to[locate the closest VITAL location](https://www.mentalhealth.va.gov/student-veteran/vital-program-sites.asp). - [Maryland Higher Education Commission (MHEC)](https://mhec.maryland.gov/institutions_training/Pages/acadaff/veteransbenefits/index.aspx)offers state-specific program and benefit information for veteransThe [Maryland Department of Veterans Affairs (MDVA)](https://veterans.maryland.gov/)was created with the mission of assisting veterans, active duty service members, their families and dependents, in securing benefits earned through military service. See the[MDVA Quick Reference Guide](https://veterans.maryland.gov/wp-content/uploads/sites/2/2021/06/2021-MDVA-Quick-Ref-Guide.pdf). -", "[Vets 4 Warriors](http://www.vets4warriors.com/)is a 24/7 confidential, anonymous peer support line. You can call, email, or live chat.[Make the Connection](http://maketheconnection.net/)offers peer support for veterans as well as self-assessment resources for signs of depression, PTSD, and substance abuse.[Adjustments After Deployment](https://www.health.mil/Military-Health-Topics/Mental-Health/Mental-Health-Topics/Adjustments-After-Deployment)has information and resources on many topics relating to wellness for the military community.[Veterans Service Organizations (VSOs):](https://www.ebenefits.va.gov/ebenefits/vso-search)Many VSOs advocate for the well-being of the veteran community and will assist with applications for veterans benefits and appeals. The Department of Veterans Affairs maintains a[directory of veterans' service organizations](https://www.va.gov/vso/).[Veterans Crisis Line](https://www.veteranscrisisline.net/)offers 24/7, confidential crisis support for veterans and their loved ones. Dial 988 then Press 1 or text 838255.GI Bill is a registered trademark of the U.S. Department of Veterans Affairs (VA). More information about education benefits offered by VA is available at the [official U.S. government website](http://www.benefits.va.gov/gibill)."]}