{"https://registrar.umd.edu/grades-records/ferpa-confidentiality/parent-guardian-access": ["Records & Registration Services | Parent/Guardian Access Get Shared Access to Your Student's Information The University of Maryland adheres to a policy of compliance with the [Family Educational Rights and Privacy Act](/node/220/) (Buckley Amendment). It is the policy of the university to limit disclosure of personally identifiable information from educational records without the student's prior consent. Students can grant parents and/or legal guardians limited access to their student information. Access must be renewed annually; information includes: current course schedule, mid-semester grades, and final grades. For information about how to access student financial records, visit [Student Financial Services and Cashiering](https://billpay.umd.edu/parents). On this page: Need Access? The University of Maryland has implemented an enhanced system to provide a more secure means for parents/guardians to access student information online. Parents/guardians who wish to access their student's academic records must do so using a UMD account. Please follow the 3 step process below. Parents/Guardians must complete an [Associate Account Registration](https://identity.umd.edu/id/associate/registration). For detailed instructions, see[Create an Associate Account](/sites/default/files/2023-03/create-associate-account.pdf).University of Maryland faculty and staff may use their current employee Directory ID and do not need to create an Associate Account. - - After an account is created, students may grant access via [Testudo](http://www.testudo.umd.edu/). For detailed instructions, see[Grant Parent and/or Guardian Access](/sites/default/files/2023-03/grant-access.pdf). - After access is granted, parents/guardians may use their newly created Directory ID and password to login and view their student's information (see the Already Have Access tab). - Already Have Access? See the quick links below if your student has already granted you access to their account in Testudo. Remember that access must be renewed by your student annually. Need Additional Help? If students would like to provide their parent/guardian access to information that the Office of the University Registrar manages that are not covered by the Testudo Parent Access, the student can fill out the [Authorization to Disclose Education Records ](/sites/default/files/2023-03/our-authorization-to-disclose-education-records.pdf) to provide parent/guardian access to records associated with: Registration - Grades - Transfer Credit - Residency - Graduation - Veteran/Active Duty - Student Account - understanding tuition and fee charges on the account -"]}