{"https://registrar.umd.edu/registration/register-classes/steps-register": ["Undergraduate Contact: Records and Registration Services Graduate Contact: Graduate Degree Clearance Services | Steps to Register Outlined below are the steps required to register for courses in a given semester. Review this information carefully to ensure a successful registration process. On this page: Undergraduate Students Current Undergraduate Students: Currently enrolled undergraduate students receive a notification email with information about early registration and a link to check their registration appointment time and registration blocks. Registration appointments for the fall semester are scheduled from late March through early May, and appointments for the spring semester are scheduled from late October through early December. Students may register at their scheduled registration appointment time or any time thereafter. See steps below for more information about how to register. - If you are a degree candidate you will not receive an appointment email. If you wish to register for the next semester, call 301-314-8240 to request an appointment. - New-Degree Seeking Undergraduate Students: Newly admitted undergraduate degree-seeking students must attend a [New Student Orientation Program](http://www.orientation.umd.edu/) to register for classes. During orientation, students will meet with their academic college and/or department advisor for guidance on registration. Non-Degree Seeking Undergraduate Students: Non-degree seeking undergraduate students may register on the first day of classes in their initial semester. Registration appointments will be assigned for subsequent semesters and can be viewed on [Testudo](http://testudo.umd.edu). For registration information about Summer session, Winter session, Freshmen Connection, and Professional Programs, visit | Check [Appointment and Registration Status](https://app.testudo.umd.edu/main/regAppt)to see the day and time you can first register and view any registration blocks that need to be resolved before you can register. Using the Appointment and Registration Status app, you can view all registration blocks at one time. Whereas, if you wait until you register, the Registration (Drop/Add) app only displays one block at a time, which must be cleared to continue registration. - Review your [degree audit](https://app.testudo.umd.edu/main/profile)to stay on track for graduation. This audit will also help you identify possible courses for registration. - View the [Schedule of Classes](https://app.testudo.umd.edu/soc/)for course offerings for the term. For each course, you will see prior semesters' course syllabi, seat availability, location, book lists, course description, grading method options, restrictions, and prerequisites. Utilize the look-up and filter options to find the courses you want or need. - Build a course schedule using [Venus Course Scheduler](https://venus.umd.edu/). Enter the courses of your choice and the app will generate various schedules from which you can select. - Check the [Final Exam Schedule](/node/149/)to assist with course selection and help plan ahead for the end of the semester. - Update your address and emergency contact using [My Profile](https://app.testudo.umd.edu/main/profile)to provide the university with your most up-to-date contact information. - Undergraduate students should visit the [TerpEngage Student Portal](https://amp.umd.edu/terpengage/student-resources)to schedule an advising appointment. - After you view your registration blocks, take action to resolve all issues. All blocks must be cleared before you can register. See [Blocks, Special Permissions, and Exceptions to Policy](/node/144/)for a complete list of student registration blocks and how to resolve them. - As you view the schedule of classes, take note of which courses require permission from the department offering the course to register. These are noted as \"(Perm Req)\" in the schedule of classes. You must contact the department offering the course to request permission. -", "Additionally, you may need special permission or an exception to policy to register for a course. See [Blocks, Special Permissions, and Exceptions to Policy](/node/144/)for a complete list of special permissions and exceptions to policy. - Online: Go To Testudo [Registration (Drop/Add)](https://app.testudo.umd.edu/main/dropAdd)to complete your registration. Once logged in, Registration (Drop/Add) instructions can be found in the upper right side. - In-person: Complete a registration request form at the Office of the University Registrar, Front Counter Services, located in the Clarence M. Mitchell, Jr. Building, first floor lobby. - Students who are unable to complete registration using [Testudo](http://testudo.umd.edu) or in-person should contact the Office of the University Registrar at [registrar-help@umd.edu](mailto:registrar-help@umd.edu) to request assistance. Late registration begins on the first day of classes. All students initiating registration for the semester on or after this date will be assessed a $20 late registration fee.| Visit Testudo to: View your [Student Schedule](https://app.testudo.umd.edu/main/schedule)(which includes your book list) - Complete [Waitlist Check-in](https://app.testudo.umd.edu/main/waitlistCheckin)(read the[waitlist and hold file requirements](/node/145/)) - - View your - Review the [academic dates and deadlines](/node/80908/)for the term - Review and understand the guidelines to [add and drop classes](/node/143/) - Pay your bill and visit [Student Financial Services and Cashiering](https://billpay.umd.edu/)to learn more about your student account - Review the Office of Undergraduate Studies [Course-Related Policies and Resources for Undergraduate Students](https://www.ugst.umd.edu/courserelatedpolicies.html) - Graduate Students Current Graduate Students: Currently enrolled graduate students receive a notification email with information about early registration. Graduate students do not need an assigned registration time, but should check registration blocks. Registration for the fall semester begins late March, and for the spring semester, begins late October. Students in Masters/Doctoral thesis/dissertation programs should consult with their program coordinators to verify enrollment in their assigned candidacy and pre-candidacy courses. See [The Graduate School Registration Policies](https://academiccatalog.umd.edu/graduate/policies/). - See steps below for more information about how to register. - New Graduate Students: Newly admitted graduate students should contact the appropriate academic department for information about the departmental orientation and registration process. Advanced Special Students: Newly admitted Advanced Special Students (or non-degree seeking students) should contact the Graduate School for advising at [gradschool@umd.edu](mailto:gradschool@umd.edu). For registration information about Summer session, Winter session, Freshmen Connection, and Professional Programs, visit | Check [Appointment and Registration Status](https://app.testudo.umd.edu/main/regAppt)to view any registration blocks that need to be resolved before you can register. This application allows you to view all registration blocks at one time. If you wait until you register, the Registration (Drop/Add) app only displays one block at a time which must be cleared to continue registration. - Review your [degree audit](https://uachieve.umd.edu/)to stay on track for graduation and help you identify possible courses for registration[.](https://uachieve.umd.edu/) - View the [Schedule of Classes](https://app.testudo.umd.edu/soc/)for course offerings for the term. For each course, you will see prior semesters' course syllabi, seat availability, location, book lists, course description, grading method options, restrictions and prerequisites. Utilize the look-up and filter options to find the courses you want or need. -", "Update your address and emergency contact using [My Profile](https://app.testudo.umd.edu/main/profile)to provide the university with your most up-to-date contact information. - Masters thesis/Doctoral dissertation program students should consult with your program coordinator to ensure enrollment in your assigned thesis research, pre-candidacy, or dissertation research course. - After you view your registration blocks, take action to resolve all issues. All registration blocks must be cleared before you can register. See [Blocks, Special Permissions, and Exceptions to Policy](/node/144/)for a complete list of student registration blocks and how to resolve them. - As you view the schedule of classes, note which courses require permission from the department offering the course to register. These are noted as \"Perm Req\" in the schedule of classes. You must contact the department offering the course to request permission. - Additionally, you may need special permission or an exception to policy to register for a course. See [Blocks, Special Permissions, and Exceptions to Policy](/node/144/)for a complete list of special permissions and exceptions to policy. - Go to Testudo [Registration (Drop/Add](https://app.testudo.umd.edu/main/dropAdd)) to complete your registration. Once logged in, Registration (Drop/Add) instructions can be found in the upper right side. Students who are unable to complete registration using [Testudo](http://testudo.umd.edu/) should contact the Office of the University Registrar at [registrar-graduate@umd.edu](mailto:registrar-graduate@umd.edu) to request assistance. Late registration begins on the first day of classes. All students initiating registration for the semester on or after this date will be assessed a $20 late registration fee.| View your [Student Schedule](https://app.testudo.umd.edu/main/schedule)(which includes your book list) - Review the [academic dates and deadlines](/node/80908/)for the term - Understand the guidelines to [add and drop classes](/node/143/) - Pay your bill and visit [Student Financial Services and Cashiering](https://billpay.umd.edu/)to learn more about your student account - Review the [Graduate School Catalog Course-Related Policies and Resources for Graduate Students](https://gradschool.umd.edu/faculty-and-staff/course-related-policies) -"]}