{"https://registrar.umd.edu/grades-records/student-information/change-personal-information": ["Constituent Relations Services | Change of Personal Information Students can use [My Profile in Testudo](https://app.testudo.umd.edu/#/main/profile) to update address, phone numbers, emergency contact information, and gender marker since supporting documentation is not required. To learn more about changing your gender marker, refer to [Gender Marker FAQs](/node/86456). To update other personal information, submit the appropriate form and documentation to the Office of the University Registrar. Each type of change request requires supporting documentation, one of which must include a photograph of the student (driver's license, UMD ID card, or passport). Submitting any change request form without the required supporting documentation will result in processing delays. Students can also process these changes in-person by visiting the Office of the University Registrar Front Counter on the First Floor of the Clarence M. Mitchell, Jr. Building. The forms will be available for you to fill out, but make sure to bring paper copies of the official documents. Pictures of documents on a device will not be accepted.| On this page: Name Change or Correction Requests for name changes must be submitted to the Office of the University Registrar. At UMD, your \"primary name\" and \"legal name\" are different. Your primary name is the name by which you are generally known. It appears on university identification cards, class rosters, student directory and various student campus systems. - Your legal name appears on government-issued identity documents such as a passport. At UMD, your legal name must appear on official transcripts, financial aid documents, payroll documents, and other places where a legal name is required by law or university policy. - Unless you specify otherwise, your default primary name is your legal name. If your primary name and legal name are the same and need to be changed or corrected: Complete the [Name/DOB Change Request](/sites/default/files/2023-03/name-ssn-dob-change-form.pdf). - Provide two types of supporting documents with the correct name, one of which must contain a photograph:Drivers license - Passport - Court-issued document - Birth certificate - Marriage certificate - - Submit request and supporting documentation through our [Secure File Upload](/node/219#secure-upload). - If your primary name and legal name are not the same and need to be changed or corrected: Complete the [Primary Name Change Request](https://drupal-base-s3-drupalshareds3-1qwpjwcnqwwsr.s3.amazonaws.com/lgbt/s3fs-public/Primary%20Name%20Change.pdf). - Provide two types of supporting documents with your legal name, one of which must contain a photograph:Drivers license - Passport - Court-issued document - Birth certificate - - Submit request and supporting documentation through our [Secure File Upload](/node/219#secure-upload). - Date of Birth Correction Requests to correct your date of birth should be submitted to the Office of the University Registrar. Complete the [Name Change/DOB correction Request](/sites/default/files/2023-03/name-ssn-dob-change-form.pdf). - Provide supporting documents with the correct date of birth, one of which must contain a photograph:Drivers license - Passport - Birth certificate - - Submit request and supporting documentation through our [Secure File Upload](/node/219#secure-upload). - Social Security Number Correction Requests for social security number (SSN) changes must be submitted to the Office of the University Registrar. Complete the [Social Security Number Change Request](/sites/default/files/2023-03/name-ssn-dob-change-form.pdf). - Provide a copy of your Social Security card and a government-issued document with photograph. - Submit request and supporting documents through our [Secure File Upload](/node/219#secure-upload). - Secure File Upload Use this tool to securely upload your documentation for change of personal information requests to the Office of the University Registrar.", "Box is a secure, cloud-based storage and collaboration service supported by the Division of Information Technology. View the [UMD Box article](https://umd.service-now.com/itsupport?id=service&table=u_service_offering_portal_content&sys_id=c42dd5141b76c110642d5287624bcb12) for additional information."]}