{"https://registrar.umd.edu/grades-records/ferpa-confidentiality/student-privacy-ferpa": ["Constituent Relations Services | Student Privacy (FERPA) The Family Educational Rights and Privacy Act (FERPA) is a federal law that protects a students privacy interest in their education records. FERPA provides that educational institutions, such as postsecondary institutions, may disclose education records, or personally identifiable information from such records, only if an eligible student has provided prior written consent, except in several specified circumstances [ policy III-6.30(A)](https://policies.umd.edu/academic-affairs/university-of-maryland-policy-and-procedures-on-the-disclosure-of-student-education-records). The University of Maryland adheres to the policy of compliance with the Family Educational Rights and Privacy Act (FERPA): To permit students to inspect their educational records. - To limit disclosure to others of personally identifiable information from an education record without the student's prior written consent. - To provide students the opportunity to seek correction of their educational records where appropriate. Prior consent will not be required for disclosure of an educational record to school officials of the University of Maryland who have been determined to have legitimate educational interests. - Certain information has been designated \"Directory Information\" and will be disclosed without prior consent unless a student files written notice. Directory information includes, but is not limited to: name, address, telephone, email, date and place of birth, major field of study, full-time/part-time status, participation in officially recognized activities and sports, weight and height of members of athletic teams, dates of attendance, degrees and awards received, most recent previous educational agency or institution attended. - - Students who wish to limit the disclosure of Directory Information or wish access to their official records should obtain the appropriate form, fill it out, and return it to the Office of the University Registrar Front Counter Services, Clarence M. Mitchell, Jr. Building, first floor. Students alleging university noncompliance with the Family Educational Rights and Privacy Act may file a written complaint with the Family Policy Compliance Office, United States Department of Education, 400 Maryland Ave., S.W. Washington, D.C. 20202-4605. Faculty/Staff/Student Employees Faculty, staff and student employees must complete [UMD's FERPA tutorial](https://umd-registrar.catalog.instructure.com/courses/umd-ferpa-tutorial) prior to being granted access to UMD's student systems."]}