{"https://registrar.umd.edu/grades-records/grades/course-repeats": ["Undergraduate Contact: Records and Registration Services Graduate Contact: Graduate Degree Clearance Services | Course Repeats On this page: Undergraduate Students The following repeat course guidelines apply to ALL courses that may not be repeated for additional credit. The following students are required to follow the repeat guidelines effective Fall 1990: All new freshmen who began at University of Maryland, College Park Fall 1990 and after. - Transfer students from schools other than Maryland community colleges who began at University of Maryland, College Park, Fall 1990 and after. This includes transfer students from another University of Maryland institution. - - There is a limit to the number of times a student may repeat a course. Students may have one repeat of any course in which they earned an A+, A, A-, B+, B, B-, C+, C, C-, D+, D, D-, F, P, S, W, NG or Audit; they cannot be registered (after the schedule adjustment period) for any given course more than twice. A students deans office may grant an exception allowing an additional course repeat. In this case, students must present a plan for successfully completing the course. All attempts will be counted toward the total limit for repeatable credits. Students may not choose the Pass-Fail option when re-registering for a course in which a grade of I has been noted. - Students may repeat no more than 18 credits. Additionally, if a student withdraws from all courses during a semester, those courses are not included in this limit. - The grade point average will include all attempts at a given course that result in a grade of A+, A, A-, B+, B, B-, C+, C, C-, D+, D, D-, or F. However, to help freshmen and transfer students adjust to the University of Maryland, College Park, the following two exceptions allow for the cumulative GPA to be calculated so that only the higher grade is included: When the repeated course was taken within the student's first semester at University of Maryland, College Park, or - When the repeated course was taken within the student's first 24 credit hours attempted (including transfer credits) or within the semester during which the student reached the 24th credit hour attempted. Advanced Placement Exam credits do not count toward the 24 credit count. - - Any grade earned in prior attempts of a repeated course will appear on the student's transcript, regardless of whether the grade is dropped from, or included in, the cumulative grade point average. - Repeat by transfer: If a student repeats by transfer a course that was taken before or during the semester in which the student reached 24 credits attempted (including transfer credits) and the transfer grade is higher, then the original grade in the course will be excluded from the GPA calculation. If the course was taken after the semester in which the student reached 24 credits attempted, the original grade remains in the GPA calculation. - - Source: [ Academic Catalog](https://academiccatalog.umd.edu/undergraduate/registration-academic-requirements-regulations/academic-records-regulations/#repeat). Graduate Students A student may repeat a course in an effort to earn a better grade. Whether higher or lower, the most recent grade will be used in computing the grade point average. Source: [ Academic Catalog](https://academiccatalog.umd.edu/graduate/policies/academic-record/#grade-point-average-computation)"]}