{"https://registrar.umd.edu/grades-records/grades/gpa-calculation": ["Undergraduate Contact: Records and Registration Services Graduate Contact: Graduate Degree Clearance Services | GPA Calculation On this page: Undergraduate Students Grade Point Average (GPA) is a standard calculation of all grades earned at the University of Maryland. GPA calculation is determined by [ policy III-6.00](https://policies.umd.edu/academic-affairs/policy-on-academic-transcripts-and-financial-aid-records-print-this-policyprint-policy) and the quality points for each grade is set by [ policy III-6.20(A)](https://policies.umd.edu/academic-affairs/university-of-maryland-grading-symbols-and-notations-used-on-academic-transcripts). The university calculates two GPAs: Semester GPA: calculation of grades at UMD for a specific term - Cumulative GPA: calculation of all grades at UMD through the most recent graded term - Grade| Quality Points| A+| 4.0| A| 4.0| A-| 3.7| B+| 3.3| B| 3.0| B-| 2.7| C+| 2.3| C| 2.0| C-| 1.7| D+| 1.3| D| 1.0| D-| 0.7| F| 0.0| XF| 0.0| I*| --| P*| --| S*| --| W*| --| NGR*| --| *Courses for which a mark of I, P, S, W, or NGR has been assigned are not included in computing the GPA. Other factors may also impact your GPA calculation, e.g. zero-level courses (MATH003), repeated courses. Please contact your advisor for more information. How to Calculate Your GPA Multiply the attempted credits of the course by the number of quality points assigned to the grade earned. - Add quality points in each course for your total quality points. - Add attempted credits in each course for your total attempted credits. - Divide total quality points by total attempted credits. - This calculation is your GPA. - Example GPA Calculation Course| Grade| Grade's Quality Points| Attempted Credits| Quality Points Earned in Course| ENGL101| A| 4| 3| 12| MATH115| B-| 2.7| 3| 8.1| PHYS121| C+| 2.3| 4| 9.2| MUSC205| F| 0| 3| 0| Total| N/A| N/A| 13| 29.3| GPA = 29.3 divided by 13 = 2.253 (Your GPA is truncated at the thousandths digit without rounding) For additional assistance calculating your GPA, use [Testudo GPA Calculator](https://www.testudo.umd.edu/gpa/index.html) or see an academic advisor. Graduate Students Grade Point Average (GPA) is computed by dividing the total number of quality points accumulated in courses for which a grade of A+, A, A-, B+, B, B-, C+, C, C-, D+, D, D-, or F, has been assigned by the total number of credits attempted in those courses. Each letter grade has an associated quality points value (see table below). Multiplying the quality points value by the number of credits for a particular course gives the number of quality points earned for that course. All courses taken that are numbered 400 and above will be used in the calculation of the grade point average. The following are not used in the calculation of the grade point average: Courses at the 500-level - Courses numbered 799, 898, 899 - Courses graded with an S - Repeated courses will impact GPA calculations. Review [Course Repeats](/node/161/) for more information. Grade| Quality Points| A+| 4.0| A| 4.0| A-| 3.7| B+| 3.3| B| 3.0| B-| 2.7| C+| 2.3| C| 2.0| C-| 1.7| D+| 0.0| D| 0.0| D-| 0.0| F| 0.0| I| 0.0|"]}