{"https://registrar.umd.edu/grades-records/grades/academic-performance": ["Undergraduate Contact: Records and Registration Services Graduate Contact: Graduate Degree Clearance Services | Academic Performance On this page: Undergraduate Students In order to ensure students make successful progress towards a degree at the University of Maryland, the university established requirements for academic performance outlined in [ policy III-8.0(A)](https://policies.umd.edu/academic-affairs/university-of-maryland-student-academic-success-degree-completion-policy). Undergraduate academic performance is based on a student's grade point average (GPA). Students are required to achieve a 2.0 GPA to maintain satisfactory academic progress. A GPA under 2.0 is considered unsatisfactory performance. Students with a GPA under 2.0 will be placed on Academic Probation. A minimum of 120 successfully completed course credits is required for graduation in any degree curriculum; however, individual colleges, schools, and departments may establish higher requirements for graduation. Check with your advisor for specific information. If you feel there are special circumstances that make it impossible for you to complete a normal course load, you must meet with an advisor to discuss the circumstances, plans for continued progress toward a degree, and the implications for continued enrollment. Semester Academic Honors (Dean's List) will be awarded to students who complete, within any given semester (excluding winter and summer terms), 12 or more credits with a semester GPA of 3.5 or higher. This recognition will be noted on the student's academic record. Courses with grades of P and S are excluded from the twelve credit determination. Students will be placed on academic probation if their cumulative GPA falls below 2.0. Normally, a student is expected to attain a 2.0 cumulative GPA at the end of any probationary semester. Students who fail to achieve a 2.0 cumulative GPA at the end of their probationary semester may be academically dismissed, depending on their credit level as detailed below. Students who have earned 60 credits or more will be dismissed from the university in the event their cumulative GPA remains below 2.0 at the end of their probationary semester. Students who are on probation and attain a cumulative GPA of 2.0 at the end of a winter or summer term will not be subject to dismissal in the subsequent semester. - Students who are on academic probation and have earned fewer than 60 credits will be permitted to continue on academic probation if a minimum semester GPA of 2.0 is achieved in each semester of probation. Full-time students must complete 9 or more credits in each semester. A completed credit is defined as credit for any course in which a student receives a grade of A, B, C, D, F, P, or S. - Students who meet this requirement will be permitted to continue on probation until the close of the semester (excluding winter and summer terms) in which they attain a cumulative GPA of 2.0. - Students who are on probation will be dismissed if they have not achieved a cumulative GPA of 2.0 at the end of the semester in which they complete 60 credits. - Students who are on probation and attain a cumulative GPA of 2.0 at the end of a winter or summer term will not be subject to dismissal in the subsequent semester. - - Students who have earned 60 or more credits will be dismissed if their cumulative GPA remains below 2.0 for two consecutive semesters (excluding winter and summer terms). Students who attained a cumulative GPA of 2.0 in the preceding winter or summer term will not be subject to dismissal. - Students who have earned fewer than 60 credits will be dismissed following any probationary semester in which they fail to attain a minimum 2.0 semester GPA and complete the requisite credits detailed in \"Academic Probation.\" Students who attained a cumulative GPA of 2.0 in the preceding winter or summer term will not be subject to dismissal. -", "Students who have been academically dismissed and who are reinstated will be academically dismissed again if a cumulative GPA of at least 2.0 is not achieved by the end of the first semester after reinstatement. Reinstated students will not be allowed to add or drop courses, or to register during any semester without the approval of an academic advisor in their college, unless a cumulative GPA of at least 2.0 is achieved. - The Office of the University Registrar will notify the appropriate university offices when students are academically dismissed and will note the dismissal on the students' academic record. - The Student Success Office will notify students in writing when they are dismissed. The notices will include a statement that registration for the next semester (excluding winter or summer terms) will be cancelled. - Normally, a student dismissed for academic reasons must wait out one semester (fall or spring) before reinstatement. Exceptions will be determined by the Faculty Petition Board. Applications and information about the reinstatement process can be obtained from the [Student Success Office](https://studentsuccess.umd.edu/), which is responsible for administering the reinstatement process in coordination with the Faculty Review Board. - Graduate Students A student whose cumulative grade point average falls below 3.0 will be placed on academic probation by The Graduate School. When a student is placed on probation, The Graduate School will notify both the student and the Graduate Director of the student's program. Permission of the academic advisor and the Graduate Director will be required for a student on probation to register for courses. Probation will be lifted when the student achieves a cumulative GPA of 3.0. A student who has completed fewer than 12 credit hours and has a cumulative grade point average below 3.0 in the first term (semester or 12-week) will receive a warning. A student who has completed 12 credit hours or two or more terms (semester or 12-week) and whose cumulative grade point average is below 3.0 will be placed on probation and have one term (semester or 12-week) to raise their grade point average 3.0 or higher or be dismissed from The Graduate School. If the grade point average cannot be raised to 3.0 in that term, the student will be prevented from registering and will be immediately dismissed from The Graduate School. Additional information can be found in the [ Academic Catalog](https://academiccatalog.umd.edu/graduate/policies/academic-record/#academic-probation-and-dismissal)."]}