{"https://registrar.umd.edu/grades-records/grades/incomplete-grades": ["Undergraduate Contact: Records and Registration Services Graduate Contact: Graduate Degree Clearance Services | Incomplete Grades On this page: Undergraduate Students The mark of \"I\" is an exceptional mark that is an instructor option. It is given only to a student whose work in a course has been qualitatively satisfactory, when, because of illness or other circumstances beyond the student's control, they have been unable to complete some small portion of the work of the course. In no case will the mark \"I\" be recorded for a student who has not completed the major portion of the work of the course [ policy III-6.20(A)](https://policies.umd.edu/academic-affairs/university-of-maryland-grading-symbols-and-notations-used-on-academic-transcripts). How to Request an Incomplete Students who think they meet the requirements for an Incomplete in a course should contact the instructor to discuss the option. - If the instructor agrees, the instructor will download and complete the Incomplete Contract. - Students should review the terms of the Incomplete Contract and sign-off. - When the instructor is submitting grades for the course, the instructor will submit an I to be posted on the student record until the expiration date of the Incomplete Contract. - How to Remove an Incomplete The student is responsible for contacting the instructor to request arrangements for the completion of the work. - The student is responsible for completing the assigned work by the expiration date on the Incomplete Contract. - Once the Incomplete Contract expires, the instructor will either submit an updated grade to be posted to the academic record or the default grade will automatically post to the academic record. - The students academic record, credits and GPA will be automatically updated to include the grade once posted. - Additional information on Incompletes can be found in the [ Academic Catalog](https://academiccatalog.umd.edu/undergraduate/registration-academic-requirements-regulations/academic-records-regulations/#incompletes). Graduate Students An Incomplete \"I\" is a mark that an instructor may award to a student whose work in a course has been qualitatively satisfactory, but who is unable to complete some portion of the work required because of illness or other circumstance beyond the student's control. This is offered entirely at the instructors discretion as a temporary measure for extenuating circumstances. How to Request an Incomplete Students who think they meet the requirements for an Incomplete in a course (other than 799 and 899) should contact the instructor to discuss the option. - If the instructor agrees, the instructor will download and complete the Graduate School Incomplete Contract. - Students should review the terms of the Incomplete Contract and sign-off. - After it is signed by the instructor and the student, the student is responsible for providing a copy of the contract to the director of graduate studies in their program. - When the instructor is submitting grades for the course, the instructor will submit an I to be posted on the student record until the expiration date of the Incomplete Contract. - How to Remove an Incomplete Students are expected to complete courses in which they received an I by a date no more than 12 months from the end of the term (semester or 12-week) in which the course was taken or by date of graduation. Students are responsible for contacting the instructor to request arrangements for the completion of the work. If the instructor is not available, the student can request this from the department chair. - Students are responsible for completing the assigned work by the expiration date on the contract. - Upon completion of the required work by the expiration date on the contract, the instructor will submit an updated grade to be posted. If the instructor is unavailable, the department chair, upon request by the student, will make appropriate arrangements for the student to complete the course requirements. -", "It is the responsibility of the instructor or department chair to submit the grade promptly upon completion of the conditions of the Incomplete Contract. The students academic record, credits and GPA will be automatically updated to include the grade once posted. - Once the Incomplete Contract expires, the default grade will automatically be posted to the academic record. - Additional information on Incomplete Grades can be found in the [ Academic Catalog](https://academiccatalog.umd.edu/graduate/policies/academic-record/#incomplete-grades)."]}