{"https://registrar.umd.edu/grades-records/grades/pass-fail-grading": ["Records & Registration Services | Pass-Fail Grading Pass-Fail grading method is an option for undergraduate students to select in courses that will be used as elective or are not degree requirements. Students should discuss this option with their academic advisor. Instructors will not know a students grading method in a course and are expected to grade students the same across all grading methods. However, when the instructor submits the final grade, it will reflect on the students academic record per [ policy III-6.20(A)](https://policies.umd.edu/academic-affairs/university-of-maryland-grading-symbols-and-notations-used-on-academic-transcripts). Only students who meet the Pass-Fail regulations are allowed to select this grading method. To register for a course under the pass-fail option, an undergraduate must have completed 30 or more credit hours of college credit with a GPA of at least 2.0. At least 15 of these credit hours must have been completed at the University of Maryland, College Park with a University of Maryland GPA of at least 2.0. - Courses for which this option applies must be electives in the student's program. The courses may not be college, major, field of concentration, or general education program requirements. - Only one course per semester may be registered for under the pass-fail option. - No more than 12 semester hours of credit may be taken under the pass-fail option during a student's college career. - Students may not choose this option when re-registering for a course. - When registering under the pass-fail option, a course that is passed will count as hours in the student's record but will not be computed in the grade point average. A course that is failed will appear on the student's record and will be computed both in the overall average and the semester average. - Students registering for a course under the pass-fail option are required to complete all regular course requirements. Their work will be evaluated by the instructor by the normal procedure for letter grades. The instructor will submit a letter grade. The grades A+, A, A-, B+, B, B-, C+, C, or C- will automatically be converted by the Office of the University Registrar to the mark of P on the student's permanent record. The grades D+, D, D-, and F will remain as given. The choice of grading option may be changed only during the schedule adjustment period for courses in which the student is currently registered. - See [Grading Method](/node/146/) for more information."]}