{"https://registrar.umd.edu/myhub": ["Constituent Relations Services | Myhub The University of Maryland has partnered with the National Student Clearinghouse (NSC) to provide official enrollment certifications and degree verifications. NSC Myhub dashboard allows students to obtain these documents and their official transcripts in one convenient place. The benefits of Myhub include: Convenient 24/7 access - Immediate download of enrollment certifications, degree verifications, and good student discount certificates - Students Enrolled at UMD after Fall 2000 with a Directory ID and Passphrase Go to [NSC Myhub](https://auth.myhub.org/stauth/samlfed/sso002103idp). - Login with Directory ID and passphrase. NSC requires multi-factor authentication which will need to be completed. - - After successful login, you will be directed to the Myhub Dashboard. Select Enrollment History to view your enrollment terms at UMD. - Choose the Enrollment History tab for enrollment certifications and good student discount certificates, and the Degrees Earned tab for degree verifications. Expand the box by clicking on the down arrow to view and select the term (as per the term dates) for which you would like to obtain a certification/certificate/verification. - - Select Download Certificate to view your options for enrollment certifications and good student discount certificates. - Select the type of certification/certificate in which you are interested from the drop down box and hit Download. - Your certification/certificate is now available as a PDF. You can view, save, and send it to the recipient of your choice. Note: Upon review of your certification/certificate, if you need additional information (e.g. GPA) that is not on this document from the NSC, please log into [Testudo](https://app.testudo.umd.edu/main/enrollmentCertificationStatus)to request documentation containing the additional information. - - Note: Upon review of your certification/certificate, if you need additional information (e.g. GPA) that is not on this document from the NSC, please log into - Please take note that you can also order your official University of Maryland transcript from this page. To do so, click the Order Transcript button right next to the Download box. This will take you to the NSC transcript ordering site. -"]}