{"https://registrar.umd.edu/faculty-staff/course-classroom-scheduling/classroom-reservations": ["Course & Classroom Scheduling Services Classroom Reservations General Purpose Classrooms (GPC) are available for use to UMD faculty, staff, and affiliates. Scheduling priority is given to academic classes and final exams. All GPC reservations must comply with established practices for the suitable use of academic classrooms and will be scheduled based on space availability. GPC reservation requests must be submitted through 25Live by a department scheduler.| Student Organizations All UMD registered student organizations requesting use of a GPC, must contact the Stamp Student Union - Center for Campus Life at 301-314-8488 or [stamp365classroom@umd.edu](mailto:stamp365classroom@umd.edu). Non-UMD Affiliate Use Those who are not affiliated with the University of Maryland may request to reserve a room by contacting [UMD Conferences & Visitor Services](https://cvs.umd.edu/), the one-stop service coordinator of campus services for conferences, meetings, and events. For more information, please contact 301-314-7777, 301-314-7884, or [conferences@umd.edu](mailto:conferences@umd.edu). Department & Staff Use UMD faculty and staff must contact their [department scheduler](/node/185) to request classroom reservations. Use of GPCs must be in support of the department's objectives or staff duty with the university. Faculty or staff who would like to sponsor non-UMD events that are not directly in support of their duties with the university must seek the colleges approval before submitting a reservation request. Event Reservation Dates Below are the access dates when schedulers can submit GPC reservation requests through [25Live](https://25live.collegenet.com/pro/umd#!/home/dash) for events occurring in the semester. Academic Schedulers| Spring| Dec. 1*| All GPCs| Summer| April 1*| Selected GPCs| Fall| July 1*| All GPCs| Winter| Dec. 1*| Selected GPCs| Campus Programs Schedulers| Spring| Jan. 2*| All GPCs| Summer| April 1*| Selected GPCs| Fall| Aug. 1*| All GPCs| Winter| Dec. 1*| Selected GPCs|"]}