{"https://registrar.umd.edu/grades-records/student-information/change-personal-information/gender-marker-faqs": ["Gender Marker FAQs Students can now select X - non-binary as a gender marker in Testudo. This process has been moved into Testudo so that students can make this change on their own. Students can update their gender marker using [My Profile in Testudo](https://app.testudo.umd.edu/main/profile). Log into Testudo to view your current gender marker in the new \"Demographic\" section and select \"Edit\" to update. Gender markers do not appear on ID cards, class rosters, or transcripts, but can be seen by university employees in various databases and/or reports. In addition, the university started including non-binary designations in its demographics reports in the Fall 2023 term. These reports offer combined data that describes the diversity of our communities, and are available to the public and campus community. More information is available at: [Office of Institutional Research, Planning and Assessment](https://irpa.umd.edu/InstitutionalData/datadefinitions.html). It will be updated immediately in the university's student information system; however, it may take 2 - 7 days to reflect in other systems that use this data. Your gender marker in Testudo will appear on your I-20 and must match your legal sex that appears on your passport per federal regulations. If you have additional questions, please contact [International Student & Scholar Services](https://globalmaryland.umd.edu/offices/international-students-scholar-services). Once you change your gender in Testudo, it will take 24 hours for this update to appear in your [UHC patient profile](https://myuhc.umd.edu/). Double check that your information is updated by clicking \"Profile\" in your patient portal. In order for your insurance to process a medical claim and for your prescriptions to be processed, your gender marker must match what is on your health insurance plan. If you have not changed your gender marker legally, your claim will need to be processed under your legal name and gender. The University Health Center is committed to providing caring, quality, and confidential services to our campus community, [inclusive of all sexual orientations and gender identities](https://health.umd.edu/lgbthealth). If you have more questions about how changing your gender marker will affect your medical care, please [email UHC](mailto:health@umd.edu) or call 301-314-8184. Your housing assignment will not change if you update your gender marker. [Resident Life offers mixed gender and gender inclusive housing](https://reslife.umd.edu/terp-housing/programs-communities#mixed-gender). If you would like to adjust or discuss your housing assignment after updating your gender marker, [contact Resident Life](mailto:reslife@umd.edu). No, Testudo's \"My Profile\" page is not included in \"Parent Access.\" Yes. Students have the option to update their gender marker at any time by logging into Testudo and editing their information on the \"My Profile\" page. No, students who are employees must update their gender marker separately in ARES. If you are a student employee who is choosing \"non-binary,\" for your employee record, you will not be able to update your employee record with \"non-binary\" until the university's [Workday](https://elevate.umd.edu/) system for HR goes live. If you have additional questions, we encourage you to contact the LGBTQ+ Equity Center for assistance: [lgbtq@umd.edu](mailto:lgbtq@umd.edu). Please visit the [Office of Diversity and Inclusion](https://diversity.umd.edu/resources/trans-resources-and-policies) website for more information on resources and policies. All applications for the University of Maryland now accept the \"non-binary\" gender marker."]}