{"https://registrar.umd.edu/faculty-staff/systems-access-training/undergraduate-catalog": ["Need more help? | Undergraduate Catalog The [Undergraduate Catalog for the University of Maryland, College Park](http://academiccatalog.umd.edu) provides information on undergraduate programs, including course descriptions and program requirements, and sets forth the university's academic, registration and graduation policies and regulations. The Undergraduate Catalog is a part of the larger Academic Catalog, which consists of information about the university, the Undergraduate Catalog, and the Graduate Catalog. Departments and units across the university are responsible for updating their Undergraduate Catalog information each year during the catalog editing season (typically February-March). Deadlines for catalog editing will be communicated to editors in January. The university uses the software CourseLeaf Catalog (CAT) to edit and produce the Academic Catalog. The information contained on this page applies to the publication of the Undergraduate Catalog. For information regarding the publication of the Graduate Catalog, please For questions about editing program descriptions, program learning outcomes, or program requirements in CourseLeaf Curriculum Management (CIM), contact | If you are responsible for updating your unit's portion of the Undergraduate Catalog, you will need to be provided with editor access to the catalog. If you need editor access, please see below for instructions. Editors for Academic Colleges/Schools/Departments/Units/Programs: Contact your College's Undergraduate Catalog representative (if you do not know who this is, contact [ug-catalog@umd.edu](mailto:ug-catalog@umd.edu)) - Editors for Administrative Units: Contact [ug-catalog@umd.edu](mailto:ug-catalog@umd.edu) - Editors for Graduate School: Contact [bhernand@umd.edu](mailto:bhernand@umd.edu) - Go to [courseleaf.umd.edu/courseleaf/approve](https://courseleaf.umd.edu/courseleaf/approve). - Select [your role](/sites/default/files/2023-06/ug-catalog-role-listing.pdf)from the Your Role drop-down menu.Editors are provided an email when a page is ready for their review. Selecting the link in the email provided will automatically populate the Your Role field. - - Page(s) ready for your review/edits will be listed under the Page section. - Select the page to view the contents, make edits, or approve the page. - User Guide How-to Videos | | | Trainings for catalog editors are offered each January. Notification of these trainings will be shared with administrative unit editors and college-level editors in December with sign-up instructions. If your unit would benefit from a group training, please contact [ug-catalog@umd.edu](mailto:ug-catalog@umd.edu) to make arrangements. Catalog Editing FAQs You can make changes to your catalog page by following the link in the email sent from CAT/CIM Workflow (umd@notify.courseleaf.com) or by going directly to the [CourseLeaf editing & approval site](https://courseleaf.umd.edu/courseleaf/approve), selecting your role from the \"Your Role\" drop-down menu, and clicking on the page to review. See the Resources section for more in-depth information on how to make edits in the the Catalog Editing and Style Guide or the \"Making Edits to the Catalog,\" how-to video. When you are reviewing your catalog page(s), please check that the content is accurate and up-to-date. Below is an example checklist: Contact information (such as location, phone numbers, emails, websites, program director/faculty names) is up-to-date. - Links to emails and websites are functional When listing email addresses, always list official UMD email addresses (or other, business-associated email address); personal, non-UMD email addresses should not be used. - - There are no \"Course Not Found\" errors", "These errors occur when a course was not an approved course when course information was last imported to the catalog. They are easily identified by a red box surrounding the course. For questions on how to resolve these errors, contact [ug-catalog@umd.edu](mailto:ug-catalog@umd.edu). - - These errors occur when a course was not an approved course when course information was last imported to the catalog. They are easily identified by a red box surrounding the course. For questions on how to resolve these errors, contact - All other information is accurate Curriculum content (program descriptions, learning outcomes, and requirements) is updated via the PCC approval process. For questions on updating curriculum, contact [cmsupport@umd.edu](mailto:cmsupport@umd.edu). - - Curriculum content (program descriptions, learning outcomes, and requirements) is updated via the PCC approval process. For questions on updating curriculum, contact - A program's catalog description, requirements, and learning outcomes come directly from CIM, the university's curriculum management system. Edits to this information must be made in CIM. If the changes you need to make are cosmetic in nature, you can follow this cosmetic change process. See the Resources tab for the how-to video, \"CIM Cosmetic Change Process.\" - If the changes you need to make are not cosmetic in nature, then you will need to submit a proposal and have it go through the PCC approval process. Questions about CIM or the PCC process can be directed to the CIM support email, [cmsupport@umd.edu](mailto:cmsupport@umd.edu). - Please do not delete the existing CIM content (program description/learning outcomes/requirements) from the catalog page. In order for a course's information to display in the catalog, the course must be approved as a regular course in CIM Courses and added to SIS by the Scheduling Office before the catalog is published on June 1. A course not found error could mean: The course is retired - The course is a new course that has not yet been approved, or is approved as a pilot course, which will not display in the catalog - The course was recently approved in CIM and added to SIS, but a course import has not yet been run with the updated course information - Courses that are displaying as not found should be removed if possible. This will require making changes to the program in CIM either through the cosmetic change process or with a PCC proposal. Contact [ug-catalog@umd.edu](mailto:ug-catalog@umd.edu) with questions. You can approve your catalog page on the [CourseLeaf editing & approval site](https://courseleaf.umd.edu/courseleaf/approve). The workflow email you received contains a direct link to the site where you can approve your page. If you no longer have the workflow email, see the [Role Listing document](/sites/default/files/2023-06/ug-catalog-role-listing.pdf) and click the name of the role to go directly to the approval page for your role. This could mean one of two things: Someone else in your catalog editing role has already approved the page. - You have more than one page to approve and need to physically click on each page to approve it. - If someone else has already approved the page, then no further action is required unless you need to make additional changes. Contact [ug-catalog@umd.edu](mailto:ug-catalog@umd.edu) if this is the case."]}