{"https://registrar.umd.edu/registration/separating-university/withdraw": ["Undergraduate Contact: Records and Registration Services Graduate Contact: Graduate Degree Clearance Services | Withdraw from the University Students may request a withdrawal from all classes at any time between the first and the last day of classes for the semester. Students must submit written notice of withdrawal to the Office of the University Registrar no later than the last day of classes. The effective date of the withdrawal for purposes of any refund is the date that the written withdrawal notice is received by the Office of the University Registrar. Non-degree seeking students must follow the same deadlines to request a withdrawal and are subject to the same refund schedules as degree-seeking students. On this page: Undergraduate Students Degree-Seeking Undergraduate Students Students admitted to the University of Maryland are expected to make regular and consistent progress toward the completion of their degree. However, the university understands that in exceptional circumstances a student may find it necessary to completely withdraw from all classes. The university considers such an interruption to be very serious as it delays normal progress toward the degree. Students should not withdraw for frivolous reasons or to avoid the consequences of ignoring their academic responsibilities. Students who have earned a minimum 2.0 cumulative GPA with no previous withdrawal will need to apply for readmission. All other students who find it necessary to leave the university are required to petition the Faculty Review Board in order to be reinstated. (Withdrawals prior to Fall 2002 or those occurring in a summer or winter session will not be considered in this requirement.) Withdrawal Procedures for Degree-Seeking Undergraduate Students Students may request a withdrawal from all classes at any time between the first and the last day of classes for the semester. Students must submit written notice of withdrawal to the Office of the University Registrar no later than the last day of classes. In exceptional cases, a retroactive withdrawal may be granted based on documented requests in which extenuating circumstances significantly impaired the student's ability to complete the semester and officially withdraw by the established semester deadlines. Such circumstances include, but are not limited to, medical or psychological causes. In addition to academic consequences, a withdrawal can have serious effects for students receiving financial assistance, international students, and students in residence halls. It is the student's responsibility to review these potential implications with the appropriate offices listed below before withdrawing: [Student Financial Services & Cashiering](https://billpay.umd.edu/)|[1135 Lee Building](https://maps.umd.edu/map/index.html?&feature=building&name=071&basemap=detailed)| Phone: 301-314-9000[International Student & Scholar Services](https://globalmaryland.umd.edu/offices/international-students-scholar-services)|[1126 H.J. Patterson Hall](https://maps.umd.edu/map/index.html?&feature=building&name=073&basemap=detailed)| Phone: 301-314-7740[Department of Resident Life](https://reslife.umd.edu/)|[2101 Annapolis Hall](https://maps.umd.edu/map/index.html?&feature=building&name=008&basemap=detailed)| Phone: 301-314-2100The effective date of the withdrawal for purposes of any refund is the date that the written withdrawal notice is received by the Office of the University Registrar. For more information on academic deadlines and refund schedule, please see [Dates and Deadlines](/node/80908). Notation of withdrawal and the effective date will be posted on the student's academic record. Instructors and college offices will be notified of all withdrawn students. To withdraw from all courses, students must complete: [Undergraduate Withdrawal Form](/sites/default/files/2023-03/withdrawal-form.pdf)[Survey of Students Leaving the University of Maryland During the Semester](https://umdsurvey.umd.edu/jfe/form/SV_5nmcPftWqFWojOZ)Please return both forms to the Office of the University Registrar, 7999 Regents Dr., First Floor, C. Mitchell Jr. Building, College Park, Maryland 20742; fax: 301-314-9568; or email [registrar-help@umd.edu](mailto:registrar-help@umd.edu).", "Students seeking a retroactive withdrawal must review | Non-Degree Seeking Undergraduate Students Withdrawal Procedures for Non-Degree Seeking Undergraduate Students Students may request a withdrawal from all classes at any time between the first and the last day of classes for the semester. Students must submit written notice of withdrawal to the Office of the University Registrar no later than the last day of classes. The effective date of the withdrawal for purposes of any refund is the date that the written withdrawal notice is received by the Office of University the Registrar. For more information on academic deadlines and refund schedule, please see [Dates and Deadlines](/node/80908). To withdraw from all courses, students must complete: [Non-Degree-Seeking Undergraduate Student Withdrawal Form](/sites/default/files/2023-03/undergraduate-non-degree-seeking-withdrawal-form.pdf) Send the completed form to the Office of the University Registrar, 7999 Regents Dr., First Floor, C. Mitchell Jr. Building, College Park, Maryland 20742; fax: 301-314-9568; or email[registrar-help@umd.edu](mailto:registrar-help@umd.edu).Reenrollment for Undergraduate Students Students who are required to petition the Faculty Review Board for reinstatement may [submit their petition online](https://terpengage.force.com/community/CustomLoginPage). - Students who have a minimum 2.0 cumulative GPA and no previous withdrawals may [apply for reenrollment online](https://studentsuccess.umd.edu/reenrollment-process-application). - Students with questions or concerns about reenrollment should contact the Student Success Office via email at [rr-admit@umd.edu](mailto:rr-admit@umd.edu). - Undergraduate Student Withdrawal FAQs The withdrawal policy applies to undergraduate students who wish to drop all their courses and cease attendance at the university for a semester. Students admitted to the University of Maryland are expected to make regular and consistent progress toward the completion of their degree. There may be exceptional circumstances that require a student to drop all classes and withdraw from school. The university considers such interruptions to be a serious matter as they delay a student's progress toward their degree. Consequently, students should not use the withdrawal process for frivolous reasons or to avoid the consequences of ignoring their academic responsibilities. The University of Maryland is committed to the academic success of its students and wishes to ensure that students fully understand all consequences of withdrawing and have a clear plan for reenrolling and completing their degrees. See the Undergraduate Withdrawal Procedures above for more information. With the exception of students who have earned a minimum 2.0 cumulative GPA with no previous withdrawal, students who find it necessary to leave the university are required to petition the Faculty Review Board in order to return. Students petitioning the Faculty Review Board are also required to complete a Reinstatement Advising Meeting with their academic college advising office before a petition is considered. If you are called to active duty in the U.S. armed forces, you may withdraw and receive a full refund of your tuition and fees for that semester. Students may reenroll upon completion of their tour of duty. See [Active Military Duty](/node/221) for more information. Graduate Students Degree-Seeking Graduate Students Enrolled in a Semester Program Graduate students admitted to the University of Maryland are expected to make satisfactory progress in meeting programmatic requirements, must demonstrate the ability to succeed in their course of studies or research, must attain performance minima specified by the graduate program in all or in particular courses, and complete their degree within the established time limits. Withdrawal Procedures for Degree-Seeking Graduate Students Enrolled in a Semester Program Students may request a withdrawal from all classes at any time between the first and the last day of classes for the semester. Students must submit written notice of withdrawal to the Office of the University Registrar no later than the last day of classes.", "In addition to academic consequences, a withdrawal can have ramifications on financial aid, visa status, graduate student status, and progress toward earning a degree. It is the student's responsibility to review these potential implications with the appropriate offices. Assistantships and Tuition Remission Benefit: Contact your Benefits Coordinator - Fellowship: Contact Advisor and Graduate Program Director - Financial Aid: Contact [Student Financial Services & Cashiering](https://billpay.umd.edu/)|[1135 Lee Building](https://maps.umd.edu/map/index.html?&feature=building&name=071&basemap=detailed)| Phone: 301-314-9000 - F-1 and J-1 Visa Holders: Contact [International Student & Scholar Services](https://globalmaryland.umd.edu/offices/international-students-scholar-services)|[1126 H.J. Patterson Hall](https://maps.umd.edu/map/index.html?&feature=building&name=073&basemap=detailed)| Phone: 301-314-7740 - To request a leave of absence, the student and their department/program must complete the | The effective date of the withdrawal, for purposes of any refund, is the date that the written withdrawal notice is received by the Office of the University Registrar. For more information on academic deadlines and refund schedule, please see [Dates and Deadlines](/node/80908). To withdraw from all courses, students must complete: [Degree-Seeking Graduate Student Withdrawal Form](/sites/default/files/2023-03/degree-seeking-graduate-student-withdrawal-form.pdf) Send the completed form to the Office of the University Registrar, 7999 Regents Dr., First Floor, C. Mitchell Jr. Building, College Park, Maryland 20742; fax: 301-314-9568; or email[registrar-graduate@umd.edu](mailto:registrar-graduate@umd.edu).Non-Degree Seeking Graduate Students For more information for about Non-Degree Seeking student status, see the [Academic Catalog](https://academiccatalog.umd.edu/graduate/policies/admissions-policies/#non-degree-admission-non-degree-seeking-student). Withdrawal Procedures for Non-Degree Seeking Graduate Students Students may request a withdrawal from all classes at any time between the first and the last day of classes for the semester. Students must submit written notice of withdrawal to the Office of the University Registrar no later than the last day of classes. The effective date of the withdrawal for purposes of any refund is the date that the written withdrawal notice is received by the Office of the University Registrar. For more information on academic deadlines and refund schedule, please see [Dates and Deadlines](/node/80908). To withdraw from all courses, students must complete: [Non-Degree-Seeking Graduate Student Withdrawal Form](/sites/default/files/2023-03/non-degree-seeking-graduate-student-withdrawal-form.pdf) Send the completed form to the Office of the University Registrar, 7999 Regents Dr., First Floor, C. Mitchell Jr. Building, College Park, Maryland 20742; fax: 301-314-9568; or email[registrar-graduate@umd.edu](mailto:registrar-graduate@umd.edu)."]}