{"https://registrar.umd.edu/registration/register-classes/waitlist-hold-file": ["Undergraduate Contact: Records and Registration Services Graduate Contact: Graduate Degree Clearance Services | Waitlist & Hold File If a course is full when a student registers, the waitlist/hold file option may be available. Most, but not all courses, offer a waitlist/hold file. Student names are saved to the waitlist/hold file on a first-come, first-served basis and based on the day and time a student confirms placement on the waitlist/hold file. Students will be given a seat in a section if a seat becomes available. Students must process a [Waitlist Check-in](https://app.testudo.umd.edu/main/waitlistCheckin) to officially confirm registration for the course and section. Being placed on a waitlist/hold file for a course section does not guarantee that a student will receive that specific section. The waitlist manages students waiting for a day/time, not instructor or building/room.| Students on a waitlist/hold file must [check-in](https://app.testudo.umd.edu/main/waitlistCheckin)daily during the mandatory waitlist check-in period posted on the[dates and deadlines](/node/80908/)page. If a student does not check-in once a day during the mandatory waitlist check-in period, their name will be removed from the waitlist. - To be eligible for the waitlist/hold file, a student cannot be registered for any other section of the desired course. A student would have to drop the registered section before placing themselves on the waitlist/hold file. A student will be removed from any waitlisted sections if registered for the same course. - Students may place themselves on the waitlist/hold file for up to six (6) sections of a course. A student will be given a seat in the first section that becomes available and all other waitlisted sections will be removed. - Courses received from the waitlist that conflict with a student's schedule or exceed the credit limit must be resolved immediately. Time conflicts and credit overloads cannot remain on a student's schedule without Advising College approval. - Once a student has confirmed a course from the waitlist, it is immediately included on the student's schedule for that semester and incurs tuition charges. - While on the waitlist or hold file, the student is responsible for the material being covered in class. If the student does not receive the course from the waitlist by the end of the mandatory waitlist check-in period, they may not continue to attend the course. - Waitlist & Hold File FAQs The waitlist is an option if you meet the established course requirements (specific majors, credit levels, special populations, etc.) The hold file is a roster of students who wish to register for a course, but who do not meet the course restrictions. These students must be placed on the hold file even though the course may have seats available. At the beginning of the semester, students on the hold file will be placed at the end of the waitlist. Students must then follow the established procedure for waitlist check-in. When you attempt to register for a course (either on Testudo Registration (Drop/Add) or in-person) and the course does not have an available seat, you will have the option to place yourself on the waitlist or hold file, if one is available. You must enter a course and section to add yourself to the waitlist/hold file. For instructions on how to add yourself to the waitlist, follow this [video tutorial](https://testudo.umd.edu/Training/Check-In,%20Add,%20and%20Drop%20form%20Waitlist%20(Dec%2006)%20(V2).mp4). Testudo Waitlist Check-in is available as soon as you are placed on the waitlist or hold file for a course. You may access it during [Testudo's operating hours](https://www.testudo.umd.edu/).", "You are encouraged to check-in when you receive notification that you have received a seat in the course and section. - You are required to check-in daily during the mandatory waitlist check-in period, which can be found on the [dates and deadlines](/node/80908/)page. - To remain on the waitlist you must check-in once a day, either through Testudo or in-person, during the mandatory waitlist check-in period available on the [dates and deadlines](/node/80908/) page. Students that do not check-in will be removed from the waitlist. If a section has already been assigned, it will be given to the next eligible student. It is strongly recommended that you attend all sessions held for a waitlisted course if space permits. By doing so, you are able to keep up with the course material. If you are in the top five (5) positions on a waitlist, you will be given access to the course content in ELMS. Yes, if the course appears in the waitlist section of your course ELMS space, you must still check-in during the mandatory waitlist check-in period to remain on the waitlist. Not all departments offer waitlists for their courses. It is the decision of the department whether or not to offer a waitlist. No, being placed on a waitlist does not guarantee that you will receive a seat. It is recommended that you complete your schedule with alternative course choices. No, to be eligible for the waitlist/hold file you cannot be registered for any other section of the desired course. If you are currently registered for any other section of the course, you must drop that section before you can be placed on the waitlist. If you register for an open section of the same course for which you are already waitlisted, you will be removed from the waitlists. You may select up to six (6) sections of a course. The first section to become available will automatically be assigned to you. Since you will now be registered for a section, your name will be removed from the waitlist for any additional sections of that course. If you subsequently refuse the assigned section, it will be given to the next person on the waitlist. Then you may attempt to register again and be placed on the waitlist at the end of the list. You are encouraged to select a section that fits your schedule unless you plan to drop any course that conflicts with the waitlisted section if it is received. If you do not drop the course that conflicts, you will be notified to resolve the issue in a timely manner or you will be administratively dropped from the course you received from the waitlist. You must contact your advising college for an exception to policy for a time conflict or credit overload. The system identifies the issue when students receive the course, and the issue does not update based on any action. The message can only be removed when a waitlist balance is run, generally weekly. In some cases, if students are waitlisted for other courses and checking-in daily, this message will not go away. As long as a student has taken appropriate action to resolve the issue, the student will not be dropped from the course received from the waitlist. If new sections are opened with exact meeting times of any of your waitlisted sections, you will be automatically confirmed into the new section. You can then process a Waitlist Check-in to officially confirm your registration.", "Students are required to process a Waitlist Check-in once per day during the schedule adjustment period as outlined on the [dates and deadlines](/node/80908/) page. If you receive a seat on the last day of the schedule adjustment period, you can check-in the day after the schedule adjustment period to officially confirm your registration."]}