{"https://registrar.umd.edu/registration/register-classes/add-drop-classes": ["Undergraduate Contact: Records and Registration Services Graduate Contact: Graduate Degree Clearance Services | Add & Drop Classes After an initial registration, students may make changes to their schedule by adding or dropping classes. A student's permanent record and student account may be impacted by the timing of these changes. See below for information about the schedule adjustment period, drop period, and refund schedule. Students who want to drop all their courses are separating from the university. Visit | On this page: Undergraduate Students Schedule Adjustment Period for Undergraduate Students The Schedule Adjustment Period is a designated period of time at the beginning of each term when students can add or drop courses. Courses added will appear on the students permanent record. Courses dropped during this period will not appear on the students permanent academic record. Students are responsible for checking the corresponding [dates and deadlines](/node/80908/) and [Non-Standard Courses](/node/147) for exact Schedule Adjustment dates. There may be a financial penalty for drops during the Schedule Adjustment Period. Review the refund schedule below for detailed information about drops.| Term| Business Daysfor Schedule Adjustment Period | Fall and Spring semester| 10 days| Winter, Summer IA, IB, IIC, IID (3-week sessions)| 1 day| Summer I and II (6-week sessions)| 4 days| Drop Period for Undergraduate Students The Drop Period is a designated period of time after the end of the Schedule Adjustment Period. For undergraduate students, drops during this period will be recorded on the student's permanent record with a mark of W and will not be used in the computation of a student's cumulative grade point average. During this period an undergraduate student may drop a maximum of four credits. However, if the course carries more than four credits, the student may drop the entire course, or in the case of a variable credit course, reduce the credit level by up to four credits. A course dropped with a W will count as an attempt at a course for the purposes of the [undergraduate course repeat guidelines](/node/161). Students are responsible for checking the corresponding [dates and deadlines](/node/80908/) and [Non-Standard Courses](/node/147) for exact dates. Term| Drop Period Ends| Fall and Spring semester| 10th week of semester| Winter, Summer IA, IB, IIC, IID (3-week sessions)| 2nd week of term| Summer I and II (6-week sessions)| 4th week of term| Penalties for Drops During Schedule Adjustment (Refund Schedules) for Undergraduate Students Full-time Undergraduates - Refund Schedule for Drops Full-time undergraduate students do not receive a refund for courses dropped if the total number of credits for which they are registered remains 12 or more. Full-time undergraduate students who drop a course or courses thereby changing the total credits for which the student is registered to 11 or less, will be charged as noted below: Prior to the first day of classes: If a full-time undergraduate student drops a course or courses, thereby changing the total number of credits for which the student is registered to 11 or less, the student will be charged part-time per credit hour tuition. However, if the student later adds a course or courses, thereby changing the total number of credits for which the student is registered to 12 or more, the student will be charged full-time tuition. -", "During the first five days of classes: If a full-time undergraduate student drops a course or courses, thereby changing the total number of credits for which the student is registered to 11 or less, the student will be charged part-time per credit hour tuition. However, if the student later adds a course or courses, thereby changing the total number of credits for which the student is registered to 12 or more, the student will be charged full-time tuition. - After day five of schedule adjustment through the end of schedule adjustment: If a full-time undergraduate drops a course or courses thereby changing the total number of credits for which the student is registered to 11 or less, charges for the semester will be assessed on the basis of part-time per credit hour tuition plus 20% of the difference between the full-time tuition and fees and appropriate part-time charges. - After the Schedule Adjustment Period: There will be no refund for changing from full-time to part-time status. - Part-Time Undergraduates - Refund Schedule for Drops Part-time undergraduates are charged for courses by the credit hour. Students may drop and add courses without penalty provided that the changes are made on the same day and the total number of credits does not change (even exchange). Otherwise, a percentage charge and/or complete charge will be imposed according to the schedule below: Prior to the first day of classes: 100% refund. There will be no charge for courses dropped prior to this date. - [Effective Fall 2023] During the first five days of classes: 100% refund. There will be no charge for courses dropped during this period. For Summer and Winter view the associated [dates and deadlines](/node/80908/)for the no charge drop period deadlines. For non-standard courses, see[non-standard course deadlines](/node/147)for more information. - [Effective Fall 2023] After day five of schedule adjustment through the end of schedule adjustment: 80% refund. There will be a 20% charge imposed for courses dropped during this period. For Summer and Winter terms view the associated [dates and deadlines](/node/80908/)for the no charge drop period deadlines. For non-standard courses, see[non-standard course deadlines](/node/147)for more information. - Anytime after the Schedule Adjustment Period: 0% refund. There will be no refund; students incur the full charge for courses dropped during this period. - Students who wish to cancel their registration or completely withdraw from the university will be held to the refund schedule posted on the | Graduate Students Schedule Adjustment Period for Graduate Students The Schedule Adjustment Period is a designated period of time at the beginning of each term when students can add or drop courses. Courses added will appear on a students permanent record. Courses dropped during this period will not appear on the students permanent record. Students are responsible for checking the corresponding [dates and deadlines](/node/80908/) and [Non-Standard Courses](/node/147) for exact Schedule Adjustment dates. There may be a financial penalty for drops during the Schedule Adjustment Period. Review the refund schedule below for detailed information about drops.| Term| Business Daysfor Schedule Adjustment Period | Fall and Spring semester| 10 days| Winter, Summer IA, IB, IIC, IID (3-week sessions)| 1 day| Summer I and II (6-week sessions)| 4 days| 12-week term| 8 days| Drop Period for Graduate Students", "The Drop Period is a designated period of time after the end of the Schedule Adjustment Period when graduate students may change the number of credits for a course, change the grading method option for a course, or drop a course. Students are responsible for checking the corresponding [dates and deadlines](/node/80908/) and [Non-Standard Courses](/node/147) for exact dates. Term| Drop Period Ends| Fall and Spring semester| 10th week of semester| Winter, Summer IA, IB, IIC, IID (3-week sessions)| 2nd week of term| Summer I and II (6-week sessions)| 4th week of term| 12-week term| 8th week of term| Refund Schedule for Drops for Graduate Students Students may drop and add courses without penalty provided that the changes are made on the same day and that the total number of credits does not change (even exchange). A percentage charge and/or complete charge will be imposed according to the schedule below: Prior to the first day of classes: 100% refund. There will be no charge for courses dropped prior to this date. - [Effective Spring 2023] During the first five days of classes: 100% refund. There will be no charge for courses dropped during this period. For Summer, Winter, and 12-week terms view the associated [dates and deadlines](/node/80908/)for the no charge drop period deadlines. For non-standard courses, see[non-standard course deadlines](/node/147)for more information. - [Effective Spring 2023] After day five of schedule adjustment through the end of schedule adjustment: 80% refund. There will be a 20% charge imposed for courses dropped during this period. For Summer, Winter, and 12-week terms view the associated [dates and deadlines](/node/80908/)for the no charge drop period deadlines. For non-standard courses, see[non-standard course deadlines](/node/147)for more information. - Anytime after the Schedule Adjustment Period: 0% refund. There will be no refund; students incur the full charge for courses dropped during this period. - Students who wish to cancel their registration or completely withdraw from the university will be held to the Refund Schedule posted on the |"]}