{"https://registrar.umd.edu/faculty-staff/systems-access-training/sis-course-scheduling": ["Course & Classroom Scheduling Services SIS for Course Scheduling Course and Classroom Scheduling Services (CCSS) oversees the course scheduling process in the Student Information System (SIS). CCSS staff provides training to new department academic schedulers, conducts workshops, and answers questions to ensure that course information is correctly entered in SIS and that suitable classrooms are assigned. Go to the [UM Account Request Form](https://edoc.umd.edu/kew/EDocLite?edlName=umd.edoc.reg.AccountAccessRequest&userAction=initiate). Enter your UMD credentials if prompted. - Confirm that the User Information section at the top is correct. - Complete the FERPA tutorial if you have not done so already. - Under the Access Request section, select Student Information Systems. Then select either Read Only or Update in the Scheduling section. - - Complete and submit the form. - Only department academic schedulers may be granted access to the SIS Scheduling Office Menu.| Once your SIS account has been created and access has been set, you will receive an email with your SIS MVS ID. The subject of the email will be \"Student Information Systems Access Request\". - Install \"Mocha TN3270\" software from [TERPware](https://terpware.umd.edu/): Select PC or Mac and Network/Connectivity from the left to select the software. If you need assistance, contact the DIT Helpdesk or your local technical support. - Log in to SIS: Enter A on the Enter choice line to access the SIS Production Environment, and hit enter. - Enter your credentials as indicated, and then hit enter: SIS Userid: This will be provided to you in an email when your account has been created and initial access has been set. - SIS Password: Your initial password will be the first 8 digits of your UID; you will then be prompted to change your password. - - Enter 1 on the Choice line to select the CP-ONE Online Navigation Environment, and hit enter. - - Access the Scheduling Office Menu: Type go MU-SC on the SIS command line and hit enter. - Make your selection: You should now be at the Scheduling Office Menu and will see options based on the access that you have been granted. - For additional training, please contact [registrar-training@umd.edu](mailto:registrar-training@umd.edu). SIS Course Scheduling training resources are available on the [Course and Classroom Scheduling](/faculty-staff/course-classroom-scheduling) website. Additional training with a university scheduling staff member may be requested by completing the form below. For comments or questions, email [schedule@umd.edu](mailto: schedule@umd.edu)."]}