{"https://registrar.umd.edu/faculty-staff/systems-access-training/25live": ["Course & Classroom Scheduling Services 25Live 25Live is an online classroom scheduling system for all UMD general purpose classrooms (GPC) managed by Course and Classroom Scheduling Services (CCSS). It allows users to view classroom features such as seat capacity, room layout, AV technology, and room availability. In addition, authorized schedulers who have 25Live accounts may use 25Live to submit online room reservation requests. Only UMD full-time scheduling staff may request a 25Live account. Scheduling staff are those who regularly schedule or coordinate events for their department or unit. Account requests may be sent to [schedule@umd.edu](mailto: schedule@umd.edu). A 25Live account is not required to view room information and room photos. However, a 25Live account is required to access additional course scheduling functionality.| A 25Live account is not required to view room information and room photos. However, a 25Live account is required for the additional functionality indicated in item #4 below.| Go to [ter.ps/25Live](http://ter.ps/25Live). - To view General Purpose Classroom (GPC) information, click on the magnifying glass icon on the Search Locations widget. On Select Object choose Locations from the dropdown menu. - Type the building name or the three-letter code in the search field. - Click on Categories and choose 1 General Purpose Classroom. - Click the Search button. - Results can be viewed under different tabs below: Tab Description List List of all General Purpose Classrooms in the building with room information Calendar Schedule listing of all reservations (classes and events) for the selected period Availability Visual view of all room reservations (classes and events) and availability for a selected day Availability Weekly Visual view of all room reservations (classes and events) and availability for selected week/s - - To search for GPC room features, click on the More Search Options link. Then choose any of the following filters and click GO. Filter Description Categories General Purpose Classroom, TERP Classroom Features Various room features Layouts Physical room layouts Capacity Room seating capacity - If you have a 25Live account, you may sign in to access the following system functionality. Submit an online room reservation - Access to email functions - Run administrative reports - - Additional training with a university scheduling staff member may be requested by completing the form below. For comments or questions, email [schedule@umd.edu](mailto:schedule@umd.edu)."]}